{"text": [{"https://accacia.ai/": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBest Carbon Accounting Platform - Accacia\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAccacia raised $6.5m for real estate decarbonization platform,  Read More >>\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbout Us\nProduct\nUse Cases\nResources\nContact Us\n \n\n\nSchedule demo\n\n\n\n\n\n\nSchedule demo\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSimplify & ScaleReal Estate Decarbonization\n\nAct Now\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMeasure  Scope 1,2 & 3 emissions from asset operations\n\nAutomate data tracking from your utility bills, building management systems, and ERPs. Our platform calculates Scope 1/2/3 emissions for all 23 inventory categories as per GHG Protocol.\nUniquely designed for Real Estate, we have customized Scope 3 modules for >10 asset classes and the largest EF dataset for the industry. \n\n\n\n\n\n\n\n\n\n\n\n\n\nAssess & improve your building designs for   Embodied Carbon\n\nAutomate embodied carbon calculations and compare/contrast design options with Accacia’s embodied carbon module. \nWe have the largest dataset of generic and EPD material emission factors, allowing you to optimize your building designs with the lowest GWP value materials.\n\n\n\n\n\n\n\n\n\n\n\n\n\nCalculate Financed Emissions  for your investment portfolio\n\nCalculate financed emissions for your investment portfolio and understand climate risks by asset class, geography, or investment strategy.\nOur platform allows you to calculate financed emissions as per the PCAF framework while allowing the flexibility to choose between using industry average data vs actual reporting from investee companies.\n\n\n\n\n\n\n\n\n\n\n\n\n\n Set Net-Zero targets and plan+track your decarbonization journey\n\nCommit to net-zero goals and use our AI to plan your decarbonization journey. Our platform also helps with estimated costs and complexity levels of projects.\nUse our marketplace to buy offsets or connect with vendors suitable for your decarbonization projects.\n\n\n\n\n\n\n\n\n\n\n\n\n\nCreate Healthy,High-Performance Interiors\n\nPrioritize occupant health and environmental responsibility with our sustainable solutions. We deliver indoor environments that meet stringent standards like LEED & WELL, ensuring optimal air quality, safety, and sustainability. We provide eco-friendly material selection to create spaces that enhance productivity and well-being.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nReady to revolutionize your carbon reduction strategy today?\n\nSchedule Demo\n\n\n\n\n\n\n\n\nReduce 100+ man hours / month with automation \nReduce 100+ man hours /  month with automation \n\n\n\n\n\nAPI integrations with utility systems, building management systems, and ERPs to automate data collection\n\n\n\n\n\nGet updated Emission Factors to get the most accurate results\n\n\n\n\n\nGranular and actionable insights – from portfolio to asset to inventory level\n\n\n\n\n\nIncrease transparency and maintain auditable trail of your emissions reduction journey\n\n\n\n\n\n\n\n\n\n\n\n\n\nGenerate up to\n36%\nRental Premium\n\n\n\n\n\nIRR up to\n5.7%\nVS 3.5% for brown assets (for 10 years)\n\n\n\n\n\nGet\n25-50 bps\nCheaper cost of capital\n\n\n\n\n\nSave upto\n40%\nIn operating costs By decreasing consumption\n\n\n\n\n\n\n\n\nProducts for the industry \nFrom single-asset to multi-billion dollar portfolios, and from the owners to lenders, assets managers to operators & developers – we’ve got you covered.\n\n\n\n\n\n\n\n\n\nAssets Managers\n\nUnderstand your portfolio & asset-level emissions for owned and managed assets\n\n\n\n\n\n\n\nOperators & Facility Managers\n\nAutomate emissions tracking & decarbonization by integrating BMS & ERPs\n\n\n\n\n\n\n\nDevelopers\n\nAccount for embodied carbon emissions from building materials and construction activity\n\n\n\n\n\n\n\nFunds & Banks\n\nFinanced Emissions for debt & equity investments and risk assessment for your investment portfolio\n\n\n\n\n\n\n\nProperty Insurers\n\nImprove your insurance underwriting process by understanding the transitional risk of your portfolio\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClients & Industry Partners\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAccacia helped us to accurately measure and monitor our carbon emissions across our hotels. The platform’s real-time monitoring capabilities and user-friendly interface enabled us to identify emission hotspots and implement targeted reduction strategies. By following Accacia’s recommendations, we achieved significant emissions reductions and made substantial progress towards our sustainability goals. \n\n\n\n\nSomsakd Srikuruwan  Fulcrum Ventures\n\n\n\n\n\n\nAccacia has surpassed our expectations with its smooth onboarding process and an innovative platform. We look forward to strengthening our relationship with Accacia to support our sustainability journey.\n\n\n\n\nMaulik Jain  Harmony Lifestyles\n\n\n\n\n\n\n\n\n\nAsset Classes served\n\n\n\n\nMulti-family residential\n\n\n\nCommercial & Retail\n\n\n\nHospitality\n\n\n\nCollege Campuses\n\n\n\nData Centers\n\n\n\nHospitals\n\n\n\nLogistics / Warehousing\n\n\n\nIndustrial Parks\n\n\n\nConference / Event Venues\n\n\n\nAirports\n\n\n\n\n\n\n\n\nAccacia in the news \n\n\n\n\n\n\n\nDecember 6, 2022\nAccacia tackles the real estate industry’s massive carbon emissions problem\nView article \n\n\n\n\n\n\n\nDecember 6, 2022\nReal Estate Decarbonisation Platform, Accacia, Raises US$2.5 Million Seed Round Led by Accel and B Capital\nView article \n\n\n\n\n\n\n\nDecember 6, 2022\nReal estate decarbonisation platform, Accacia, raises $2.5mln seed round led by Accel and B Capital\nView article \n\n\n\n\n\n\n\nDecember 6, 2022\nDecarbonisation platform Accacia raises seed funding led by Accel and B Capital\nView article \n\n\n\n\n\n\n\nDecember 6, 2022\nIndia’s accacia raises $2.5m seed round led by accel and b capital\nView article \n\n\n\n\n\n\n\nDecember 8, 2022\nAccel, B Capital lead $2.5m seed round of real estate greentech firm\nView article \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCompanyHome\nAbout Us\nUse Cases\nCareers\nContact Us\n \n\n\nProductMeasure\nReport\nReduce\n \n\nResourcesBlog\nEvents\nPrivacy Policy\n \n\n\nGet StartedGet a Demo\n\n\n\n\n\nCopyright © 2023\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nReach out for your decarbonization needs\nGet started by measuring your carbon emissions and taking the first step towards your decarbonization journey. Let's talk.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\nFirst Name*\n\n\n\n\nLast Name*\n\n\n\n\n\n\nJob Title*\n\n\n\n\nWork Email*\n\n\n\n\n\n\n\nCompany Name*\n\n\n\n\nCountry*\nSelect CountryAfghanistanAlbaniaAlgeriaAmerican SamoaAndorraAnguillaAntarcticaAntigua and BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBosnia and HerzegowinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, the Democratic Republic of theCook IslandsCosta RicaCote d'IvoireCroatia (Hrvatska)CubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEast TimorEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrance, MetropolitanFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuineaGuinea-BissauGuyanaHaitiHeard and Mc Donald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIran (Islamic Republic of)IraqIrelandIsraelItalyJamaicaJapanJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic ofKorea, Republic ofKuwaitKyrgyzstanLao People's Democratic RepublicLatviaLebanonLesothoLiberiaLibyan Arab JamahiriyaLiechtensteinLithuaniaLuxembourgMacauMacedonia, The Former Yugoslav Republic ofMadagascarMalawiMalaysiaMaldivesMaliMaltaMarshall IslandsMartiniqueMauritaniaMauritiusMayotteMexicoMicronesia, Federated States ofMoldova, Republic ofMonacoMongoliaMontserratMoroccoMozambiqueMyanmarNamibiaNauruNepalNetherlandsNetherlands AntillesNew CaledoniaNew ZealandNicaraguaNigerNigeriaNiueNorfolk IslandNorthern Mariana IslandsNorwayOmanPakistanPalauPanamaPapua New GuineaParaguayPeruPhilippinesPitcairnPolandPortugalPuerto RicoQatarReunionRomaniaRussian FederationRwandaSaint Kitts and Nevis<Saint LUCIASaint Vincent and the GrenadinesSamoaSan MarinoSao Tome and Principe<Saudi ArabiaSenegalSeychellesSierra LeoneSingaporeSlovakia (Slovak Republic)SloveniaSolomon IslandsSomaliaSouth AfricaSouth Georgia and the South Sandwich IslandsSpainSri LankaSt. HelenaSt. Pierre and MiquelonSudanSurinameSvalbard and Jan Mayen IslandsSwazilandSwedenSwitzerlandSyrian Arab RepublicTaiwan, Province of ChinaTajikistanTanzania, United Republic ofThailandTogoTokelauTongaTrinidad and TobagoTunisiaTurkeyTurkmenistanTurks and Caicos IslandsTuvaluUgandaUkraineUnited Arab EmiratesUnited KingdomUnited StatesUnited States Minor Outlying IslandsUruguayUzbekistanVanuatuVenezuelaViet NamVirgin Islands (British)Virgin Islands (U.S.)Wallis and Futuna IslandsWestern SaharaYemenSerbiaZambiaZimbabwe\n\n\n\n\nWhat is your net zero goal?*\n2030204020502060Not defined yet\n\n\n\nWhat are you looking for?\nMeasure scope 1, 2 & 3 emissionsMeasure Embodied CarbonMeasure Financed EmissionsDefine your Decarbonization planBecome a vendorExplore investment opportunities\n\n\n\n\n\n\nΔ\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}]}