{"text": [{"https://www.amini.ai/": "Amini - The single source of truth for African environmental data\n\n\n\nJoins us at GTC 2024\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncontact uscontact usmenucloseHomeCareersBlogContactPurpose-built data infrastructureThe single sourceof truth for Africanenvironmental data.Enabling Africa to transform the world, by empowering our ecosystem through data and fostering opportunities for 1B lives.Talk to the founders\n\n\n\n\n\n\n\n\n\nBacked by leading investorsJoins us at GTC 2024\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncontact uscontact usmenucloseHomeCareersBlogContactJoins us at GTC 2024\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ncontact uscontact usmenucloseHomeCareersBlogContactAmini is solving for Africa’s environmental data scarcity.We have developed a holistic solution, utilizing AI and space technologies at scale to drive systemic change and promote economic inclusivity for farmers and supply chain resilience across Africa and beyond.Nairobi, Kenya-1.286389 / 36.817223Driving innovation in pursuit of resilience.By fixing Africa’s data gap, we want to make it a more prosperous, equitable and safe place to live. Amini is a dedicated team united by a common goal: to build at the convergence of people & planet.we are Aminiwe are Aminiwe are AminiMeet our leadersLed by a team of fiercely dedicated and talented people.Get in touch\n\n\n\n\n\n\n\n\n\nFounder & CEOKateKallotHead of OpsMuthoniKarubiuHead of BD EshaniKaushalHead of Data ScienceClinton OduorHead of PlatformsZoëCayetanoHead of Engineering LeonardoAraujoFeatured inWhat we stand forBeliefs that push us beyond our limitsJoin us at Amini\n\n\n\n\n\n\n\n\n\nPeople FirstWe are building for real people, with real needs to make their lives better. For our neighbors, our families and our communities.Planet ConsciousWe believe human advancement does not have to come at the cost of our home. The earth nourishes and sustains us, we work everyday to ensure this continues to be true for generations to come.Technology LeapfroggingWe intend to be a driver for the massive shift that will see Africa emerge as an undisputed force in the global economy.Mission DrivenOur impact on the world will not be in how many features we launched but how many lives were transformed.Open & TransparentAn open and honest value chain in which everyone is fairly compensated, the earth is protected and we hold each other accountable.TestimonialsSupported by industry experts“The scarcity of high quality environmental data of Africa is a concern as it prevents others from building important climate solutions such as for example improving farmer insurance, monitoring climate risk or supply chains. When meeting the team behind Amini we were blown away by their ambition and expertise and we truly believe they are best positioned to fill the environmental data gap of Africa”Heidi LindvallGeneral partner, Pale Blue Dot\"Land use change is one the largest drivers of biodiversity loss, but we can't manage what we can't measure. We're extremely excited to support the team at Amini with their mission to reveal high-fidelity and localized environmental data that will allow major corporate and government decision-makers to adopt targeted sustainability practices, and track their progress.\"Tom Quiggley & Kevin WebbManaging Directors, Superorganism“Risk capital is a vital component of the climate transition and insurance stakeholders needs to innovate faster to address the world’s rapidly changing needs. Our collaboration with the African Development Bank and Amini is a perfect example of a more holistic approach to risk.”‍Eric AndersenPresident, Aon“The Africa Climate Risk Insurance Facility for Adaptation is a model of how strategic collaborations can significantly advance our efforts in climate risk management and agricultural sustainability.‍Aon's global experience in risk management, combined with Amini's technological innovation, forms a strong alliance that supports the Bank's vision for a resilient agricultural sector capable of withstanding and thriving amidst the challenges posed by climate change.”Beth DunfordVice President, African development BankInsightsStay up to date on our latest newsWe regularly share updates about our company, the development of the Amini platform, and research to advance our mission to becoming the single source of truth for African environmental data.See all posts\n\n\n\n\n\n\n\n\n\nreading time: 5Palm Oil: Unveiling the Truth and How Consumers Can Make a Difference  reading time: 5Navigating the Complexities of Palm Oil Production and Regulationsreading time: 5Advancing Agricultural Practices in the Global South with Amini's Precision Technology \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAmini is the single source of truth for African environmental data. By enabling Africa to transform the world, by empowering our ecosystem through data & fostering opportunities for 1B lives.Subscribe to our newsletterThank you. You are now subscribed.Oops! Something went wrong while submitting the form.contact uscontact usJoin usJoin usLITWHomeCareersBlogContactTerms of ServicePrivacy PolicyMade with love in Nairobi\n\n"}]}