{"text": [{"https://www.ampersand.solar/": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHOME | AMPERSAND\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageHOMEWHO WE AREWHAT WE DOOUR IMPACTCAREERS WITH USMEDIA CENTRECONTACT USPAVING THE WAY\nFOR AFFORDABLE,\nLOWER-CARBON\nPUBLIC TRANSPORTAmpersand is Africa’s first electric transport energy company with the longest track record of serving a commercial e-motorcycle fleet and battery swapping network at scale.\n \nWe are creating a world where motorcycle transport is cleaner and more profitable for its consumers than ever before.\n \nGoing electric will double a driver’s income now, and leapfrog Africa towards a zero carbon future.AMPERSAND HAS\n\n\n\n\n\nAvoided nearly \n8,000 tons of emissions\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPowered over \n105 million km\n\n\n\n\n\n\n\n\nIncreased customers income by \n45% per dayFIND OUT MOREOUR CUSTOMERSOur customers work hard. \n \nThey tend to be in their late 20’s - 30’s, work 6 days a week, for an average of 14 hours and covering up to 190km per day. Electric motorcycle drivers earn 50% more than with petrol bikes due to fuel and maintenance savings – They save 40% a year on fuel. The income they generate typically supports 4.4 people.\n \nAmpersand's solution is designed with taxi drivers' in mind. Our guiding philosophy is to offer drivers a motorcycle and energy that costs less to acquire and operate, outperforms their current setup in every way, and happens to be electric. Battery swaps are faster than refuelling, cost less than a tank of petrol, and take the driver further. We take care of the batteries’ maintenance and financing is also available.FIND OUT MOREOUR TECHNOLOGYAmpersand has developed a business model and technology that seamlessly fits drivers' operations. We have created a network of swap stations that allow drivers to access smart batteries as and when they need them.\n​\nOur technology captures live battery data every 30 seconds, resulting in greater efficiency, meaning that our solution can electrify Africa’s motorbikes quickly.FIND OUT MORETHANKS TO OUR PARTNERSContactEMAIL\n​\ninfo@ampersand.solar\n​\nADDRESS\n​\nAmpersand Rwanda\nKK 6 Av, Road to MAGERWA, \nOpposite NAEB, \nRwanda\n​​\nAmpersand E-Mobility Kenya\nOld mombasa Road;\nGate 2 Warehouse 11&12\n\n\n\n\n\n\n\nbottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.ampersand.solar/about": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWHO WE ARE | AMPERSAND\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageHOMEWHO WE AREWHAT WE DOOUR IMPACTCAREERS WITH USMEDIA CENTRECONTACT USWORLD-CLASS R&DAmpersand is Africa’s first electric transport energy company with the longest track record of serving a commercial e-motorcycle fleet and battery swapping network at scale. Since Ampersand was founded in 2016, it has grown to be best in class for technology and performance, with more than 300 employees and a presence in Rwanda and Kenya.\nThrough extensive testing and R&D, Ampersand has grown its fleet to a current 1,350, and is expected to surpass 10,000 by the end of 2024. By powering commercial transport through its reliable electrical energy supply, Ampersand is paving the way for affordable, lower-carbon public transport, creating green jobs.EVOLUTIONJune 2023\nFleet reaches 1000 e-motorcycles on the roads of Kenya and Rwanda and 115,000 monthly swaps\n\n\n\n\nDecember 2022\nFleet reaches 800 vehicles and 80,000 battery swaps per month0 monthly swaps\n\n\n\n\nJuly 2022\nAmpersand arrives in Kenya, delivering the first e-motorcycles to Boda customers\n\n\n\n\nApril 2022\nSeries production begins at 30 vehicles \nper week\n\n\n\n\n2021\n60 vehicles in commercial operation\n\n\n\n\n2019\nCommercial launch: 3 swap stations across Kigali and fleet of 20 e-moto taxis\n \nRwanda announces mototaxi electrification goals\n\n\n\n\n2018\n​Five different prototype vehicles tested in Kigali: on road, in the lab, and with customersOUR MISSIONLead the shift to clean, affordable mobility through unmatched customer experience.OUR VISIONA world where motorcycle transport is cleaner and more profitable for its consumersOUR TEAMHeadquartered in Kigali, Ampersand has grown from a tiny bootstrapped R&D garage project into Africa's leading electric vehicle operation, with a team of more than 200 staff in Rwanda, Kenya, and Germany.\n​\nAll Ampersand motorcycles and batteries are assembled on-site by our talented team. Investing in the next generation of African developers and engineers is crucial to putting Africa on the map and leading the way with new technologies. \n \nThat’s why we host a number of intern roles in all departments and are always on the lookout for fresh talent who are excited by our vision.OUR VALUESCustomer-centric EverydayWe prioritize our customers daily, tailoring solutions to exceed expectations.Challenge The Status Quo Through InnovationOur dedicated teams constantly challenge the status quo, driving innovation to enhance customer experiences and deliver solutions that go beyond expectationsLove Solving Problems TogetherInternal collaboration is our approach; we thrive on solving challenges alongside our customers.Stay AgileWe stay agile to swiftly meet dynamic customer needs and adapt to a changing landscape.Driven By People And PlanetBeyond business, we're committed to people and the planet, ensuring a positive impact.EMAIL\n​\ninfo@ampersand.solar\n​\nADDRESS\n​\nAmpersand Rwanda\nKK 6 Av, Road to MAGERWA, \nOpposite NAEB, \nRwanda\n​​\nAmpersand E-Mobility Kenya\nOld mombasa Road;\nGate 2 Warehouse 11&12\n\n\n\n\n\n\n\nbottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.ampersand.solar/technology": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWHAT WE DO | AMPERSAND\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageHOMEWHO WE AREWHAT WE DOOUR IMPACTCAREERS WITH USMEDIA CENTRECONTACT USBUILDING THE FUTURE OF ENERGY FOR TRANSPORTOur business model and technology are designed to fit seamlessly with drivers' operations. Drivers access smart batteries on demand from the network of Ampersand swap stations.\n​\n​With our solution drivers enjoy the savings of e-mobility without the upfront cost, and risk of buying a lithium battery pack or increasing downtime while waiting for batteries to recharge.\n \nRenting a charged battery from Ampersand saves drivers around 35% compared to fuel and oil changes. Each battery delivers around 350,000 km of range over its lifetime, and 50-110km per swap depending on the type of usage, the roads travelled, and weight carried. This means drivers need to swap out less frequently than drivers in East Africa typically refuel with petrol. It's all made possible by Ampersand's unique Amper-Ops connected network of smart batteries, swap stations, and a vehicle drivetrain tailored to our customers' needs and African roads.HOW IT WORKS\n\n\n\n\n\n\n1. Drivers purchase or leases a pay-as-you-drive Ampersand e-moto\n\n\n\n\n\n2.Through Ampersand’s Driver App, they check when the battery is low and visit a battery swap station\n\n\n\n\n\n3.In less than 2 minutes, Ampersand swaps out the depleted battery for a new one and the driver pays for the energy used\n\n\n\n\n\n\n\n\n\n\n\n\n4. The driver continues their day, swapping when requiredMEET THE AMPERSAND GEN3 MOTORCYCLEMEET THE BATTERY THAT POWERS IT ALL: SMART HM17Ampersand has created the future of battery fleet management through our proprietary Amper-Ops online and mobile platforms.  \n \nAmper-Ops agile system allows for: \n \n\n\nSeamless management of battery packs with customizable parameters such as state of health analysis and geofenced alarms\n\n\n\n\nCustomizable insights to intimately understand the ROI of each station, driver, and battery and respond in real-time\n\n\nSmart maintenance systems that automatically alert us to required battery or vehicle repairs before breakdowns happen\n\nSEAMLESS SWAPS\nWITHIN SECONDSAmpersand's Swap App is the key to managing swap stations effectively and efficiently. The app helps streamline operations by:\n \n\n\nReal-time swap processing\n\n\nBattery charge rate tracking\n\n\nAutomating the payment process\n\n\nWorks online or offline\n\n\nQuick battery locating in stations for optimal throughput\n\nOUR SOFTWARE PLATFORM MAKES THE ENERGY\nTRANSITION EASYAN EXPERIENCE WHERE DRIVERS KNOW EXACTLY\nWHAT’S GOING ONAmpersand's Driver App revolutionizes vehicle management, providing drivers with effortless vehicle safety management. The Driver App empowers drivers by:\n \n\n\nEnabling them to check the current battery level\n\n\nAllowing real-time information on battery levels in stations\n\n\nHelping them locate the nearest swap station and discounts\n\n\nKeeping track of swaps and swap transactions\n\nEMAIL\n​\ninfo@ampersand.solar\n​\nADDRESS\n​\nAmpersand Rwanda\nKK 6 Av, Road to MAGERWA, \nOpposite NAEB, \nRwanda\n​​\nAmpersand E-Mobility Kenya\nOld mombasa Road;\nGate 2 Warehouse 11&12\n\n\n\n\n\n\n\nbottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.ampersand.solar/impact": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOUR IMPACT | AMPERSAND\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageHOMEWHO WE AREWHAT WE DOOUR IMPACTCAREERS WITH USMEDIA CENTRECONTACT USPASSIONATE ABOUT CLIMATE CHANGEAmpersand was founded to achieve a crucial tipping point in the fight against climate change: the world's first mass-market electric vehicle that costs less to acquire, maintain, and operate than a fuel vehicle.\n\nYears of work have gone into identifying the right market and designing the vehicle and business model hand in hand with our users to get the right fit.\n\nWe make the electric option the obvious choice for our customers by putting serious money back into the pockets of drivers and their families.\n\nIn the process, we help propel the EV industry to scale and prove to the world that the fuel age is over and electric mobility is for everyone.OUR CUSTOMERRight now, there are 22 million commercial motorcycles in Africa. Moto-taxis effectively navigate congestion while transporting 100M people in East Africa every day.\n​\n \nMany drivers spend over $11 daily on fuel and vehicle leasing costs but take home as little as $1.60 each day.\n \n \nAmpersand can save customers 50% of their savings compared to internal combustion engine motorcycles.REDUCING EMISSIONSAmpersand’s e-motos cost less than petrol ones to lease or buy and half as much to power. They produce 75% less lifecycle greenhouse emissions than petrol motorbikes using grid power and over 98% less using renewables.\n​\nOur battery packs are built to our own design and are assembled by our constantly expanding team in Rwanda.MEET OUR CUSTOMERS\n\n\n\n\n\nWith the Ampersand\ne-moto, maintenance costs are lower as we don’t need chain and oil which cost a lot. Now I benefit more from my income and I am able to start saving.\n​\nGitwaza\n\n\n\n\n\nWorking with Ampersand is a great opportunity for me as apart from their innovation they care about our personal life. They helped us during the lock-down and are flexible in terms of contracts.\n​\nRukundo\n\n\n\n\n\nMy life has changed and is better than when I had my previous moto. I can save extra money I would have used on fuel. I don’t waste time at the garage anymore. With my previous motorcycle I had to go at least 2 days a week.\n​\nEtienneEMAIL\n​\ninfo@ampersand.solar\n​\nADDRESS\n​\nAmpersand Rwanda\nKK 6 Av, Road to MAGERWA, \nOpposite NAEB, \nRwanda\n​​\nAmpersand E-Mobility Kenya\nOld mombasa Road;\nGate 2 Warehouse 11&12\n\n\n\n\n\n\n\nbottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.ampersand.solar/mediacentre": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNews (All) | AMPERSAND\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageHOMEWHO WE AREWHAT WE DOOUR IMPACTCAREERS WITH USMEDIA CENTRECONTACT USNEWSPRESS RELEASE: New Zealand Foreign Affairs Minister inaugurates Ampersand E-Motorbike Battery Swap Station in Kigali, Rwanda. CopyRead MorePRESS RELEASE: Ampersand raises USD 19.5 million in equity funding round & debt facilityRead MoreBboxx Partners With Ampersand To Provide Thousands Of Electric Motorcycle Taxis For Riders In RwandaRead MoreThese 8 start-ups are helping transform fast-growing cities for the futureRead MoreAmpersand Aims To Have 600,000 Electric Motorcycles Across East Africa By 2030Read MoreCleanTechnica: Ampersand Partners With TotalEnergies Kenya To Roll Out Electric Motorcycle Battery Swapping Stations In KenyaRead MoreFrance 24: The Rwanda start-up helping motorcycle taxis go electricRead MoreBYD and Ampersand to collaborate on electrifying Africa’s transport systemRead MorePRESS RELEASE: Ampersand achieves major milestone with 1,000 electric motorcycles on East African roadsRead MoreCNN: African electric motorbike company, Ampersand goes for growthRead MoreBBC: Rwanda goes electric with locally made motorbikesRead MorePRESS RELEASE - Ampersand Secures $9 Million USD debt facility from the U.S. International Development Finance Corporation (DFC) to Scale OperationsRead MoreLOAD MORE\n\n\n\n\nEMAIL\n​\ninfo@ampersand.solar\n​\nADDRESS\n​\nAmpersand Rwanda\nKK 6 Av, Road to MAGERWA, \nOpposite NAEB, \nRwanda\n​​\nAmpersand E-Mobility Kenya\nOld mombasa Road;\nGate 2 Warehouse 11&12\n\n\n\n\n\n\n\nbottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}]}