{"text": [{"https://www.azul-energy.co.jp/en/": "\n\n\n\n\nAZUL Energy\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTOP PAGE\nAbout us\nTechnology\nNEWS\nCONTACT US\nLINKS\næ¥æ¬èª\n\n\n\n\nLatest News\n\n2024.04.15AZUL Energy and Tohoku University Launch Bio-Inspired Emergence GX Co-Creation Center\n2024.03.28AZUL Energy and Tohoku University creat a reliable means of predicting the performance of a new and promising type of catalysts\n\n2024.03.19AZUL Energy and Tohoku University Develop Eco-Friendly Battery Using Magnesium and Paper\n2024.02.27AZUL Energy and ABOUND Energy Announce Strategic and Financial Agreement to Advance Air Cathode Technologies\n2024.02.05AZUL Energy Raised Â¥475 Million ($3.2 Million) in Series A Funding\n2023.06.26Azul Energy Selected for 2023 U.S. Early Stage Program Sponsored by Startup Accelerator MassChallenge\n2023.05.12AZUL Energy is on the video that the Cabinet Office made for G7 Sendai Science and Technology Minister's Meeting\n2023.04.27AZUL Energy Succeeds in Significantly Increasing the Voltage and Power Density of Metal-air Batteries, a Next-Generation Energy Device\n2023.02.28Press release regarding the conclusion of a business alliance agreement with Nippon Kayaku Co., Ltd.\n2023.01.16AZUL Energy visits the United Arab Emirates (UAE) with Minister Nishimura of Japanâs Ministry of Economy, Trade and Industry under initiatives for the Japan-UAE Coordination Scheme for Advanced Technology (JU-CAT)\n2022.12.14FUSE Vol.3 DIVERS\n2022.09.21Japan Science and Technology Agency (JST) - Selected for the Future Society Creation Project in the area of Solutions to Emerging Social Issues\n2022.09.15Exhibiting at ROBOTES EXPO 2022\n\n\n\n\n\n\nOur mission\nInnovation for Sustainability\n\nWith rare metal-free catalytic technology, we innovate next-generation energy devices and realize a sustainable and decarbonized society.\n\n\n\n\nWhy AZUL catalyst\n\n\n\nEmbrace a brighter future with us as we lead the charge towards a sustainable, low-carbon world. Harnessing the power of renewable energy has never been more efficient or essential.\nImagine a world where energy storage in vast quantities becomes the norm, where the simplicity of water electrolysis brings forth hydrogen to fuel our lives, and where synthetic fuels emerge through the smart decomposition of carbon dioxide.\n\n\nAZUL Energy stands at the forefront of this revolution, offering a groundbreaking alternative to the costly and scarce rare metals that have long been the backbone of electrochemical reactions. Our innovative AZUL catalyst is a game-changer, delivering exceptional performance without relying on platinum or iridium. With AZUL, we are not just promising a solution; we are actively building the pathway to a cleaner, more efficient, and infinitely possible tomorrow.\n\n\n\n\n\n\n\nAZUL catalyst\n\nAZUL catalyst is a rare metal-free catalyst inspired by Heme in Hemoglobin that has diverse biological functions such as detection/transportation of diatomic gases, chemical catalyst, and electron transfer.\n\n\n\n\n\nAZUL catalyst has the world highest level performance comparing to existing materials or reported catalysts like platinum, carbon alloy, or large cyclic molecules.\n\n\nAZUL catalyst can be manufactured via the conventional chemical process and the production cost is 10 times lower than platinum catalysts in mass production phase.\n\n\n\n\n\n\n\n\nProducts & Services\n\n\n\nAZUL molecule\n\nDiscover the unparalleled potential of AZUL moleacule.\nWith an extensive selection from over 300 unique molecule libraries, we're dedicated to providing you with the optimal AZUL molecule tailored precisely to your systemâs requirements. Elevate your technology with our cutting-edge solutions designed for maximum performance and efficiency.\n\nAZUL catalyst\n\nExperience the exceptional quality of our AZUL catalyst - a premium blend of AZUL molecules synergistically bonded to carbon materials. It's the ideal choice for making electrodes with your specialized processes.\n\nAZUL catalytic electrode\n\nUnlock the full potential of our plug-and-play solutionâsimply integrate it with your cell to experience our cutting-edge performance.\n\n\n\n\n\n\nTeam AZUL\n\n\n\nKoju Ito\nCEO, Founder\n\n\n\n\nMasayuki Hayashi\nCOO\n\n\n\n\nHiroshi Yabu\nCSO, Founder\n\n\n\n\nHiroya Abe\nFounder\n\n\n\n\nKeisuke Oku\nCTO\n\n\n\n\n\n\n\n\nAZUL History\n\n2019 Jul.Founded in Miyagi, Japan\n2019 Oct.Selected as one of the Innovation Leaders Summitâs Top 100 Startup Companies\n2019 Oct.Tohoku University issued a press release about our research paper\n2019 Dec.Laboratory established at Tohoku University Material Solutions Center (MaSC)\n2020 Feb.Raised JPY 60 Million in Seed Funding\n\n2020 Jul.Featured in Nikkei Sangyo Shimbun as a next-generation battery startup\n2020 Nov.AZUL Energy selected for J-Startup TOHOKU\n2021 Jun.Raised JPY 100 Million in Pre-Series A Funding\n2021 Sep.Strategic capital and business alliance with De Nora S.p.A. (Italy), a global player in water electrolysis systems for hydrogen production\n2023 Jan.AZUL Energy visited the United Arab Emirates (UAE) with Minister Nishimura of Japanâs Ministry of Economy, Trade and Industry under initiatives for the Japan-UAE Coordination Scheme for Advanced Technology (JU-CAT)\n2023 Feb.Business alliance agreement with Nippon Kayaku Co., Ltd.\n2023 Jun.Azul Energy selected for 2023 U.S. Early Stage Program Sponsored by Startup Accelerator MassChallenge\n\n\n2024 Feb.Raised JPY 475 Million in Series A Funding\n\n\n\n\n\nCONTACT US\n\n\n\nName\n\nCompany Name\n\nE-mail\n\nEnquiry type\n\n\n--\nBusiness Enquiry\nCareers\nPress\nGeneral Enquiry\n\n\nMessage\n\n\n\n\n\n\nAZUL Energy will never share this information with other organizations.\n\n\n\n\n\nLINKS\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAZUL Energy Inc.\n\nTokyo Office\nToranomon Hills Business Tower 15F, CIC Tokyo1-17-1 Toranomon, Minato-ku, TokyoJapan\nHead Office\nSendai Trust Tower 10F, CROSSCOOP1-9-1 Ichibancho, Aoba-ku, Sendai-shi, Miyagi, 980-0811Japan\nMaSC Lab.\nRoom 501, MaSC, Tohoku University2-1-1 Katahira, Aoba-ku, Sendai-shi, Miyagi, 980-8577Japan\nRTF Lab.Room 203, Fukushima Robot Test Field (RTF)\nOn the premises of Minamisoma reconstruction industrial park, 83 Shin-akanuma, Kaibama, Haramachi-ward, Minamisoma City, Fukushima, 975-0036 \nJapan\n\n\n\n© 2019 AZUL Energy\n\nBack to Top\n\n\n\n\n\n\n "}]}