{"text": [{"https://carboncapture.com": "\n\nCarbonCapture Inc. | Direct air capture for a net zero future\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    Buy credits\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n            Our technology\n        \n\n\n \n            Who we are\n        \n\n\n \n            Careers\n        \n\n\n \n            Newsroom\n        \n\n\n \n            Contact us\n        \n\n\n\n\n\n\n\n\n\nFollow us\nGet our newsletter\n\n\n\n\n\n\n\n\n\nFollow us on LinkedIn\n\n\nFollow us on Instagram\n\n\nFollow us on Facebook\n\n\nFollow us on Facebook\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWho we are. What we do. Why we do it.\nPlay video\n\n\n\n\n\n\n\n\n\n\n\nWhat we’re up to\n\n\n\n\n\n\nLeo Series\n\n\n\n\n\n\nThe first U.S. DAC system designed for mass production\n\n\n\n\n\n\nProject Bison\n\n\n\n\n\n\nOur multi-megaton carbon removal project in Wyoming leading in a new era of large-scale DAC projects in the U.S.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFollow us on LinkedIn\n\n\nFollow us on Instagram\n\n\nFollow us on Facebook\n\n\nFollow us on Facebook\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCarbonCapture Inc.\n\n\n\n\n\n\n\nDirect air capture: modular, scaleable, made in the U.S.A.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAnnouncementJune 21 2024\nCarbonCapture Inc. unveils first U.S. direct air capture system designed for mass production\nModular units to be manufactured at new high-volume facility in Mesa, Arizona\nRead article\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nModular DAC\n\n\n\n\n\n\n\nIntroducing the Leo Series\n\n\n\n\n\n\n\nThe first U.S. DAC system designed for mass production\n\n\n\n\n\n\nEach Leo Series DAC module is the size of a standard shipping container and capable of capturing over 500 tons of carbon dioxide (CO₂) from the atmosphere each year. Modules can be connected in arrays to capture large volumes of CO₂.\n\n\n\n\n\n\nAvailable to developers of carbon removal projects worldwide starting in 2025.\n\n\n\n\n\n\n\n\n\n    Contact us\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhat we do\n\n\n\n\n\n\n\nDAC: the basic concept\n\n\n\n\n\n\nEngineered atmospheric carbon removal\n\n\n\n\n\n\nCarbonCapture’s DAC systems use solid sorbents that soak up atmospheric carbon dioxide when cooled and release it when heated. The carbon dioxide thus captured can then be permanently stored underground or used to make sustainable fuels, low-carbon concrete, carbon black, or other valuable industrial products.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOur technology\n\n\n\n\n\n\n\nModular to the core\n\n\n\n\n\n\nOur modular open system architecture (MOSA)\n\n\n\n\n\n\nOur DAC system are deeply modular, consisting of components designed for high volume manufacturing that stack in nested tiers so that innovation can occur within a level without requiring adjustments to other levels. This approach allows for incremental upgrades, minimizing obsolescence risk and speeding up development cycles.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nU.S. deployments\n\n\n\n\n\n\n\nOur DAC carbon removal projects\n\n\n\n\n\n\nWe not only design and manufacture modular DAC systems – we also deploy them in our carbon removal projects. This hands-on approach allows us to continuously improve our system’s efficiency, maintainability, and ease of deployment.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlay video\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nProject\n\n\n\n\n\n\n\nBison\n\n\n\n\n\n\nOur multi-megaton carbon removal project in Wyoming is leading a new era of large-scale DAC projects in the U.S.\n\n\n\n\n\n\n\n\n\n    Learn more\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nProject\n\n\n\n\n\n\n\nSonora\n\n\n\n\n\n\nDetails coming soon.\n\n\n\n\n\n\n\n\n\n    Stay informed\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNews highlights\n\n\n\n\n\n\n\n\n\n\n\n    All news\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAnnouncementJune 21, 2024\n\nCarbonCapture Inc. unveils first U.S. direct air capture system designed for mass production\n\n\n\n\n\n\nAxiosJune 21, 2024\n\nCompany to unveil first CO₂ capture module for mass production\n\n\n\n\n\n\n\nCowboy State DailyJune 24, 2024\n\nI’ve Seen A Key Part Of Wyoming’s All-Of-The-Above Energy Strategy\n\n\n\n\n\n\n\nAnnouncementJune 6, 2024\n\nCarbonCapture Inc. secures lease for  world’s first DAC  manufacturing facility\n\n\n\n\n\n\nAnnouncementMay 29, 2024\n\nCarbonCapture wins initial award as part of DOE's Carbon Dioxide Removal  Purchase Pilot Prize program\n\n\n\n\n\n\n\nAnnouncementMarch 12, 2024\n\nCarbonCapture Inc. closes $80 million Series A financing\n\n\n\n\n\n\nCanary MediaMarch 14, 2024\n\nCarbonCapture wants to take carbon removal down the cost curve\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe gold standard\n\n\n\n\n\n\n\nCarbon removal credits of the highest quality.\n\n\n\n\n\n\nWe create high-quality carbon removal credits by combining atmospheric carbon removal with permanent geological storage.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMeasurable\n\n\n\n\n\n\nThe exact amount of CO₂ our DAC systems capture is precisely metered and measured.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nVerifiable\n\n\n\n\n\n\nFor each carbon removal credit we deliver, we provide a complete third-party verification report.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPermanent\n\n\n\n\n\n\nThe CO₂ we capture is securely locked away for more than 1,000 years in deep saline aquifers via Class VI injection wells.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAdditional\n\n\n\n\n\n\nWithout your financial support, DAC carbon removal wouldn't otherwise occur. They’re 100% additional.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBuy our DAC credits\n\n\n\n\n\n\n\n\n\n\nJoin many of the world’s leading and innovative companies in purchasing our DAC carbon removal credits.\n\n\n\n\n\n\n\n\n\n\n\n\n    Learn more\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCareers\n\n\n\n\n\n\n\nJoin us on our mission to decarbonize the atmosphere\n\n\n\n\n\n\nWe’re looking for good people to join our highly motivated and incredibly talented team. If you’re interested, let us know!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    Learn more\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhat can we do for you?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    Contact us\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\nClients\n\n\n\n\n\n\n\n\n\nBuy DAC credits\n\n\n\n\n\n\n\n\nBuy DAC systems\n\n\n\n\n\n\n\n\n\n\nJoin us\n\n\n\n\n\n\n\n\n\nSee open positions\n\n\n\n\n\n\n\n\nCareers\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFollow us\n\n\n\n\n\n\nGet our newsletter\n\n\n\n\n\n\n\n\n\nPress inquiries\n\n\n\n\n\n\npress@carboncapture.com\n\n\n\n\n\n\n\n\n\n\n\n\nFollow us on LinkedIn\n\n\nFollow us on Instagram\n\n\nFollow us on Facebook\n\n\nFollow us on Facebook\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTerms of service\nPrivacy policy\n\n\n\n\n\n\n\n\n\n\n© 2024 CarbonCapture Inc.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGet the latest news from CarbonCapture\nSign up to receive the latest news and updates\n\n\n\n\n\n\n\n\n\n\n\nLet’s start the conversation\nLet us know more about your carbon removal credit needs, and someone from our team will get in touch with you very soon.\n\n\n\n\n\n\n\n\n\nWhat can we do for you?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.carboncapture.com/purchasing-crc": "\n\nCarbonCapture Inc. | Purchase our DAC CRC\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    Buy credits\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n            Our technology\n        \n\n\n \n            Who we are\n        \n\n\n \n            Careers\n        \n\n\n \n            Newsroom\n        \n\n\n \n            Contact us\n        \n\n\n\n\n\n\n\n\n\nFollow us\nGet our newsletter\n\n\n\n\n\n\n\n\n\nFollow us on LinkedIn\n\n\nFollow us on Instagram\n\n\nFollow us on Facebook\n\n\nFollow us on Facebook\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWho we are. What we do. Why we do it.\nPlay video\n\n\n\n\n\n\n\n\n\n\n\nWhat we’re up to\n\n\n\n\n\n\nLeo Series\n\n\n\n\n\n\nThe first U.S. DAC system designed for mass production\n\n\n\n\n\n\nProject Bison\n\n\n\n\n\n\nOur multi-megaton carbon removal project in Wyoming leading in a new era of large-scale DAC projects in the U.S.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFollow us on LinkedIn\n\n\nFollow us on Instagram\n\n\nFollow us on Facebook\n\n\nFollow us on Facebook\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBuy carbon removal credits\n\n\n\n\n\n\n\nCarbonCapture is accepting advanced purchase commitments for our DAC carbon removal credits.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCustomers & partners\n\n\n\n\n\n\n\nBe a part of the solution\n\n\n\n\n\n\n\nJoin many of the world’s leading and innovative companies in purchasing our DAC carbon removal credits.\n\n\n\n\n\n\n\n\n\n    Contact us\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBuy credits\n\n\n\n\n\n\n\nTake a leading role in the fight against climate change\n\n\n\n\n\n\n\nBuy DAC carbon removal credits to offset your unavoidable emissions.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUp to 100 metric tonsIndividuals & small businessesInstantly buy our carbon removal credits through Patch, our e-commerce partner.\nContact us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOver 100 metric tonsLarge companies or enterprisesTo buy large quantities of DAC carbon removal credits, contact our development team.\nContact us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHow we generate carbon credits\n\n\n\n\n\n\n\nDAC: the basic concept\n\n\n\n\n\n\n\nEngineered atmospheric carbon removal\n\n\n\n\n\n\nCarbonCapture’s DAC systems use solid sorbents that soak up atmospheric carbon dioxide when cooled and release it when heated. The carbon dioxide thus captured can then be permanently stored underground or used to make sustainable fuels, low-carbon concrete, carbon black, or other valuable industrial products.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy DAC credits?\n\n\n\n\n\n\n\nThe gold standard of carbon removal credits\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMeasurable\n\n\n\n\n\n\nThe exact amount of CO₂ our DAC systems capture is precisely metered and measured.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nVerifiable\n\n\n\n\n\n\nFor each carbon removal credit we deliver, we provide a complete third-party verification report.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPermanent\n\n\n\n\n\n\nThe CO₂ we capture is securely locked away for more than 1,000 years in deep saline aquifers via Class VI injection wells.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAdditional\n\n\n\n\n\n\nWithout your financial support, DAC carbon removal wouldn't otherwise occur. They’re 100% additional.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFAQs\n\n\n\n\n\n\n\nFrequently asked questions about our carbon removal credits\n\n\n\n\n\n\nGeneral questions\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhat is direct air capture and why do we need it?\n\nOpen\n\nDirect air capture (DAC) refers to technologies that remove carbon dioxide directly from the atmosphere. DAC helps combat climate change by offsetting emissions in order to achieve carbon neutrality or even net negative emissions.\nDAC is valuable because it deals with the main cause of global warming: the excess carbon dioxide in the atmosphere. To keep global warming to under 1.5°C by 2100, the IPCC reported in April 2022 that carbon removal technologies like DAC are necessary (along with emissions reductions) to achieve climate goals. \n\n\n\n\nHow does your technology work?\n\nOpen\n\nOur machines use solid sorbents to capture CO2 via a process called temperature-vacuum swing adsorption (TVSA). In the adsorption step, fans pull air through the system, and the sorbents collect CO2 until they are full. In the desorption step, they are heated to release the CO2. A vacuum pump removes the released CO2 for processing or storage. After this, the sorbents are cooled and are ready to collect CO2 again. \nTVSA is a long-standing method for industrial gas separation that we have adapted to efficiently remove carbon dioxide from the atmosphere.\n\n\n\n\nHow do you permanently sequester the carbon dioxide you capture from the atmosphere? \n\nOpen\n\nThe CO2 we capture is injected deep underground for sequestration via Class VI injection wells. \nWhen carbon dioxide is injected into Class VI wells, it is sent deep underground into suitable geological formations such as deep saline aquifers capped by hundreds of feet of impermeable rock that prevents CO2 from ever migrating to the surface. Storing carbon dioxide in Class VI wells is considered permanent because of the nature of the geological formations where the wells are located.\nThe EPA established its Class VI well classifications specifically for carbon sequestration; companies who seek a Class VI permit must meet stringent regulatory requirements to ensure the safety and effectiveness of long-term carbon dioxide storage.\n\n\n\n\nWhat are carbon removal credits?\n\nOpen\n\nA carbon removal credit represents the permanent removal of one metric ton of carbon dioxide from the atmosphere. Carbon removal credits are purchased by individuals and organizations that seek to offset their unavoidable or legacy emissions.\n\n\n\n\nHow do you generate carbon removal credits?\n\nOpen\n\nProject Bison, our Wyoming-based direct air capture facility, will use our modular DAC systems to filter carbon dioxide out of the atmosphere. The captured CO2 will then be permanently stored by sequestering it in deep saline aquifers via Class VI injection wells. One carbon credit generated for each ton of CO2 removed and sequestered. \n\n\n\n\nWhy can’t we just plant more trees?\n\nOpen\n\nPlanting and safeguarding trees plays a critical role in the battle against climate change. But relying solely on trees is no longer sufficient, there just isn’t enough land. Further, climate change has resulted in droughts and wildfires — disruptions that have significantly impacted the dependability and long-term durability of tree-based carbon removal. Consequently, we must pursue a two-pronged approach: intensify nature-based carbon removal initiatives like afforestation while also scaling innovative technologies like direct air capture.\n\n\n\n\nWhy remove carbon dioxide in Wyoming and not in more polluted areas?  \n\nOpen\n\nOn an annual average basis, carbon dioxide is well-mixed throughout the atmosphere, so there’s little variation from place to place. (According to NOAA’s Global Monitoring Lab, the average concentration of carbon dioxide in the atmosphere in 2022 was 417 parts per million.) This means that we can situate our DAC facilities to optimize for other requirements, such as availability of permanent storage, clean energy, inexpensive land, etc.\n\n\n\n\nShouldn’t we reduce industrial emissions first?\n\nOpen\n\nIn order to achieve international climate targets, we must do everything we can to reduce emissions immediately. Unfortunately, point source carbon capture and other means of reducing industrial emissions won’t get us to net zero on their own. To keep global warming to under 1.5°C by 2100, the IPCC stated in April 2022 that carbon removal technologies like DAC are necessary to address historical emissions as well as provide a high-quality option for offsetting unavoidable emissions. \n\n\n\n\nWhy buy DAC credits now?\n\nOpen\n\nYour support has a huge impact. Early purchases of nascent technologies like DAC carbon removal credits play a vital role in scaling up the technology by providing financial certainty that enables long-term planning and encourages rapid innovation and technology improvements. Early buyers are vital to bring down costs of DAC in the future so that the DAC industry can expand to meet our climate change goals.\n\n\n\n\nHow do I know you’re permanently removing carbon dioxide? Is there any third-party verification?\n\nOpen\n\nOur credits will be certified under an International Carbon Reduction and Offsetting Accreditation (ICROA) compliant standard. ICROA is a leading industry accreditation program committed to enhancing integrity in the voluntary carbon market in support of the IPCC 2015 Paris Agreement goals. ICROA certifies best practices in greenhouse gas emissions reduction and offsetting. A third-party auditor will certify that 1) the credits we deliver meet the ICROA standard, 2) that a credit has not been sold more than once, and 3) that our project has not had unexpected leakages.\n\n\n\n\nWhen will the carbon removal credits I purchase be delivered? \n\nOpen\n\nWe are currently taking advance commitments for credits that will be generated in 2026 and beyond (we’ve sold out earlier years).\n\n\n\n\nDo I get any documentation for the credits I purchase?\n\nOpen\n\nWhen your DAC carbon removal credits have been generated, we will provide you with a certificate as well as a report that documents the amount of net carbon dioxide captured and sequestered, a full accounting of any emissions created as a result of our processes, and a verification that no leakages have occurred.\n\n\n\n\nWhere is your company based?\n\nOpen\n\nWe're based in Los Angeles, California, where we’re building our team and developing our direct air capture technology. Our first large-scale carbon removal project is in Southwest Wyoming.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPurchasing our credits from Patch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWho is Patch?\n\nOpen\n\nPatch is an e-commerce software platform we’ve partnered with to make it fast and easy for individuals and small businesses to buy carbon removal credits (up to 100). For large companies and enterprises, contact us directly. \n\n\n\n\nHow do I purchase carbon removal credits via Patch?\n\nOpen\n\nClick here and you'll be redirected to the Patch website where you will be able to purchase our 2026 vintage credits.\n\n\n\n\nWhat does the purchase process look like?\n\nOpen\n\n\n\nDetermine the number of credits you would like to purchase (each credit is equal to one ton of CO2 removed from the atmosphere). \nSelect the dollar amount or choose thecustom amount that corresponds to the number of credits you would like to purchase \nChoose your frequency (one-time purchase or recurring each month or year) \nClick Continue to proceed to payment \n\n\n\n\n\nWhat are carbon removal credits?\n\nOpen\n\nA carbon removal credit represents the permanent removal of one metric ton of carbon dioxide from the atmosphere. Carbon removal credits are purchased by individuals and organizations that seek to offset their unavoidable or legacy emissions.\n\n\n\n\nAre there any fees?\n\nOpen\n\nPatch charges a 6% fee that covers payment processing costs, order placement, status tracking, and fulfillment.\n\n\n\n\nWhat methods of payment are acceptable?\n\nOpen\n\nPatch accepts all major credit cards or Google Pay.\n\n\n\n\nWill I receive a receipt or certificate?\n\nOpen\n\nUpon completion of your order, Patch will provide an order summary with a link to download your certificate. This certificate page is dynamic and will track your order status as it moves toward fulfillment.\nAfter your purchase, you will receive periodic updates from us to keep you up-to-date on any important announcements.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhat can we do for you?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    Contact us\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\nClients\n\n\n\n\n\n\n\n\n\nBuy DAC credits\n\n\n\n\n\n\n\n\nBuy DAC systems\n\n\n\n\n\n\n\n\n\n\nJoin us\n\n\n\n\n\n\n\n\n\nSee open positions\n\n\n\n\n\n\n\n\nCareers\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFollow us\n\n\n\n\n\n\nGet our newsletter\n\n\n\n\n\n\n\n\n\nPress inquiries\n\n\n\n\n\n\npress@carboncapture.com\n\n\n\n\n\n\n\n\n\n\n\n\nFollow us on LinkedIn\n\n\nFollow us on Instagram\n\n\nFollow us on Facebook\n\n\nFollow us on Facebook\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTerms of service\nPrivacy policy\n\n\n\n\n\n\n\n\n\n\n© 2024 CarbonCapture Inc.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGet the latest news from CarbonCapture\nSign up to receive the latest news and updates\n\n\n\n\n\n\n\n\n\n\n\nLet’s start the conversation\nLet us know more about your carbon removal credit needs, and someone from our team will get in touch with you very soon.\n\n\n\n\n\n\n\n\n\nWhat can we do for you?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.carboncapture.com/technology": "\n\nTechnology | Carbon Capture Inc.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    Buy credits\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n            Our technology\n        \n\n\n \n            Who we are\n        \n\n\n \n            Careers\n        \n\n\n \n            Newsroom\n        \n\n\n \n            Contact us\n        \n\n\n\n\n\n\n\n\n\nFollow us\nGet our newsletter\n\n\n\n\n\n\n\n\n\nFollow us on LinkedIn\n\n\nFollow us on Instagram\n\n\nFollow us on Facebook\n\n\nFollow us on Facebook\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWho we are. What we do. Why we do it.\nPlay video\n\n\n\n\n\n\n\n\n\n\n\nWhat we’re up to\n\n\n\n\n\n\nLeo Series\n\n\n\n\n\n\nThe first U.S. DAC system designed for mass production\n\n\n\n\n\n\nProject Bison\n\n\n\n\n\n\nOur multi-megaton carbon removal project in Wyoming leading in a new era of large-scale DAC projects in the U.S.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFollow us on LinkedIn\n\n\nFollow us on Instagram\n\n\nFollow us on Facebook\n\n\nFollow us on Facebook\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOur technology\n\n\n\n\n\n\n\nFrom lab to field, tested, proven, and deployed technologies\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nModular DAC\n\n\n\n\n\n\n\nLeo Series\n\n\n\n\n\n\n\nThe first U.S. DAC system designed for mass production\n\n\n\n\n\n\nThe Leo Series incorporates industry-leading, advanced structured sorbents that enable each module to capture over 500 tons of atmospheric carbon dioxide per year. Due to its open systems architecture, modules can be upgraded throughout their life with higher capacity sorbents as they are released, minimizing obsolescence risk and lowering operating costs over time.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPlay video\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOur capabilities\n\n\n\n\n\n\n\n\n\n\nWhat’s under our hood.\n\n\n\n\n\n\n\n\n\n\nWe’re building a team and the capabilities to deliver end-to-end DAC projects from materials science to large-scale project development.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMaterials science\n\n\n\n\n\n\n\n\n\nWe’ve built a fully-functional lab and team of materials scientists capable of lifetime and environmental testing as well as sorbent characterization and development.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrototyping\n\n\n\n\n\n\n\n\n\nOur fabrication and test teams, co-located with our HQ in Los Angeles, are able to rapidly prototype potential technology changes. This allows us to derisk before committing to manufacturing at any scale.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEngineering\n\n\n\n\n\n\nOur engineering team consists of multiple disciplines to bring projects to fruition: from systems to mechanical to structural to project engineering. Cross-disciplinary ways of working contribute to more robust designs and better projects.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nManufacturing\n\n\n\n\n\n\n\n\n\nOur manufacturing team in Mesa, Arizona, supplies DAC modules for both our carbon removal projects and third-party DAC initiatives worldwide. They also play a crucial role in our design-for-manufacturability team.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPartnerships\n\n\n\n\n\n\n\nLet’s face civilization’s greatest challenge together.\n\n\n\n\n\n\n\nRoughly 100 billion tons of CO₂ need to be removed from the atmosphere by 2100. Reaching that goal will require a massive effort by the global community. Below are the areas in which we’re actively seeking partners.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSorbents\n\n\n\n\n\n\nIf you are developing a sorbent that's well-suited for DAC, let us know. With an open systems architecture, we may be able to provide a rapid path to evaluation, manufacturing, and commercial deployment. Note that our DAC hardware platform is designed to accommodate a wide range of low-temperature solid sorbents.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nProject deployment\n\n\n\n\n\n\nWe’re currently seeking partners in the following areas: DAC deployment for atmospheric carbon removal, geological CO₂ storage, sustainable synthetic fuels, and low-carbon concrete. Contact us if you’re seeking a DAC partner to supply upgradeable commercial DAC systems that can start small and scale to megaton levels.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nProject financing\n\n\n\n\n\n\nOver the next decade, we will require a significant amount of capital as we deploy megatons of DAC capacity. We're seeking to develop relationships with forward-thinking project investors that share our mission to decarbonize the atmosphere.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhat can we do for you?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    Contact us\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\nClients\n\n\n\n\n\n\n\n\n\nBuy DAC credits\n\n\n\n\n\n\n\n\nBuy DAC systems\n\n\n\n\n\n\n\n\n\n\nJoin us\n\n\n\n\n\n\n\n\n\nSee open positions\n\n\n\n\n\n\n\n\nCareers\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFollow us\n\n\n\n\n\n\nGet our newsletter\n\n\n\n\n\n\n\n\n\nPress inquiries\n\n\n\n\n\n\npress@carboncapture.com\n\n\n\n\n\n\n\n\n\n\n\n\nFollow us on LinkedIn\n\n\nFollow us on Instagram\n\n\nFollow us on Facebook\n\n\nFollow us on Facebook\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTerms of service\nPrivacy policy\n\n\n\n\n\n\n\n\n\n\n© 2024 CarbonCapture Inc.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGet the latest news from CarbonCapture\nSign up to receive the latest news and updates\n\n\n\n\n\n\n\n\n\n\n\nLet’s start the conversation\nLet us know more about your carbon removal credit needs, and someone from our team will get in touch with you very soon.\n\n\n\n\n\n\n\n\n\nWhat can we do for you?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.carboncapture.com/who-we-are": "\n\nWho We Are | Carbon Capture Inc.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    Buy credits\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n            Our technology\n        \n\n\n \n            Who we are\n        \n\n\n \n            Careers\n        \n\n\n \n            Newsroom\n        \n\n\n \n            Contact us\n        \n\n\n\n\n\n\n\n\n\nFollow us\nGet our newsletter\n\n\n\n\n\n\n\n\n\nFollow us on LinkedIn\n\n\nFollow us on Instagram\n\n\nFollow us on Facebook\n\n\nFollow us on Facebook\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWho we are. What we do. Why we do it.\nPlay video\n\n\n\n\n\n\n\n\n\n\n\nWhat we’re up to\n\n\n\n\n\n\nLeo Series\n\n\n\n\n\n\nThe first U.S. DAC system designed for mass production\n\n\n\n\n\n\nProject Bison\n\n\n\n\n\n\nOur multi-megaton carbon removal project in Wyoming leading in a new era of large-scale DAC projects in the U.S.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFollow us on LinkedIn\n\n\nFollow us on Instagram\n\n\nFollow us on Facebook\n\n\nFollow us on Facebook\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWho we are\n\n\n\n\n\n\n\nWe are an experienced cross-functional team motivated to get the job done\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy we’re here\n\n\n\n\n\n\nOur mission is to fight climate change by harnessing science, technology, and human ingenuity to decarbonize the atmosphere.\n\n\n\n\n\n\n\n\n\n\n\n\n\nExecutive team\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBill Gross\nChairman & Co-founder\nBill is Co-founder and Chairman of CarbonCapture. He’s also Founder and Chairman of Idealab Studio, a leading technology incubator. Over the last 23 years, Idealab has created and operated more than 150 companies and had more than 45 successful IPOs and acquisitions in the areas of renewable energy, software, online advertising, Internet services, robotics, social media, and transportation. Prior to CarbonCapture, he founded a number of energy storage and solar companies, including Energy Vault, Heliogen, Energy Cache, eSolar, Duron Solar, Raytracker, Thermata, and others. Bill received his B.S. in Mechanical Eng\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAdrian Corless\nChief Executive Officer\nAdrian has spent over 25 years developing and commercializing products in the cleantech industry. From 2013 to 2018, he was the CEO of Carbon Engineering, where he successfully developed the company into a recognized global leader in CO₂ direct air capture, piloting industrial scale systems in under two years. In addition, Adrian has spent 15+ years commercializing industrial hydrogen, fuel cell, and pump technologies, serving as CEO of Rotoliptic Technologies, CTO of Plug Power, and CTO of Cellex Power Products. He holds a Master's of Science degree from the University of Victoria, BC Canada with specialization in Energy Systems, Cryogenics, and LNG.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSaeb Besarati\nChief Technology Officer\nSaeb Besarati holds a PhD degree in Chemical Engineering and a Master’s degree in Thermal Mechanical Engineering. He has more than 10 years of experience in developing technologies to address climate change. Saeb is a certified model-based system engineer and project manager (PMP). He’s also contributed to more than 20 papers and books in the field of renewable-based power generation.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDavid Apps\nVice President, Manufacturing\nDavid has a 25-year career in the automotive industry in advanced manufacturing engineering and manufacturing operations roles. He’s been part of four new factory builds and launched numerous new vehicles. In addition to spending 14 years in the traditional automotive space, he's worked with four EV start-up companies, including spending five years overseeing operations at Tesla’s Fremont factory and leading manufacturing line development at Nikola Motors. David holds a Bachelor of Applied Science in Mechanical Engineering and a Bachelor of Arts from the University of Toronto, Canada.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPatricia Loria\nVice President, Business Development\nMost recently, Patricia was Senior Client Engagement Lead at the Global CCS Institute, where she supported companies and governments looking to deploy carbon capture solutions and achieve net-zero goals. Based in Washington, DC, Patricia is a seasoned marketing and business development professional with more than 20 years of experience in financial services, insurance, and NGO sectors. She received an MBA from Darden Business School and a master’s degree in Natural Resources from Virginia Tech’s Center for Leadership in Global Sustainability.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRichard Weil\nVice President, Finance\nRichard is an experienced finance and operating professional, having served as CFO or in a similar capacity for start-up companies operating in industries as diverse as near field communications hardware and software, video game commerce, paid search advertising, and electricity transmission. He also co-founded Mount Wilson Ventures, a venture fund that invests in early-stage hard science companies. Richard graduated from Columbia University and is a CFA charterholder.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRobert Whyte\nVice President, Projects\nRobert is a professional engineer with 25 years of progressive technical and leadership experience in the energy industry, having served in senior roles managing and delivering large scale projects in North America, the Middle East and Europe. He has expertise in full life cycle asset planning and economics and has developed a risk-based process for project management. Robert has successfully led large and diverse operations and maintenance organizations. He received his B.Sc. in Mechanical Engineering from the University of Victoria.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMeghan Kenny\nSenior Director, Strategy & Projects\nMeghan has a background in chemical engineering and consulting. With Johnson Matthey, she worked across several different facilities and helped JM stand up their refining operations in China. Before CarbonCapture, she was a manager with Bain & Company, focusing on projects in energy and heavy industry. Meghan has a BS in Chemical Engineering from MIT and an MBA from Harvard Business School.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“We’re dedicated to addressing climate change head on by decarbonizing the atmosphere as quickly as possible.”\nAdrian CorlessCEO\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOur origin story\n\n\n\n\n\n\n\nIncubated at IdeaLab\n\n\n\n\n\n\nCarbonCapture is the brainchild of founder Bill Gross, a technology entrepreneur and founder of Idealab, a start-up incubator with a long track-record of creating groundbreaking companies.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOur values\n\n\n\n\n\n\n\nOur values\n\n\n\n\n\n\nWe’re mission-driven, but guided by five principles.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe mission\nWe’re here to preserve the environment for future generations by leveraging science, technology, and human innovation to decarbonize the atmosphere. That shared mission is both a privilege and a responsibility that brings us together, shows us where we’re going, inspires our work, guides our decision making, and steadies us when the going gets rough.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBetter together\nWe come together to fight climate change as a unified, extraordinary team. Because the effectiveness of the team is a priority, we believe in fostering a culture of togetherness by trusting in the good intent of our coworkers, going above and beyond to help each other out, and celebrating our wins. Further, we seek to maximize the opportunities for the kinds of shared experiences that lead to lasting personal bonds, with a focus on face-to-face interactions.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCaring for eachother\nThe well-being of each one of our team members is deeply important to us. As a core foundation, we provide a psychologically, physically, and intellectually safe workspace. Further, we believe in supporting the professional and personal growth of our associates by providing ongoing training, career development opportunities, leadership coaching, and the flexibility needed for each team member to optimize their work/life balance.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOpen and honest\nBecause we respect and trust each other, we’re direct in our interpersonal communications. This means being honest with each other, whether it’s freely expressing our appreciation for a job well done or providing constructive feedback. It also means fostering the transparent flow of information across all levels and functions whenever possible.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExploration\nWhile our destination is clear, the exact path is not. Our mission calls for explorers: those who are insatiably curious, thirsty for knowledge, open to new ideas, and willing to challenge the status quo. Further, we believe in fostering the explorer’s spirit in each other by sharing what we know, viewing mistakes as opportunities for growth, accepting different perspectives, and encouraging our colleagues as we fearlessly venture across uncertain territory.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCareers\n\n\n\n\n\n\n\nJoin us on our mission to decarbonize the atmosphere.\n\n\n\n\n\n\nWe’re looking for good people to join our highly motivated and incredibly talented team. If you’re interested, let us know!\n\n\n\n\n\n\n\n\n\n    Learn more\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhat can we do for you?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    Contact us\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\nClients\n\n\n\n\n\n\n\n\n\nBuy DAC credits\n\n\n\n\n\n\n\n\nBuy DAC systems\n\n\n\n\n\n\n\n\n\n\nJoin us\n\n\n\n\n\n\n\n\n\nSee open positions\n\n\n\n\n\n\n\n\nCareers\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFollow us\n\n\n\n\n\n\nGet our newsletter\n\n\n\n\n\n\n\n\n\nPress inquiries\n\n\n\n\n\n\npress@carboncapture.com\n\n\n\n\n\n\n\n\n\n\n\n\nFollow us on LinkedIn\n\n\nFollow us on Instagram\n\n\nFollow us on Facebook\n\n\nFollow us on Facebook\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTerms of service\nPrivacy policy\n\n\n\n\n\n\n\n\n\n\n© 2024 CarbonCapture Inc.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGet the latest news from CarbonCapture\nSign up to receive the latest news and updates\n\n\n\n\n\n\n\n\n\n\n\nLet’s start the conversation\nLet us know more about your carbon removal credit needs, and someone from our team will get in touch with you very soon.\n\n\n\n\n\n\n\n\n\nWhat can we do for you?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.carboncapture.com/careers": "\n\nCareers | Carbon Capture Inc.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    Buy credits\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n            Our technology\n        \n\n\n \n            Who we are\n        \n\n\n \n            Careers\n        \n\n\n \n            Newsroom\n        \n\n\n \n            Contact us\n        \n\n\n\n\n\n\n\n\n\nFollow us\nGet our newsletter\n\n\n\n\n\n\n\n\n\nFollow us on LinkedIn\n\n\nFollow us on Instagram\n\n\nFollow us on Facebook\n\n\nFollow us on Facebook\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWho we are. What we do. Why we do it.\nPlay video\n\n\n\n\n\n\n\n\n\n\n\nWhat we’re up to\n\n\n\n\n\n\nLeo Series\n\n\n\n\n\n\nThe first U.S. DAC system designed for mass production\n\n\n\n\n\n\nProject Bison\n\n\n\n\n\n\nOur multi-megaton carbon removal project in Wyoming leading in a new era of large-scale DAC projects in the U.S.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFollow us on LinkedIn\n\n\nFollow us on Instagram\n\n\nFollow us on Facebook\n\n\nFollow us on Facebook\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCareers\n\n\n\n\n\n\n\nJoin us in our mission to decarbonize the atmosphere\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOur team\n\n\n\n\n\n\n\nWe’re a diverse group with a singular cause.\n\n\n\n\n\n\n\nInterested in joining us? Checkout the positions that are currently open:\n\n\n\n\n\n\n\n\n  See open positions\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOur mission:\n\n\n\n\n\n\nOur mission is to fight climate change by harnessing science, technology, and human ingenuity to decarbonize the atmosphere.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMeet the team\n\n\n\n\n\n\n\nThe best in the business\n\n\n\n\n\n\n\n\n\nHow have we come so far so fast? Our secret is our incredibly hardworking and talented group of people and their dedication to the mission, and to one another.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSee more of our people on social media:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInstagram\n\nChris\n\n\n\n\n\n\nLinkedIn\n\nOmid\n\n\n\n\n\n\nInstagram\n\nRuth\n\n\n\n\n\n\nLinkedIn\n\nSurya\n\n\n\n\n\n\nInstagram\n\nNoah\n\n\n\n\n\n\nInstagram\n\nMadi\n\n\n\n\n\n\nInstagram\n\nMatt\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInternships\n\n\n\n\n\n\n\nThe next generation\n\n\n\n\n\n\nWe offer internship positions in different areas throughout the company. We’re looking for interns with specific technical skills, such as software engineering, materials science, and prototyping. If you are interested in building experience in climate tech, please send us your resume. We’ll get back to you if there’s a fit.\n\n\n\n\n\n\n\n\n\n    Contact us\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNew to DAC?\n\n\n\n\n\n\n\nWant a crash course on DAC? Maybe Meghan can help... maybe.\n\n\n\n\n\n\nOur Senior Director of Strategy & Projects Meghan Kenny answers some of the Internet’s most asked DAC questions.\n\n\n\n\n\n\n\n\n\n    Watch on Instagram\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOur open positions\n\n\n\n\n\n\n\nWant to join us?\n\n\n\n\n\n\n\n\n\n    See open positions\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhat can we do for you?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    Contact us\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\nClients\n\n\n\n\n\n\n\n\n\nBuy DAC credits\n\n\n\n\n\n\n\n\nBuy DAC systems\n\n\n\n\n\n\n\n\n\n\nJoin us\n\n\n\n\n\n\n\n\n\nSee open positions\n\n\n\n\n\n\n\n\nCareers\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFollow us\n\n\n\n\n\n\nGet our newsletter\n\n\n\n\n\n\n\n\n\nPress inquiries\n\n\n\n\n\n\npress@carboncapture.com\n\n\n\n\n\n\n\n\n\n\n\n\nFollow us on LinkedIn\n\n\nFollow us on Instagram\n\n\nFollow us on Facebook\n\n\nFollow us on Facebook\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTerms of service\nPrivacy policy\n\n\n\n\n\n\n\n\n\n\n© 2024 CarbonCapture Inc.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGet the latest news from CarbonCapture\nSign up to receive the latest news and updates\n\n\n\n\n\n\n\n\n\n\n\nLet’s start the conversation\nLet us know more about your carbon removal credit needs, and someone from our team will get in touch with you very soon.\n\n\n\n\n\n\n\n\n\nWhat can we do for you?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}]}