{"text": [{"https://www.carbonpool.earth/": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome | CarbonPool\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        You are using an outdated browser. Please upgrade your browser to improve your experience\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                Why Carbon Insurance?            \n\n\n\n                What Do We Insure Against?            \n\n\n\n                Our Clients            \n\n\n\n                Our Team            \n\n\n\n                Knowledge            \n\n\n\nGet in touch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy Carbon Insurance?\n\n\n\n\nWhat Do We Insure Against?\n\n\n\n\nOur Clients\n\n\n\n\nOur Team\n\n\n\n\nKnowledge\n\n\n\n\n\n\nGet in touch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nInnovative carbon credit insurance which pays claims in carbon credits, not cash\n\n\n                            See how we can help you\n\n\n\n\n\n\n\n                See how we can help you\n\n\n\n\n\n\n \n\n\n\n\n\n    Our Mission\n\n    We accelerate the net zero transition by providing in-kind insurance for unexpected carbon credit shortfalls or reversals\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    Our insurance gives any buyer, developer or investor in carbon removals the confidence needed to invest at scale\n\n\n\n\n\nOur Clients\nOur clients are developers, corporate buyers and investors who are investing in carbon credits and who need certainty that those credits will be delivered and that the carbon stays sequestered.\n\n\n\nOur Insurance\nOur insurance compensates our clients with high quality carbon credits for unexpected carbon credit shortfalls and reversal events caused by natural catastrophes, weather effects and machine breakdown.\n\n\n\nOur Expert Team\nOur expert team of insurance leaders, climate scientists, and experienced risk modelers and underwriters creates bespoke risk models to help our clients understand the risks of their investments, and delivers products to mitigate against them.\n\n\n\n\n\n\n\n\n\n\n\n\n\n    Our Products\n\n\n\n\n \n\n\n\n\nCarbon Shortfall Insurance\nCompensate for unexpected carbon credit shortfalls caused by lower-than-expected yields over time, natural disasters, fires, disease, windstorms or other accidents\n\n\n\n\n\n\n \n\n\n\n\nCarbon Reversal Insurance\nEnsure the long-term integrity of your emissions reduction efforts by immediately replacing sequestered carbon lost due to reversal events that allow sequestered carbon to leak back into the atmosphere\n\n\n\n\n\n\n \n\n\n\n\nUnintended Emissions Insurance\nProtect against unintended emissions caused by temporary disruptions in carbon capture technologies, breakdowns in machinery or accidental surplus emissions\n\n\n\n\n\n\n\n\n\n\n\n    Our Expert Team\n\n\nCarbonPool brings together seasoned experts with a wealth of experience in insurance, financial solutions and climate science.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n                                        Coenraad Vrolijk                                    \n\n                                            CEO / Co-Founder                                        \n\n\n\n\n\n\n \n\n\n                                        Nandini Wilcke                                    \n\n                                            COO / Co-Founder                                        \n\n\n\n\n\n\n \n\n\n                                        Frederic Olbert                                    \n\n                                            CFO / Co-Founder                                        \n\n\n\n\n\n\n \n\n\n                                        Beat Krauer                                    \n\n                                            Chief Underwriting Officer                                        \n\n\n\n\n\n\n \n\n\n                                        Mathilda Ström                                    \n\n                                            Chief Commercial Officer                                        \n\n\n\n\n\n\n \n\n\n                                        Claudio Braidotti                                    \n\n                                            Chief Investment Officer                                        \n\n\n\n\n\n\n \n\n\n                                        Pedro Fonseca                                    \n\n                                            Principal Capital Modeller                                        \n\n\n\n\n\n\n \n\n\n                                        Kasia Tokarska de los Santos                                    \n\n                                            Principal Climate Modeller                                        \n\n\n\n\n\n\n \n\n\n                                        Oleksandr Kit                                    \n\n                                            Principal Climate Modeller                                        \n\n\n\n\n\n\n \n\n\n                                        Emmanuel Sanchez                                    \n\n                                            Principal Weather Modeller                                        \n\n\n\n\n\n\n \n\n\n                                        Maximilian Kremer                                    \n\n                                            Head of Strategic Projects                                        \n\n\n\n\n\n\n \n\n\n                                        Ewoud Vandewal                                    \n\n                                            Investment Associate                                        \n\n\n\n\n\n\n \n\n\n                                        Nikolaus Plochmann                                    \n\n                                            Forestry Expert                                        \n\n\n\n\n\n\n \n\n\n                                        Brooke Davies                                    \n\n                                            Legal, Markets, and Operations Officer                                        \n\n\n\n\n\n\n\n\n\n                                    Coenraad Vrolijk                                \n\n                                        CEO / Co-Founder                                    \n\nCoenraad Vrolijk (CEO, founder) spent seven years as regional CEO of Allianz Africa, from 2015 to 2022, following a stint at BlackRock and as partner at McKinsey. He has served on multiple advisory boards for companies and other institutions and holds a PhD in economics from Brown.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Nandini Wilcke                                \n\n                                        COO / Co-Founder                                    \n\nNandini Wilcke (COO, founder) worked for thirteen years in various roles at Allianz in Germany and in Africa, including as special assistant to the group CEO and general counsel and regional head of M&A for Allianz Africa. She earned her undergraduate and law degrees at Columbia and spent the first years of her career practicing commercial real estate law.\nNan is leading client acquisition and strategic cooperation discussions.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Frederic Olbert                                \n\n                                        CFO / Co-Founder                                    \n\nFrederic Olbert (CFO, founder) was previously CFO and head of capital markets at investment management start-up LINUS Digital Finance, following work in investment banking for Goldman Sachs and at Allianz, where he set up a life insurance startup in Ghana and worked on strategy and M&A topics. His MBA is from INSEAD.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Beat Krauer                                \n\n                                        Chief Underwriting Officer                                    \n\nBeat Krauer (CUO) has spent 20 years in various roles in the re-/insurance market. After completing his degree as a forestry engineer at ETH Zürich and an assignment in the forestry sector, he joined Partner Re’s catastrophe research team and moved on to agriculture underwriting at Allianz Re before being appointed as the global head of agriculture reinsurance to build up a global team and portfolio at AXA XL.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Mathilda Ström                                \n\n                                        Chief Commercial Officer                                    \n\nMathilda Ström (CCO) was the co-founder and deputy CEO of BIMA, the leading microinsurance and digital health player in emerging markets. Prior to that she was a strategy consultant within telecoms, media, and technology at Spectrum Value Partners. She has also served as a director on multiple boards, including for a renewable energy company in Africa.\nMathilda is leading the commercial strategy.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Claudio Braidotti                                \n\n                                        Chief Investment Officer                                    \n\nClaudio Braidotti (CIO) began his career at McKinsey & Company in 2000, focusing on the insurance industry.  In 2013 he moved to Allianz as partner in the internal consulting unit, then served in Allianz SE as board member for the Italian subsidiary, Allianz SpA.  In 2017, he moved to Africa as head of regional strategy and business development, and in 2021 Claudio became CFO for Allianz Morocco and board member for Jubilee Allianz Kenya and Jubilee Allianz Mauritius.\nClaudio leads CarbonPool’s carbon investment portfolio.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Pedro Fonseca                                \n\n                                        Principal Capital Modeller                                    \n\nPedro Fonseca (Principal Capital Modeller) holds a PhD degree in theoretical physics from Rutgers University and has over 20 years of experience in the financial industry, where he has been responsible for areas such as risk management, capital requirement, regulatory reporting, and data modelling.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Kasia Tokarska de los Santos                                \n\n                                        Principal Climate Modeller                                    \n\nKasia Tokarska de los Santos (Principal Climate Modeller) holds a PhD in climate modelling, with post-doctoral experience at ETH Zürich and the University of Edinburgh, focused on carbon budgets. She joins CarbonPool following positions at a risk consultancy and McKinsey.\nKasia leads CarbonPool’s carbon removal project risk assessments.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Oleksandr Kit                                \n\n                                        Principal Climate Modeller                                    \n\nOleksandr Kit (Principal Climate Modeller) has been working in the climate and geospatial analytics field for the last 15 years, including as a consultant at the World Bank and as a researcher at the Potsdam Institute for Climate Impact Research, primarily focusing on developing analytical tools for assessing CO₂ emissions and climate risks. Oles received a PhD in Geography from Humboldt University Berlin.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Emmanuel Sanchez                                \n\n                                        Principal Weather Modeller                                    \n\nEmmanuel Sanchez (Principal Weather Modeller) has more than 15 years’ experience modelling risk and pricing insurance products, for firms including UBS and Allianz, where he was a senior deal modeller for parametric weather transactions.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Maximilian Kremer                                \n\n                                        Head of Strategic Projects                                    \n\nMaximilian Kremer (Head of Strategic Projects) is a former Engagement Manager at McKinsey & Company where he spent 6 years consulting financial institutions on questions concerning strategy, technology, and operations. Maximilian holds a doctoral degree in financial economics from TU Munich, where he researched and taught classes on growth financing and alternative investments. He also holds an M.Sc. in Financial Economics from the University of Oxford.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Ewoud Vandewal                                \n\n                                        Investment Associate                                    \n\nEwoud Vandewal (Investment Associate) holds master’s degrees in chemical engineering from the Catholic University of Leuven and management from INSEAD. His bachelor’s degree is in engineering. Ewoud picked up consulting experience at Emerald Consulting.\nEwoud is shaping and executing the carbon credit investment strategy.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Nikolaus Plochmann                                \n\n                                        Forestry Expert                                    \n\nNikolaus Plochmann (Forestry Expert) holds a M.Sc. in “Forest and Wood Science” from Yale University and the Technical University of Munich, where he focused on sustainable forest management, logistics, and green finance. His B.Sc. is in “Forest Science and Resource Management” from the Technical University of Munich. His prior experiences include working for Europe’s largest forest owner, SCA, the Bavarian State Forestry, and the management consultancy Oliver Wyman. Nikolaus also served in an elite unit of the German Armed Forces.\nNikolaus is shaping CarbonPool’s carbon credit investment strategy and nature-based insurance products.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Brooke Davies                                \n\n                                        Legal, Markets, and Operations Officer                                    \n\nBrooke Davies brings multiple years of experience in climate law and policy from Akin, a full-service global law firm, where she advised leading corporate and sovereign clients shaping the carbon market. Brooke also has extensive experience in strategic communications from her time at West Wing Writers, a messaging and strategy firm of former presidential speechwriters writing for Fortune 500 CEOs, heads of state, and major foundation presidents. Brooke received her law degree from Harvard Law School.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    Latest Knowledge\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n                        Insights                    \n\n\n\n16th Jul 2024\n\n\n\nBuffer pools: Why the carbon market needs a new approach to permanence and how insurance can help\n\n            Read article\n            \n\n\n\n\n\n \n\n\n\n\n\n                        News                    \n\n\n\n24th May 2024\n\n\n\nCarbonPool's comments on the U.S. Department of Energy's CDR Purchasing Challenge\n\n            Read article\n            \n\n\n\n\n\n \n\n\n\n\n\n                        Knowledge                    \n\n\n\n29th Apr 2024\n\n\n\nPolicymakers and registries propose insurance for carbon credit permanence\n\n            Read article\n            \n\n\n\n\n\n \n\n\n\n\n\n                        News                    \n\n\n\n29th Jan 2024\n\n\n\nCarbonPool closes $12m to underwrite the carbon credit markets\nCarbonPool closes the largest European climate finance seed round in 2023\n\n            Read article\n            \n\n\n\n\n\n \n\n\n\n\n\n                        Knowledge                    \n\n\n\n26th Dec 2023\n\n\n\nThe carbon markets: explained\nLooking to cut through the noise and understand the basics of the carbon credit markets? Learn about how the market works and what it will take to get us to net zero.\n\n            Read article\n            \n\n\n\n\n\n \n\n\n\n\n\n                        Knowledge                    \n\n\n\n20th Jan 2024\n\n\n\nRegulatory & industry trends in the carbon credit market\nLearn more about the regulatory and stakeholder trends driving the carbon markets into 2030 and beyond\n\n            Read article\n            \n\n\n \n\n\n\n\n\n\n\n\nConnect with us\n\n\n\n\n\n\n+41 44 383 03 03\n\n\n\ninfo@carbonpool.earth\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n\n                                    CarbonPool \n                                    Dufourstrasse 185a\n                                    8008 Zürich\n                                    Switzerland                                \n\n\n\n\n\n\n                        Whether you want to know what are your risks as a developer or a buyer, or how much our insurance will cost you, we can help.                     \n\n\n\nGet in touch\n\n\n\n\n\n\n\n\n\n\n© 2024 CarbonPool\n\n\nPrivacy Policy\n\n\n\n\nCookie Policy\n\n\n\n\nTerms of Use\n\n\n\n\n\n\nWebsite by SOZO\n\n\n\n\n\n\n\n\n\nBy clicking accept you are agreeing to the use of all cookies which will allow us to provide you with the most relevant experience when visiting or re-visiting this website. This means that your personal preferences will be remembered when you use this website. However, you may manage your Cookie Settings to provide a controlled consent. Cookie settingsACCEPTManage consent\n\n\n\n\nClose\n\n\n\n\n\n\nPrivacy Overview \nThis website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience.\n\n \n\n\n\n\n\n                                Necessary                            \n\n\n Necessary \n\n\n                                    Always Enabled                                \n\n\n\nNecessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously.\nCookieDurationDescriptioncookielawinfo-checbox-analytics11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checbox-functional11 monthsThe cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\".cookielawinfo-checbox-others11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other.cookielawinfo-checkbox-advertisement1 yearSet by the GDPR Cookie Consent plugin, this cookie records the user consent for the cookies in the \"Advertisement\" category.cookielawinfo-checkbox-necessary11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".cookielawinfo-checkbox-performance11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\".CookieLawInfoConsent1 yearCookieYes sets this cookie to record the default button state of the corresponding category and the status of CCPA. It works only in coordination with the primary cookie.viewed_cookie_policy11 monthsThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data.\n\n\n\n\n\n\n                                Functional                            \n\n\nfunctional\n\n\n\n\nFunctional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features.\n\n\n\n\n\n\n\n                                Performance                            \n\n\nperformance\n\n\n\n\nPerformance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors.\n\n\n\n\n\n\n\n                                Analytics                            \n\n\nanalytics\n\n\n\n\nAnalytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc.\n\n\n\n\n\n\n\n                                Advertisement                            \n\n\nadvertisement\n\n\n\n\nAdvertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads.\n\n\n\n\n\n\n\n                                Others                            \n\n\nothers\n\n\n\n\nOther uncategorized cookies are those that are being analyzed and have not been classified into a category as yet.\n\n\n\n\n\n\n\n\n\n\n\n\n\nSave & Accept\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.carbonpool.earth/why-carbon-insurance/": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy Carbon Insurance? | CarbonPool\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        You are using an outdated browser. Please upgrade your browser to improve your experience\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                Why Carbon Insurance?            \n\n\n\n                What Do We Insure Against?            \n\n\n\n                Our Clients            \n\n\n\n                Our Team            \n\n\n\n                Knowledge            \n\n\n\nGet in touch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy Carbon Insurance?\n\n\n\n\nWhat Do We Insure Against?\n\n\n\n\nOur Clients\n\n\n\n\nOur Team\n\n\n\n\nKnowledge\n\n\n\n\n\n\nGet in touch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n    Our purpose\n\n    Why Carbon Insurance?\n\n\n\n\n\n\n\n\n                            Carbon credits need to be secured and insured in order for the world to reach net zero                        \n\nIn 2030, almost half of the world’s top 2,000 companies are aiming to hit net zero. By 2050, the world is targeting to reach this goal as a whole thanks to the Paris Agreement.\nDespite best efforts, emissions will never fall to zero – there are too many processes on which the world relies (e.g. food, steel and cement production) to feed and house its people – that cannot reduce emissions to zero with current technologies. There will always be a need for carbon dioxide removals in order to offset the emissions that are made.\nThe carbon market is set to quadruple by 2050, reaching $1-2 trillion. And massive investments in projects to remove or avoid carbon dioxide are needed to ensure the generation of enough removals to get to net zero. However, given the uncertainty and risks involved in investing in projects that remove carbon dioxide from the atmosphere or avoid further emissions, many buyers are hesitant to invest in carbon credits up front or at all. The key mechanism that regulates all other mature markets against risky investments has been missing from the carbon credit market, namely: insurance. Insurance can help to stabilize the carbon credit markets by encouraging investment, aiding in risk selection, and protecting carbon outcomes.\n\n\n                            Learn more about the carbon markets                            \n\n\n\n\n\"The deployment of carbon dioxide removal (CDR) to counterbalance hard-to-abate residual emissions is unavoidable if net zero CO₂ or GHG emissions are to be achieved\" \nIPCC AR6 WGIII report ‘Mitigation of Climate Change 2022’\n\n\n\n\n\n\n\n\n \n\n\n                    Nature-based risks alone could amount to a shortfall or reversal of 2-30% of carbon credits per year                 \n\n\n\n\n\n\n\n\n\n                            There are material risks associated with the delivery and permanence of carbon credits                        \n\nToday, if a company commits to net zero and buys the carbon removal credits necessary to achieve this goal, it has little recourse should those removals fail to materialize or if the sequestered carbon is unintentionally re-released into the atmosphere – whether because a stand of newly planted pines didn’t grow as expected, a promising technology broke down, or a fire wiped out a mangrove forest. That risk is clearly real, as demonstrated by extreme temperatures and increased wildfire activity around the world.\n\n\n                            Learn more about the permanence of carbon credits                            \n\n\n\n\n                            Shortfall or reversal of carbon credits can happen due to:                        \n\n\nIncorrect carbon sequestration approaches\n\nIncorrect carbon modelling assumptions\nUnrealistic planting schedule or use of inccorrect baselines\n\n\n\nNatural hazards and climate impacts\n\nFire\nHeatwaves & cold spells\nFlood\nDrought\nDisease & pest\nWind\n\n\n\nTechnology or machinery breakdowns\n\nTechnology outage\nMachinery breakdown\n\n\n\nHuman-induced risks\n\nPolitical risk\nHuman activity (e.g. logging)\n\n\n\n\n\n\n\n\n\n\n\n\n                    Mounting pressure from regulators and stakeholders                \n\nRegulatory authorities, including the European Union, the State of California, and the US Securities and Exchange Commission, are beginning to mandate detailed emissions and carbon reporting to show progress towards the Paris 2050 goals for small and large, publicly traded and private companies alike.\nThe failure arising out of a number of high profile projects due to unexpected losses (e.g. the carbon credits from the avoided deforestation Kariba project in Zimbabwe which turned out to be a fraud, the wildfires which decimated the State of California's own buffers) is causing a public outcry and lack of confidence in the carbon market. \nGreenwashing charges have also taken the form of lawsuits against companies, municipalities, pension funds, and investors.\nA 2022 study looking at consumer panel data found that consumer-facing companies hit by ESG scandals see sales drop by an average of 5-10% for at least six months afterward; the bigger the scandal, the greater the hit to sales.\n\n\n                                Learn more about the regulatory and industry trends                                \n\n\n\n\n\n\n\n\n\n\n\n\n                            Buffer mechanisms: not fit for purpose                        \nMost carbon credit registries (including Verra, the Woodland Carbon Code, Gold Standard, and others) require project developers to allocate to their buffer pools a percentage of all credits issued in order to protect against reversal risk.\n\n                            Learn more about buffer pools                            \n\n\n\n\n                            Drawbacks to buffer pools:                        \n\nThe pool allocation is not determined quantitatively\nThey do not adequately account for differing risk profiles (often having high dependency risk on a small number of projects)\nThe buffer pools are an unregulated insurance mechanism without the regulatory capital to account for catastrophic events\n\n\n\n\n\n\n\n\n\n\n                    The missing backstop behind carbon credits: in-kind carbon credit insurance                \n\nInsurance is a well-understood and time-tested mechanism for protecting market players and the wider community from unexpected outcomes\nWhen your car breaks down, you need a tow truck, not a check. In the same way, when your carbon balance sheet comes up short, you need replacement in high-quality credits quickly, and in the required quantities, not cash\nCompanies with insurance in place can reassure stakeholders that they are doing whatever they possibly can to secure their efforts to slow global warming\nAt the same time, it protects a company’s financial bottom line from reputational, regulatory, and direct financial implications of not hitting net zero targets\nInsurance also helps build confidence in investments. This means that high quality carbon removal projects can get much needed funding upfront because there is certainty of outcomes thanks to the insurance covering for any shortfalls or reversals\nCarbonPool replaces lost credits with the same or better quality credits, since we source the credits for our balance sheet only from projects that are additional, measurable, verifiable, and permanent\nCarbonPool’s mission is to accelerate the transition to net zero by providing buyers of carbon credits the confidence to invest their capital in carbon credits because they have an insurance that ensures they meet their carbon goals \n\n\n                                Learn more about the benefits of in-kind insurance                                \n\n\n\n\n\n\n\n\n\n\n\n\n    Latest Knowledge\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n                        Insights                    \n\n\n\n16th Jul 2024\n\n\n\nBuffer pools: Why the carbon market needs a new approach to permanence and how insurance can help\n\n            Read article\n            \n\n\n\n\n\n \n\n\n\n\n\n                        News                    \n\n\n\n24th May 2024\n\n\n\nCarbonPool's comments on the U.S. Department of Energy's CDR Purchasing Challenge\n\n            Read article\n            \n\n\n\n\n\n \n\n\n\n\n\n                        Knowledge                    \n\n\n\n29th Apr 2024\n\n\n\nPolicymakers and registries propose insurance for carbon credit permanence\n\n            Read article\n            \n\n\n\n\n\n \n\n\n\n\n\n                        News                    \n\n\n\n29th Jan 2024\n\n\n\nCarbonPool closes $12m to underwrite the carbon credit markets\nCarbonPool closes the largest European climate finance seed round in 2023\n\n            Read article\n            \n\n\n\n\n\n \n\n\n\n\n\n                        Knowledge                    \n\n\n\n26th Dec 2023\n\n\n\nThe carbon markets: explained\nLooking to cut through the noise and understand the basics of the carbon credit markets? Learn about how the market works and what it will take to get us to net zero.\n\n            Read article\n            \n\n\n\n\n\n \n\n\n\n\n\n                        Knowledge                    \n\n\n\n20th Jan 2024\n\n\n\nRegulatory & industry trends in the carbon credit market\nLearn more about the regulatory and stakeholder trends driving the carbon markets into 2030 and beyond\n\n            Read article\n            \n\n\n \n\n\n\n\n\n\n\n\nConnect with us\n\n\n\n\n\n\n+41 44 383 03 03\n\n\n\ninfo@carbonpool.earth\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n\n                                    CarbonPool \n                                    Dufourstrasse 185a\n                                    8008 Zürich\n                                    Switzerland                                \n\n\n\n\n\n\n                        Whether you want to know what are your risks as a developer or a buyer, or how much our insurance will cost you, we can help.                     \n\n\n\nGet in touch\n\n\n\n\n\n\n\n\n\n\n© 2024 CarbonPool\n\n\nPrivacy Policy\n\n\n\n\nCookie Policy\n\n\n\n\nTerms of Use\n\n\n\n\n\n\nWebsite by SOZO\n\n\n\n\n\n\n\n\n\nBy clicking accept you are agreeing to the use of all cookies which will allow us to provide you with the most relevant experience when visiting or re-visiting this website. This means that your personal preferences will be remembered when you use this website. However, you may manage your Cookie Settings to provide a controlled consent. Cookie settingsACCEPTManage consent\n\n\n\n\nClose\n\n\n\n\n\n\nPrivacy Overview \nThis website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience.\n\n \n\n\n\n\n\n                                Necessary                            \n\n\n Necessary \n\n\n                                    Always Enabled                                \n\n\n\nNecessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously.\nCookieDurationDescriptioncookielawinfo-checbox-analytics11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checbox-functional11 monthsThe cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\".cookielawinfo-checbox-others11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other.cookielawinfo-checkbox-advertisement1 yearSet by the GDPR Cookie Consent plugin, this cookie records the user consent for the cookies in the \"Advertisement\" category.cookielawinfo-checkbox-necessary11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".cookielawinfo-checkbox-performance11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\".CookieLawInfoConsent1 yearCookieYes sets this cookie to record the default button state of the corresponding category and the status of CCPA. It works only in coordination with the primary cookie.viewed_cookie_policy11 monthsThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data.\n\n\n\n\n\n\n                                Functional                            \n\n\nfunctional\n\n\n\n\nFunctional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features.\n\n\n\n\n\n\n\n                                Performance                            \n\n\nperformance\n\n\n\n\nPerformance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors.\n\n\n\n\n\n\n\n                                Analytics                            \n\n\nanalytics\n\n\n\n\nAnalytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc.\n\n\n\n\n\n\n\n                                Advertisement                            \n\n\nadvertisement\n\n\n\n\nAdvertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads.\n\n\n\n\n\n\n\n                                Others                            \n\n\nothers\n\n\n\n\nOther uncategorized cookies are those that are being analyzed and have not been classified into a category as yet.\n\n\n\n\n\n\n\n\n\n\n\n\n\nSave & Accept\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.carbonpool.earth/what-do-we-insure-against/": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhat Do We Insure Against? | CarbonPool\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        You are using an outdated browser. Please upgrade your browser to improve your experience\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                Why Carbon Insurance?            \n\n\n\n                What Do We Insure Against?            \n\n\n\n                Our Clients            \n\n\n\n                Our Team            \n\n\n\n                Knowledge            \n\n\n\nGet in touch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy Carbon Insurance?\n\n\n\n\nWhat Do We Insure Against?\n\n\n\n\nOur Clients\n\n\n\n\nOur Team\n\n\n\n\nKnowledge\n\n\n\n\n\n\nGet in touch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n    our products\n\n    What do we insure against?\n\n\n\n\n\nOur insurance compensates our clients with high-quality carbon credits for unexpected carbon credit shortfalls and reversal events caused by natural catastrophes, weather effects and machine breakdown\n\n\n\n\n\n\n\n\n\n                            Customized risk assessment                        \nCarbonPool's risk-first expert team uses advanced environmental and weather modelling and actuarial methods to create tailor-made risk models that allow us to back each and every project with sufficient risk capital to cover unforeseen losses or accidental emissions. Whether you are a buyer, developer or aggregator of carbon credits, get in touch with our team to start an evaluation of your projects and investments.\n\n\n\n                            Claims paid in carbon credits                        \nCarbonPool has a portfolio of high-quality credits on its balance sheet. This gives you comfort that any shortfall can be rectified with the same or similar quality credit. It also means that we are investing our own capital in a diversified range of high-quality projects and have the in-house expertise to understand what good quality looks like.\n\n\n\n\n\n\n\n\n\n    Types of cover\n\n\n\n\n \n\n\n\n\nCarbon Shortfall Insurance\nCompensate for unexpected carbon credit shortfalls caused by lower-than-expected yields over time, natural disasters, fires, disease, windstorms or other accidents\n\n\n                                        Learn more                                        \n\n\n\n\n\n\n \n\n\n\n\nCarbon Reversal Insurance\nEnsure the long-term integrity of your emissions reduction efforts by replacing sequestered carbon lost due to reversal events that allow sequestered carbon to leak back into the atmosphere\n\n\n                                        Learn more                                        \n\n\n\n\n\n\n \n\n\n\n\nUnintended Emissions Insurance\nProtect against unintended emissions caused by temporary disruptions in carbon capture technologies, breakdowns in machinery or accidental surplus emissions\n\n\n                                        Learn more                                        \n\n\n\n\n\n\n\n\n\n\n\n\n\n    Case Studies\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n                        Case Study                    \n\n\n15th Dec 2023\n\n\nCarbon Shortfall Insurance\n\n            Read Case Study\n            \n\n\n\n\n\n \n\n\n\n                        Case Study                    \n\n\n15th Dec 2023\n\n\nCarbon Reversal Insurance\n\n            Read Case Study\n            \n\n\n\n\n\n \n\n\n\n                        Case Study                    \n\n\n15th Dec 2023\n\n\nUnintended Emissions Insurance\n\n            Read Case Study\n            \n\n\n \n\n\n\n\n\n\n\n\nConnect with us\n\n\n\n\n\n\n+41 44 383 03 03\n\n\n\ninfo@carbonpool.earth\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n\n                                    CarbonPool \n                                    Dufourstrasse 185a\n                                    8008 Zürich\n                                    Switzerland                                \n\n\n\n\n\n\n                        Whether you want to know what are your risks as a developer or a buyer, or how much our insurance will cost you, we can help.                     \n\n\n\nGet in touch\n\n\n\n\n\n\n\n\n\n\n© 2024 CarbonPool\n\n\nPrivacy Policy\n\n\n\n\nCookie Policy\n\n\n\n\nTerms of Use\n\n\n\n\n\n\nWebsite by SOZO\n\n\n\n\n\n\n\n\n\nBy clicking accept you are agreeing to the use of all cookies which will allow us to provide you with the most relevant experience when visiting or re-visiting this website. This means that your personal preferences will be remembered when you use this website. However, you may manage your Cookie Settings to provide a controlled consent. Cookie settingsACCEPTManage consent\n\n\n\n\nClose\n\n\n\n\n\n\nPrivacy Overview \nThis website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience.\n\n \n\n\n\n\n\n                                Necessary                            \n\n\n Necessary \n\n\n                                    Always Enabled                                \n\n\n\nNecessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously.\nCookieDurationDescriptioncookielawinfo-checbox-analytics11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checbox-functional11 monthsThe cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\".cookielawinfo-checbox-others11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other.cookielawinfo-checkbox-advertisement1 yearSet by the GDPR Cookie Consent plugin, this cookie records the user consent for the cookies in the \"Advertisement\" category.cookielawinfo-checkbox-necessary11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".cookielawinfo-checkbox-performance11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\".CookieLawInfoConsent1 yearCookieYes sets this cookie to record the default button state of the corresponding category and the status of CCPA. It works only in coordination with the primary cookie.viewed_cookie_policy11 monthsThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data.\n\n\n\n\n\n\n                                Functional                            \n\n\nfunctional\n\n\n\n\nFunctional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features.\n\n\n\n\n\n\n\n                                Performance                            \n\n\nperformance\n\n\n\n\nPerformance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors.\n\n\n\n\n\n\n\n                                Analytics                            \n\n\nanalytics\n\n\n\n\nAnalytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc.\n\n\n\n\n\n\n\n                                Advertisement                            \n\n\nadvertisement\n\n\n\n\nAdvertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads.\n\n\n\n\n\n\n\n                                Others                            \n\n\nothers\n\n\n\n\nOther uncategorized cookies are those that are being analyzed and have not been classified into a category as yet.\n\n\n\n\n\n\n\n\n\n\n\n\n\nSave & Accept\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.carbonpool.earth/our-clients/": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOur Clients | CarbonPool\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        You are using an outdated browser. Please upgrade your browser to improve your experience\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                Why Carbon Insurance?            \n\n\n\n                What Do We Insure Against?            \n\n\n\n                Our Clients            \n\n\n\n                Our Team            \n\n\n\n                Knowledge            \n\n\n\nGet in touch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy Carbon Insurance?\n\n\n\n\nWhat Do We Insure Against?\n\n\n\n\nOur Clients\n\n\n\n\nOur Team\n\n\n\n\nKnowledge\n\n\n\n\n\n\nGet in touch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n    our clients\n\n    Who are our clients?\n\n\n\n\n\n\n                    see how we help:                \n\n\n\n\n                            Corporates & Investors                        \n\n\n\n\n                            Fund Managers                        \n\n\n\n\n                            Project Developers                        \n\n\n\n\n\n\n\n\n\n                    Corporates & Investors                \n\n\n\nPioneering corporates today are investing in carbon projects and portfolios in order to meet internal or regulated carbon offset targets. However, stakeholders are increasingly demanding that companies demonstrate that those carbon credits remain valid even in the face of bad weather, accidents, breakdowns or natural disasters.\n\n\n                            Corporates & Investors                        \n\n\nGuaranteed credits: protect your net zero targets against unexpected losses                                \n\nConfidence: independently verified risk profile of high-quality carbon credits you invest in                                \n\nGuidance: navigating the carbon credit landscape by investing in credits insurable by CarbonPool                                \n\nUnderwriting: customized underwriting mechanisms for very large portfolios                                \n\n\n\n\n \n\n“We have committed to buying forestry credits in the UK to meet our net zero targets - but our legal and procurement teams raised the red flag that we have no guarantee or recourse should those units not materialize. CarbonPool’s insurance would protect us against this risk.”\nBuyer of carbon credits for UK subsidiary of one of the world’s largest energy producers\n\n\n\n\n\n\n\n\n\n\n\n                    Fund Managers                \n\n\n\nAsset managers generating financial returns as well as carbon credits from assets under management (such as timber and afforestation carbon credits) will be exposed to carbon reversal risk in an unexpected event, like a forest fire or natural disaster. CarbonPool’s permanence insurance can underwrite carbon removals that have been sold, credited against emissions reduction targets, and retired.\n\n\n                            Fund Managers                        \n\n\nGuaranteed credits: safeguard your returns against unexpected losses                                \n\nConfidence: independently verified risk profile of carbon projects                                \n\nSales: sell credits to CarbonPool                                \n\n\n\n\n \n\n“Our institutional investors are increasingly seeing carbon credits as a revenue stream and some are asking to receive specific numbers of carbon credits to offset their own emissions. We would need insurance to be able to offer this.”\nManager of a carbon credit fund at an industrial forestry asset manager\n\n\n\n\n\n\n\n\n\n\n\n                    Developers of carbon removal projects                \n\n\n\nDevelopers today face difficulty attracting investment into their projects, as buyers are cautious about investing in projects whose outcome – delivery of carbon credits – is not guaranteed. Developers who can say that an insurance company has evaluated and will insure their projects gain instant credibility, making it easier to attract both project investors and credit buyers.\nFurther, there is increasing pressure from buyers of carbon credits on carbon developers to guarantee credits. Bad weather, natural variability in nature-based projects, and technical failures are real threats to the project delivery and permanence and there is no clarity on who bears the cost of that risk. Today, many developers create their own buffer pools – keeping aside credits that they could otherwise sell to increase their economic returns. An insurance contract could provide the same protection as a buffer pool for likely a far more attractive cost depending on the risk of the project.\n\n\n                            Developers of carbon removal projects                        \n\n\nCredibility: enhance your project’s credibility to buyers through CarbonPool’s independent risk assessment                                \n\nGuaranteed credits: protect your project against delivery or reversal risk                                \n\nBuffer pool: insurance enhances risk protection and increases revenue by eliminating the need for a buffer pool                                \n\nSales: sell credits to CarbonPool                                \n\n\n\n\n \n\n“We are very happy with the results of the pre-underwriting, especially the independent validation of our carbon curve and the detailed risk assessment. With this insurance, our investors and clients will be able to protect their carbon removals against natural hazards and similar risks.” \nDeveloper of several mangrove afforestation projects\n\n\n\n\n\n\n\n\n\n\n\n\n\n    Case Studies\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n                        Case Study                    \n\n\n15th Dec 2023\n\n\nCarbon Shortfall Insurance\n\n            Read Case Study\n            \n\n\n\n\n\n \n\n\n\n                        Case Study                    \n\n\n15th Dec 2023\n\n\nCarbon Reversal Insurance\n\n            Read Case Study\n            \n\n\n\n\n\n \n\n\n\n                        Case Study                    \n\n\n15th Dec 2023\n\n\nUnintended Emissions Insurance\n\n            Read Case Study\n            \n\n\n \n\n\n\n\n\n\n\n\nConnect with us\n\n\n\n\n\n\n+41 44 383 03 03\n\n\n\ninfo@carbonpool.earth\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n\n                                    CarbonPool \n                                    Dufourstrasse 185a\n                                    8008 Zürich\n                                    Switzerland                                \n\n\n\n\n\n\n                        Whether you want to know what are your risks as a developer or a buyer, or how much our insurance will cost you, we can help.                     \n\n\n\nGet in touch\n\n\n\n\n\n\n\n\n\n\n© 2024 CarbonPool\n\n\nPrivacy Policy\n\n\n\n\nCookie Policy\n\n\n\n\nTerms of Use\n\n\n\n\n\n\nWebsite by SOZO\n\n\n\n\n\n\n\n\n\nBy clicking accept you are agreeing to the use of all cookies which will allow us to provide you with the most relevant experience when visiting or re-visiting this website. This means that your personal preferences will be remembered when you use this website. However, you may manage your Cookie Settings to provide a controlled consent. Cookie settingsACCEPTManage consent\n\n\n\n\nClose\n\n\n\n\n\n\nPrivacy Overview \nThis website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience.\n\n \n\n\n\n\n\n                                Necessary                            \n\n\n Necessary \n\n\n                                    Always Enabled                                \n\n\n\nNecessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously.\nCookieDurationDescriptioncookielawinfo-checbox-analytics11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checbox-functional11 monthsThe cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\".cookielawinfo-checbox-others11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other.cookielawinfo-checkbox-advertisement1 yearSet by the GDPR Cookie Consent plugin, this cookie records the user consent for the cookies in the \"Advertisement\" category.cookielawinfo-checkbox-necessary11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".cookielawinfo-checkbox-performance11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\".CookieLawInfoConsent1 yearCookieYes sets this cookie to record the default button state of the corresponding category and the status of CCPA. It works only in coordination with the primary cookie.viewed_cookie_policy11 monthsThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data.\n\n\n\n\n\n\n                                Functional                            \n\n\nfunctional\n\n\n\n\nFunctional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features.\n\n\n\n\n\n\n\n                                Performance                            \n\n\nperformance\n\n\n\n\nPerformance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors.\n\n\n\n\n\n\n\n                                Analytics                            \n\n\nanalytics\n\n\n\n\nAnalytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc.\n\n\n\n\n\n\n\n                                Advertisement                            \n\n\nadvertisement\n\n\n\n\nAdvertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads.\n\n\n\n\n\n\n\n                                Others                            \n\n\nothers\n\n\n\n\nOther uncategorized cookies are those that are being analyzed and have not been classified into a category as yet.\n\n\n\n\n\n\n\n\n\n\n\n\n\nSave & Accept\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.carbonpool.earth/our-team/": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOur Team | CarbonPool\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n        You are using an outdated browser. Please upgrade your browser to improve your experience\n    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                Why Carbon Insurance?            \n\n\n\n                What Do We Insure Against?            \n\n\n\n                Our Clients            \n\n\n\n                Our Team            \n\n\n\n                Knowledge            \n\n\n\nGet in touch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy Carbon Insurance?\n\n\n\n\nWhat Do We Insure Against?\n\n\n\n\nOur Clients\n\n\n\n\nOur Team\n\n\n\n\nKnowledge\n\n\n\n\n\n\nGet in touch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n    Our Expert Team\n\nCarbonPool brings together seasoned experts with a wealth of experience in insurance, financial solutions and climate science.\n\n\n\n\n\n\n\n \n\n\n                                        Coenraad Vrolijk                                    \n\n                                            CEO / Co-Founder                                        \n\n\n\n\n\n\n \n\n\n                                        Nandini Wilcke                                    \n\n                                            COO / Co-Founder                                        \n\n\n\n\n\n\n \n\n\n                                        Frederic Olbert                                    \n\n                                            CFO / Co-Founder                                        \n\n\n\n\n\n\n \n\n\n                                        Beat Krauer                                    \n\n                                            Chief Underwriting Officer                                        \n\n\n\n\n\n\n \n\n\n                                        Mathilda Ström                                    \n\n                                            Chief Commercial Officer                                        \n\n\n\n\n\n\n \n\n\n                                        Claudio Braidotti                                    \n\n                                            Chief Investment Officer                                        \n\n\n\n\n\n\n \n\n\n                                        Pedro Fonseca                                    \n\n                                            Principal Capital Modeller                                        \n\n\n\n\n\n\n \n\n\n                                        Kasia Tokarska de los Santos                                    \n\n                                            Principal Climate Modeller                                        \n\n\n\n\n\n\n \n\n\n                                        Oleksandr Kit                                    \n\n                                            Principal Climate Modeller                                        \n\n\n\n\n\n\n \n\n\n                                        Emmanuel Sanchez                                    \n\n                                            Principal Weather Modeller                                        \n\n\n\n\n\n\n \n\n\n                                        Maximilian Kremer                                    \n\n                                            Head of Strategic Projects                                        \n\n\n\n\n\n\n \n\n\n                                        Ewoud Vandewal                                    \n\n                                            Investment Associate                                        \n\n\n\n\n\n\n \n\n\n                                        Brooke Davies                                    \n\n                                            Legal, Markets, and Operations Officer                                        \n\n\n\n\n\n\n \n\n\n                                        Nikolaus Plochmann                                    \n\n                                            Forestry Expert                                        \n\n\n\n\n\n\n\n\n\n                                    Coenraad Vrolijk                                \n\n                                        CEO / Co-Founder                                    \n\nCoenraad Vrolijk (CEO, founder) spent seven years as regional CEO of Allianz Africa, from 2015 to 2022, following a stint at BlackRock and as partner at McKinsey. He has served on multiple advisory boards for companies and other institutions and holds a PhD in economics from Brown.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Nandini Wilcke                                \n\n                                        COO / Co-Founder                                    \n\nNandini Wilcke (COO, founder) worked for thirteen years in various roles at Allianz in Germany and in Africa, including as special assistant to the group CEO and general counsel and regional head of M&A for Allianz Africa. She earned her undergraduate and law degrees at Columbia and spent the first years of her career practicing commercial real estate law.\nNan is leading client acquisition and strategic cooperation discussions.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Frederic Olbert                                \n\n                                        CFO / Co-Founder                                    \n\nFrederic Olbert (CFO, founder) was previously CFO and head of capital markets at investment management start-up LINUS Digital Finance, following work in investment banking for Goldman Sachs and at Allianz, where he set up a life insurance startup in Ghana and worked on strategy and M&A topics. His MBA is from INSEAD.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Beat Krauer                                \n\n                                        Chief Underwriting Officer                                    \n\nBeat Krauer (CUO) has spent 20 years in various roles in the re-/insurance market. After completing his degree as a forestry engineer at ETH Zürich and an assignment in the forestry sector, he joined Partner Re’s catastrophe research team and moved on to agriculture underwriting at Allianz Re before being appointed as the global head of agriculture reinsurance to build up a global team and portfolio at AXA XL.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Mathilda Ström                                \n\n                                        Chief Commercial Officer                                    \n\nMathilda Ström (CCO) was the co-founder and deputy CEO of BIMA, the leading microinsurance and digital health player in emerging markets. Prior to that she was a strategy consultant within telecoms, media, and technology at Spectrum Value Partners. She has also served as a director on multiple boards, including for a renewable energy company in Africa.\nMathilda is leading the commercial strategy.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Claudio Braidotti                                \n\n                                        Chief Investment Officer                                    \n\nClaudio Braidotti (CIO) began his career at McKinsey & Company in 2000, focusing on the insurance industry.  In 2013 he moved to Allianz as partner in the internal consulting unit, then served in Allianz SE as board member for the Italian subsidiary, Allianz SpA.  In 2017, he moved to Africa as head of regional strategy and business development, and in 2021 Claudio became CFO for Allianz Morocco and board member for Jubilee Allianz Kenya and Jubilee Allianz Mauritius.\nClaudio leads CarbonPool’s carbon investment portfolio.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Pedro Fonseca                                \n\n                                        Principal Capital Modeller                                    \n\nPedro Fonseca (Principal Capital Modeller) holds a PhD degree in theoretical physics from Rutgers University and has over 20 years of experience in the financial industry, where he has been responsible for areas such as risk management, capital requirement, regulatory reporting, and data modelling.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Kasia Tokarska de los Santos                                \n\n                                        Principal Climate Modeller                                    \n\nKasia Tokarska de los Santos (Principal Climate Modeller) holds a PhD in climate modelling, with post-doctoral experience at ETH Zürich and the University of Edinburgh, focused on carbon budgets. She joins CarbonPool following positions at a risk consultancy and McKinsey.\nKasia leads CarbonPool’s carbon removal project risk assessments.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Oleksandr Kit                                \n\n                                        Principal Climate Modeller                                    \n\nOleksandr Kit (Principal Climate Modeller) has been working in the climate and geospatial analytics field for the last 15 years, including as a consultant at the World Bank and as a researcher at the Potsdam Institute for Climate Impact Research, primarily focusing on developing analytical tools for assessing CO₂ emissions and climate risks. Oles received a PhD in Geography from Humboldt University Berlin.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Emmanuel Sanchez                                \n\n                                        Principal Weather Modeller                                    \n\nEmmanuel Sanchez (Principal Weather Modeller) has more than 15 years’ experience modelling risk and pricing insurance products, for firms including UBS and Allianz, where he was a senior deal modeller for parametric weather transactions.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Maximilian Kremer                                \n\n                                        Head of Strategic Projects                                    \n\nMaximilian Kremer (Head of Strategic Projects) is a former Engagement Manager at McKinsey & Company where he spent 6 years consulting financial institutions on questions concerning strategy, technology, and operations. Maximilian holds a doctoral degree in financial economics from TU Munich, where he researched and taught classes on growth financing and alternative investments. He also holds an M.Sc. in Financial Economics from the University of Oxford.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Ewoud Vandewal                                \n\n                                        Investment Associate                                    \n\nEwoud Vandewal (Investment Associate) holds master’s degrees in chemical engineering from the Catholic University of Leuven and management from INSEAD. His bachelor’s degree is in engineering. Ewoud picked up consulting experience at Emerald Consulting.\nEwoud is shaping and executing the carbon credit investment strategy.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Brooke Davies                                \n\n                                        Legal, Markets, and Operations Officer                                    \n\nBrooke Davies brings multiple years of experience in climate law and policy from Akin, a full-service global law firm, where she advised leading corporate and sovereign clients shaping the carbon market. Brooke also has extensive experience in strategic communications from her time at West Wing Writers, a messaging and strategy firm of former presidential speechwriters writing for Fortune 500 CEOs, heads of state, and major foundation presidents. Brooke received her law degree from Harvard Law School.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n                                    Nikolaus Plochmann                                \n\n                                        Forestry Expert                                    \n\nNikolaus Plochmann (Forestry Expert) holds a M.Sc. in “Forest and Wood Science” from Yale University and the Technical University of Munich, where he focused on sustainable forest management, logistics, and green finance. His B.Sc. is in “Forest Science and Resource Management” from the Technical University of Munich. His prior experiences include working for Europe’s largest forest owner, SCA, the Bavarian State Forestry, and the management consultancy Oliver Wyman. Nikolaus also served in an elite unit of the German Armed Forces.\nNikolaus is shaping CarbonPool’s carbon credit investment strategy and nature-based insurance products.\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nConnect with us\n\n\n\n\n\n\n+41 44 383 03 03\n\n\n\ninfo@carbonpool.earth\n\n\n\nConnect on LinkedIn\n\n\n\n\n\n\n                                    CarbonPool \n                                    Dufourstrasse 185a\n                                    8008 Zürich\n                                    Switzerland                                \n\n\n\n\n\n\n                        Whether you want to know what are your risks as a developer or a buyer, or how much our insurance will cost you, we can help.                     \n\n\n\nGet in touch\n\n\n\n\n\n\n\n\n\n\n© 2024 CarbonPool\n\n\nPrivacy Policy\n\n\n\n\nCookie Policy\n\n\n\n\nTerms of Use\n\n\n\n\n\n\nWebsite by SOZO\n\n\n\n\n\n\n\n\n\nBy clicking accept you are agreeing to the use of all cookies which will allow us to provide you with the most relevant experience when visiting or re-visiting this website. This means that your personal preferences will be remembered when you use this website. However, you may manage your Cookie Settings to provide a controlled consent. Cookie settingsACCEPTManage consent\n\n\n\n\nClose\n\n\n\n\n\n\nPrivacy Overview \nThis website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience.\n\n \n\n\n\n\n\n                                Necessary                            \n\n\n Necessary \n\n\n                                    Always Enabled                                \n\n\n\nNecessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously.\nCookieDurationDescriptioncookielawinfo-checbox-analytics11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checbox-functional11 monthsThe cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\".cookielawinfo-checbox-others11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other.cookielawinfo-checkbox-advertisement1 yearSet by the GDPR Cookie Consent plugin, this cookie records the user consent for the cookies in the \"Advertisement\" category.cookielawinfo-checkbox-necessary11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".cookielawinfo-checkbox-performance11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\".CookieLawInfoConsent1 yearCookieYes sets this cookie to record the default button state of the corresponding category and the status of CCPA. It works only in coordination with the primary cookie.viewed_cookie_policy11 monthsThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data.\n\n\n\n\n\n\n                                Functional                            \n\n\nfunctional\n\n\n\n\nFunctional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features.\n\n\n\n\n\n\n\n                                Performance                            \n\n\nperformance\n\n\n\n\nPerformance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors.\n\n\n\n\n\n\n\n                                Analytics                            \n\n\nanalytics\n\n\n\n\nAnalytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc.\n\n\n\n\n\n\n\n                                Advertisement                            \n\n\nadvertisement\n\n\n\n\nAdvertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads.\n\n\n\n\n\n\n\n                                Others                            \n\n\nothers\n\n\n\n\nOther uncategorized cookies are those that are being analyzed and have not been classified into a category as yet.\n\n\n\n\n\n\n\n\n\n\n\n\n\nSave & Accept\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}]}