{"text": [{"https://www.carboncell.co": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCarbon Cell\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pagecarbon cellbenefitsbiocharteamcontactwe are on a mission to make polystyrene waste a thing of the past. \n​\nCarbon Cell is dedicated to providing a sustainable alternative to traditional polymer-based foams. Our high-performance expandable foam is fully compostable and locks in carbon for centuries.Contact UsBeneftswhy carbon cellCarbon Cell's patent pending (2402238.6) revolutionary technology makes it an ideal choice for anyone looking for an eco-friendly alternative to traditional polymer-based foams. 01Carbon NegativeBecause it's made with biochar, Carbon Cell is carbon-negative. This means that it removes more CO2 from the atmosphere than it requires to make.02High-PerformanceCarbon Cell boasts a competitive thermal conductivity and is three times stronger than EPS and other bio-based alternatives. It also performs well under fire and has a comparable sound insulation to EPS foam.03Flexible ManufacturingOur flexible manufacturing process allows us to rapidly form our foam in different customizable geometries. This allows Carbon Cell to be used in a wide variety of applications, from packaging to construction. 04Fully CompostableCarbon Cell has a renewable supply chain, and is compostable within home composting conditions!BiocharbiocharBiochar is the key ingredient that gives Carbon Cell its unique properties.\n​\nIt’s basically a fancy kind of charcoal made in a process called pyrolysis. During this process, organic biomass is transformed at high temperatures in the absence of oxygen. \n \nThe resultant material is carbon negative. In fact, each tonne of biochar can lock in up to 2.1 tonnes of CO2e [1]\n​\nAnd it can be made from waste streams like potato peels or even textile waste.Life Cycle Assessment (LCA) of Biochar Production from a Circular Economy PerspectiveTeamteamWe are a team of surfers and sailors, designers and engineers, and we are sick of seeing toxic trash everywhere.\n \nWe have over 25 years of combined experience in business and an unrelenting commitment to sustainability. We have worked in diverse fields, such as civil engineering, product design, bio-materials, and brand strategy, and expertise in deploying sustainable design methods, such as life cycle analysis and circular design. \n​\nWe met while studying a double master's in Innovation Design Engineering (MSc/MA) between Imperial College London and the Royal College of Arts and came together as a team due to our unrelenting passion for  on our passion for sustainability.\n​\nWe are also backed by a talented board of advisors with world-class expertise in engineering, sustainability, and material science. And have participated in the following prestigious accelerators and competitions:CEOElizabeth Lee10+ years experience in business and brand strategy. \nAn avid climber with an obession with bio-materials.liz@carboncell.coHead of Strategy & Partnerships Juan Ignacio Rion8+ years experience in sustainability, foresight, and innovation strategy. \nA surfer with a passion for the ocean.juan@carboncell.coHead of Technology DevelopmentEden Harrison3+ years experience creating dynamic installations. \nSailing captain with a passion project developing artificial reefs.eden@carboncell.coHead of ProductOri Blich5+ years experience in product design, from medical devices to furniture. \nA cyclist with a keen eye for simple and powerful design. ori@carboncell.cocontact usFirst NameLast NameEmailSubjectLeave us a message...SubmitThank you for contacting us!Green Web© 2024 Carbon Cell. All rights reserved.bottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}]}