{"text": [{"https://cetasol.com": "\n\n\n\n\n\n\n\nIntelligent Energy Optimization - Cetasol - Marine Sustainability\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkip to content\n\n\n\n\nToggle NavigationSolutionsiHelmCetaFuelServicesTechnologyBook a demoToggle NavigationSolutionsiHelmCetaFuelServicesTechnologyBook a demo\n \n\n\n\n\n\nCetasol – Marine SustainabilityAnton Ödman2024-07-01T14:39:22+02:00 \nYour intelligent solutions for\n\nmaritime sustainability.\niHelm gets to know your vessel with analytical data models for optimized operation and minimized climate footprint.\nBook a demoBook a demoYour intelligent solutions for\nmaritime sustainability.iHelm gets to know your vessel with analytical data models for optimized operation and minimized climate footprint.\nBook a demoBook a demoAre youAre youStruggling to reduce energy consumption?Even the smallest variations make a big difference in energy consumption and emissions. With the price of fuel, fuel cost becomes a large part of the expenses of the operation. \nFinding it hard to follow regulations?Being able to follow regulations is a necessity, but reports can be a time-consuming task. Especially with the added tasks of CII reporting and MRV reporting. \nLacking insights into the operation?Many operations gather large amounts of vessel data without having a clear goal of what to do with it. \nStruggling to reduce energy consumption?Even the smallest variations make a big difference in energy consumption and emissions, particularly with the added focus on marine fuel reduction.\nFinding it hard to follow regulations?Being able to follow regulations is a necessity, but it can be hard to find the time to fill in all of the reports and reduce emissions, especially with the added tasks of CII reporting and MRV reporting.\nLacking insights into the operation?Many operations gather large amounts of vessel data without having a clear goal of what to do with it. However, logbook tools and engine data are crucial for optimizing a fleet, enabling informed decision-making and maximizing efficiency.\n We have the solution.  We have the solution. \n \nSave time, energy and money with the iHelm platform, leveraging the latest maritime technology.\n \nSave time, energy \n\n\nand money with the iHelm platform, leveraging new marine technology.\n We have the solution. \n \nSave time, energy \n\n\nand money with the iHelm platform, leveraging new marine technology.\nWe createWe createAdaptable softwareAI based software that adapts to every vessel.Adaptable software\nOur software is based on AI that automatically adapts to every vessel and operation. No programming per vessel is needed.\nDigital twin modelData based digital model.Digital twin model\nWith our adaptable software we create two physics informed digital twin models of vessel and engine that automatically updates daily. This is done without the need for many hardware or sensors.\nAffordable solutionsIntelligent solutions for everyone.Affordable solutions\nAs a result of our AI software we can use minimal hardware and software, and as a result keep the costs down for our customers. Our solution is scalable and affordable.\nWe createAdaptable softwareAI based software that adapts to every vessel.Adaptable software\nOur software is based on AI that automatically adapts to every vessel and operation. No programming per vessel is needed.\nDigital twin modeldata based digital model.Digital twin model\nWith our adaptable software we create two physics informed digital twin models of vessel and engine that automatically updates daily. This is done without the need for many hardware or sensors.\nAffordable solutionsIntelligent solutions for everyone.Affordable solutions\nAs a result of our AI software we can use minimal hardware and software, and as a result keep the costs down for our customers. Our solution is scalable and affordable.\nDecision support for fleet management, crew, business owners, and local planners.Decision support for fleet management crew,\nbusiness owners and local planners.Our SolutionsOur SolutionsiHelm iHelm Decision support.Decision support.Your system for energy optimization, based on AI, iHelm learns the operation and provides recommendations in real-time.\nLearn more about fuel optimizationThe iHelm platform offers decision support and  for the whole fleet – captain, office, and city planners.The iHelm platform offers decision support for the whole fleet – captain, office and city planners. iHelm supports the entire operation.  iHelm supports the entire operation. Our SolutionsiHelmDecision support.Your system for energy optimization, based on AI iHelm learns the operation and provide recommendations in real-time.\nLearn more about fuel optimizationThe iHelm platform offers decision support for the whole fleet – captain, office and city planners.iHelm supports the  entire operation. CetaFuelCetaFuelVirtual fuel reader.Virtual fuel reader.Measure fuel flow without the risk of clogging and expensive installations with Cetafuel.\nLearn more about virtual fuel readingCetaFuel facilitates your transition to a more sustainable operation with increased insights by accurately measuring your fuel usage.CetaFuel facilitates your transition to a more sustainable marine industry by accurately measuring your fuel consumption. Start measuring your fuel today.  Take the step today. CetaFuelVirtual fuel reader.Measure fuel flow without the risk of clogging and expensive installations with Cetafuel, aiding in ship fuel reduction efforts.\nLearn more about virtual fuel readingCetaFuel facilitates your transition to a more sustainable marine industry by accurately measuring your fuel consumption. Take the step today. What sets us apart What sets us apart No additional sensor\niHelm’s energy optimization relies solely on existing engine signals, eliminating the need for extra sensors. Our physics-informed digital twin ensures seamless installation without the necessity of additional sensors. Offering user-friendly design, effortless installation, and cloud-based data analysis, iHelm’s capabilities stand validated by the platform’s track record. If your vessels already collect data, we can pre-train your iHelm system prior to installation.\nRead moreAdaptive AI software \niHelm’s AI model comprehends diverse vessel operations. Our adaptive model discerns nuances, distinguishing between tugboats, ferries, and cargo vessels. Understanding captain behavior delivers real-time operational recommendations.\nLearn more A learning system \nHelm’s AI, a dynamic solution, constantly learns from operations, evolving through new features, updates, and system enhancements. Seamlessly connected to GPS, engine data, and various energy sources, it generates a dynamic vessel model (a digital energy twin). Linking your vessel to iHelm’s AI provides captains with real-time recommendations based on external factors and past experiences.\nLearn more Team Expertise\nCetasol boasts extensive expertise in maritime engines, hybrid systems, and automation. Our proficient in-house tech team, comprising data scientists and software developers, consistently pioneers new features.\nLearn more Universal Solution\nThe iHelm platform caters to every vessel, driveline, and engine type. Coupled with Cetasol’s CetaFuel solution, it seamlessly integrates with mechanical engines.\nLearn more What sets us apart No additional sensor\niHelm’s energy optimization relies solely on existing engine signals, eliminating the need for extra sensors. Our physics-informed digital twin ensures seamless installation without the necessity of additional sensors. Offering user-friendly design, effortless installation, and cloud-based data analysis, iHelm’s capabilities stand validated by the platform’s track record. If your vessels already collect data, we can pre-train your iHelm system prior to installation.\nRead moreAdaptive AI software \niHelm’s AI model comprehends diverse vessel operations. Our adaptive model discerns nuances, distinguishing between tugboats, ferries, and cargo vessels. Understanding captain behavior delivers real-time operational recommendations.\nLearn more A learning system \nHelm’s AI, a dynamic solution, constantly learns from operations, evolving through new features, updates, and system enhancements. Seamlessly connected to GPS, engine data, and various energy sources, it generates a dynamic vessel model (a digital energy twin). Linking your vessel to iHelm’s AI provides captains with real-time recommendations based on external factors and past experiences.\nLearn more Team Expertise\nCetasol boasts extensive expertise in maritime engines, hybrid systems, and automation. Our proficient in-house tech team, comprising data scientists and software developers, consistently pioneers new features.\nLearn more Universal Solution\nThe iHelm platform caters to every vessel, driveline, and engine type. Coupled with Cetasol’s CetaFuel solution, it seamlessly integrates with mechanical engines.\nLearn more Don’t listen to us – listen to our customers“We chose Cetasol because we think it is one of the best companies doing this type of product.”\n– Alilauro Volaviamare SpA\nSee all our customers and testimonials here Don’t listen to us –\nlisten to our customers“We chose Cetasol because we think it is one of the best companies doing this type of product.”\n– Alilauro Volaviamare SpA\nSee all our customers and testimonials here Our Operational FrameworkOur Operational FrameworkOur customer base spans diverse sub-segments, each with unique needs. Continuously driven by our customers’ demands for enhanced functionalities, we consistently introduce 1-2 entirely new features every month. As our repertoire of features expands, so does the value derived from our system.\nPrioritizing Feature Requests We meticulously assess and rank feature requests from various customers, aligning our development efforts with market demands.\nThis is just the tip of an iceberg.Operational FrameworkOur customer base spans diverse sub-segments, each with unique needs. Continuously driven by our customers’ demands for enhanced functionalities, we consistently introduce 1-2 entirely new features every month. As our repertoire of features expands, so does the value derived from our system.\nPrioritizing Feature Requests We meticulously assess and rank feature requests from various customers, aligning our development efforts with market demands.\nThis is just the tip of an iceberg.Even identical vessels are not identicalEven among identical vessels and engines, nuances distinguish one from another. These subtle variations create unique areas for improvement across different vessels within a fleet, emphasizing the need for tailored solutions.\nIMO regulations mandate stringent measures for emission reduction in the maritime industry. Compliance with pollution prevention and emission reduction standards is imperative for shipping companies.\nTo not only meet but surpass these standards, our cutting-edge AI technology supports energy management, speed optimization, and more. Variations in fuel consumption among different captains operating identical vessels on the same routes can reach up to 25%. iHelm serves as an effective tool in mitigating this human factor, curbing fuel consumption and emissions.\nLearn more Even identical vessels are not identicalEven identical vessels are not identicalEven among identical vessels and engines, nuances distinguish one from another. These subtle variations create unique areas for improvement across different vessels within a fleet, emphasizing the need for tailored solutions.\nIMO regulations mandate stringent measures for emission reduction in the maritime industry. Compliance with pollution prevention and emission reduction standards is imperative for shipping companies.\nTo not only meet but surpass these standards, our cutting-edge AI technology supports energy management, speed optimization, and more. Variations in fuel consumption among different captains operating identical vessels on the same routes can reach up to 25%. iHelm serves as an effective tool in mitigating this human factor, curbing fuel consumption and emissions.\nLearn more Even identical vessels\nare not identicalEven among identical vessels and engines, nuances distinguish one from another. These subtle variations create unique areas for improvement across different vessels within a fleet, emphasizing the need for tailored solutions. IMO regulations mandate stringent measures for emission reduction in the maritime industry. Compliance with pollution prevention and emission reduction standards is imperative for shipping companies.\nTo not only meet but surpass these standards, our cutting-edge AI technology supports energy management, speed optimization, and more. Variations in fuel consumption among different captains operating identical vessels on the same routes can reach up to 25%. iHelm serves as an effective tool in mitigating this human factor, curbing fuel consumption and emission.\nCetasol provides comprehensive support for your operations in the following areas:\nVoyage optimization (integral to iHelm’s core)\n Extensive speed optimization (integral to iHelm’s core)\nDaily energy management reports accessible via the Cloud\nFull electric analysis by Cetasol for electrification feasibility\nBio-LNG/LPG analysis by Cetasol for alternative solutions\nThird-generation biofuel analysis by Cetasol for alternative solutions.\n\nTrusted byTrusted byRead our latest newsRead our latest newsStephanie Hansson2024-07-01T13:45:36+02:00Cetasol’s Innovative Digitalization ProjectSara Jensson2024-05-20T10:03:29+02:00Meet our Data Scientist – Interview with Simon at CetasolSara Jensson2024-05-15T11:32:02+02:00Cetasol Celebrates “Women in Maritime” Day: A Day for Equality and InclusionWhitepaper insightsOur latest whitepapersCetaFuelIn this whitepaper we have based the result on data from three different vessels in Nordic region.\nTo download pageAll whitepapersPublishedWe publish new whitepapers frequently regarding technology and our solutions.\nSee all hereWhitepaper insightsLatest whitepapersCetaFuelIn this whitepaper we have based the result on data from three different vessels in Nordic region.\nTo download pageAll whitepapersPublishedWe publish new whitepapers frequently regarding technology and our solutions.\nSee all hereReady to get started with us? \nBook a demoReady to get started with us? \nBook a demo\n\n\n\n \n \nCompanyBook a demo\nSustainability\nCustomers\nInvestor relations\nNews\nWhite Papers\nPrivacy Policy\nContactGet in touch\nAbout us\nCareer\nSolutionsiHelm\nCetaFuel\nServices\nOur technology\nReceive our newsletter\n© 2022 Cetasol AB\n\n\n\n\n \n \n\n\n\nPage load link\n\n\n\n\n\n\n\n\n"}, {"https://cetasol.com/solutions/": "\n\n\n\n\n\n\n\nSolutions - Cetasol solutions\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkip to content\n\n\n\n\nToggle NavigationSolutionsiHelmCetaFuelServicesTechnologyBook a demoToggle NavigationSolutionsiHelmCetaFuelServicesTechnologyBook a demo\n \n\n\n\n\n\nSolutionsVeronica Söderbergh2024-04-17T12:52:57+02:00 \nSolutions.Cetasol offers energy management solutions for maritime excellence. Our services support you in decision-making, timesaving, emission reduction, and more. We provide solutions to enhance maritime operations and services for consultant improvements.\nSolutions.We create intelligent solutions that support sustainability \nin the maritime industry.\nOur SolutionsOur SolutionsiHelm iHelm Decision support.Decision support.Your system for energy optimization, based on AI iHelm learns the operation and provide recommendations in real-time.\nLearn more about fuel optimizationOur SolutionsOur SolutionsiHelm iHelm Decision support.Decision support.Your system for energy optimization, based on AI iHelm learns the operation and provide recommendations in real-time.\nLearn more about fuel optimizationThe iHelm platform offers decision support for the whole fleet – captain, office and city planners. iHelm supports the entire operation. CetaFuelCetaFuelVirtual fuel reader.Virtual fuel reader.Measure fuel flow without risk of clogging and expensive installations with Cetafuel.\nLearn more about virtual fuel readingCetaFuelCetaFuelVirtual fuel reader.Virtual fuel reader.Measure fuel flow without risk of clogging and expensive installations with Cetafuel.\nLearn more about virtual fuel readingCetaFuel facilitates your transition to a more sustainable marine industry by accurately measuring your fuel consumption. Take the step today. Why Cetasol?Engine\nknowledgeWith roots from Volvo Penta we have extended engine knowledge.\nAdvanced technologyOur advanced AI technology is designed to work on any vessel and any brand of engine and powertrain.\nProven\nsolutionThe solutions are proven to work and iHelm can support to fuel savings of 10-25%.\nWhy Cetasol?Engine\nknowledgeWith roots from Volvo Penta we have extended engine knowledge.\nAdvanced technologyOur advanced AI technology is designed to work on any vessel and any brand of engine and powertrain.\nProven\nsolutionThe solutions are proven to work and iHelm can support to fuel savings of 10-25%.\nWhitepapersWe have created white papers that entail tips and tricks as well as more technological developments. Go to the page below to find all of our white papers.\nCheck out WhitepapersWhitepapersWe have created white papers that entail tips and tricks as well as more technological developments. Go to the page below to find all of our white papers.\nCheck out CetaFuelIt is estimated that 25% of small to medium-sized vessels lack a physical sensor.\nPhysical sensors can be expensive and they require installations that can be time consuming and expensive.\nCetaFuel is a Virtual Sensor that replace physical sensorsCetaFuel replaces the need for a physical sensor and can let you know your fuel consumption with great accuracy.\nLearn more about virtual fuel readingiHelmOptimize your energy consumption with the help of iHelm.\nWith the help of actionable insights provided by iHelm, the operation can use eco-driving to reduce energy consumption.\niHelm is a two-part solution that works for both the captain and the business owner. The business owner and other interested personnel have access to a cloud for more insights and reports.\niHelm gets to know your vessel.With the help of AI, iHelm will help improve the operation and get to know the vessel over time.\nLearn more about optimized energy consumptionWhitepapersWe have created whitepapers that entail tips and tricks as well as more technological developments. Go to the page below to find all of our whitepapers.\nWhitepapers\n\n\n\n \n \nCompanyBook a demo\nSustainability\nCustomers\nInvestor relations\nNews\nWhite Papers\nPrivacy Policy\nContactGet in touch\nAbout us\nCareer\nSolutionsiHelm\nCetaFuel\nServices\nOur technology\nReceive our newsletter\n© 2022 Cetasol AB\n\n\n\n\n \n \n\n\n\nPage load link\n\n\n\n\n\n\n\n\n"}, {"https://cetasol.com/ihelm-intelligent-platform/": "\n\n\n\n\n\n\n\niHelm - Cetasol home of the iHelm platform\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkip to content\n\n\n\n\nToggle NavigationSolutionsiHelmCetaFuelServicesTechnologyBook a demoToggle NavigationSolutionsiHelmCetaFuelServicesTechnologyBook a demo\n \n\n\n\n\n\niHelmVeronica Söderbergh2024-04-29T10:04:57+02:00 \nThe iHelm platform.Moving forward with your operation. One system for multiple needs.\nBook a demoThe iHelm platform.Moving forward with your operation. One system for multiple needs.\nBook a demoDecision support in realtime  for the entire fleet. Decision support in realtime  for the entire fleet. Why iHelm?Years of research and our extended knowledge of engines show that you can save 10-25% in fuel usage with the iHelm platform. iHelm is based on AI and will learn your operation. It is more than a visualization tool, it will provide recommendations in real-time. A driver support system for the captain.\niHelm also provide managers and business owners with KPI’s for sustainable choices, as well as ready-made report and status of vessel and engine.\niHelm will save you money, time and fuel.\nSorry, your browser doesn't support embedded videos.Why iHelm?Years of research and our extended knowledge of engines show that you can save 10-25% in fuel usage with the iHelm platform. iHelm is based on AI and will learn your operation. It is more than a visualization tool, it will provide recommendations in real-time. A driver support system for the captain.\niHelm also provide managers and business owners with KPI’s for sustainable choices, as well as ready-made report and status of vessel and engine.\niHelm will save you money, time and fuel.\nSorry, your browser doesn't support embedded videos.0%Ferry in Sweden saved 17% fuel in their first year0%High speed ferry saved 10% fuel in eight monthsReady to start reducing your emissions?Contact us today to start your journey toward a more sustainable operation.\nGet started todayDigital twin modeliHelm gets to know your vessel, utilizing engine data, and with our advanced technology, a digital twin engine and vessel is created and updated every day.\nRead more about our technology\nDigital twin modeliHelm gets to know your vessel, utilizing engine data, and with our advanced technology, a digital twin engine and vessel is created and updated every day.\nRead more about our technology\nSorry, your browser doesn't support embedded videos.How does it work?The iHelm platform gets to know your vessel. iHelm consists of 1 PC (Cetasol Main Unit/CMU), 1 Captain display, and cables.\nThe CMU is easily installed onboard and connected to your engine and has minimal sensors with the option of connecting additional sensors.\nThe CMU is supplied with a global IOT network and runs your vessel data in the AI model constantly. iHelm will create an operational model, engine model, captain model, and component model after it’s run for a couple of hours.\nThe data is processed and presented in real-time for the captain on the Captain display. The captain receives guidance and insights to reduce fuel and reach the destination in time.\nEverything that happens at sea is sent directly to the Cloud Dashboard. In the Cloud Dashboard, the management can follow and receive engine insights, reports, and more. iHelm read ten different languages (protocol) to match your fleet setup.\nHow does it work?The iHelm platform gets to know your vessel. iHelm consists of 1 PC (Cetasol Main Unit/CMU), 1 Captain display, and cables.\nThe CMU is easily installed onboard and connected to your engine and has minimal sensors with the option of connecting additional sensors.\nThe CMU is supplied with a global IOT network and runs your vessel data in the AI model constantly. iHelm will create an operational model, engine model, captain model, and component model after it’s run for a couple of hours.\nThe data is processed and presented in real-time for the captain on the Captain display. The captain receives guidance and insights to reduce fuel and reach the destination in time.\nEverything that happens at sea is sent directly to the Cloud Dashboard. In the Cloud Dashboard, the management can follow and receive engine insights, reports, and more. iHelm read ten different languages (protocol) to match your fleet setup.\nSorry, your browser doesn't support embedded videos.More than a\nvisualization tool.Book your demoMore than a visualization tool.Book your demoFeatures of iHelmWith the iHelm platform you are not buying a fixed system. On average we release two major features every month.\nPath planningEfficiently plan limited routes within predefined areas or free zones with our fleet route planning feature. Our route planning includes comprehensive weather analysis, ensuring that your chosen routes are not only fuel-efficient but also consider weather conditions for a safer journey.\nSpeed recommendationBased on the data collected from available signals, GPS and weather, iHelm will provide the captain real-time recommendations on the speed. The recommended speed will support reduced fuel use for more sustainable driving, while getting from A to B in real-time.\nReportingReceive ready-made reports based with statistics of your operation. They are produced weekly, monthly and yearly, or upon request. We also have optional IMO reports.\nCaptain IDEvery captain will have their own individual captain login. See the consumption of each captain, driving patterns and more. This can be used for training purposes and for their own development purpose.\nFeatures of iHelmWith the iHelm platform you are not buying a fixed system. On average we release two major features every month.\nPath planningEfficiently plan limited routes within predefined areas or free zones with our fleet route planning feature. Our route planning includes comprehensive weather analysis, ensuring that your chosen routes are not only fuel-efficient but also consider weather conditions for a safer journey.\nSpeed recommendationBased on the data collected from available signals, GPS and weather, iHelm will provide the captain real-time recommendations on the speed. The recommended speed will support reduced fuel use for more sustainable driving, while getting from A to B in real-time.\nReportingReceive ready-made reports based with statistics of your operation. They are produced weekly, monthly and yearly, or upon request. We also have optional IMO reports.\nCaptain IDEvery captain will have their own individual captain login. See the consumption, driving patterns and more. This can be used for training purposes and for their own development purpose.\nAdditional featuresAdditional features.What sets us apart Weather station\nWe provide our customers with what they need. Weather station is optional in our system and will be used to correct online weather forecasts with local measurement points. Weather station can be also used as source of GPS, compass, accelerometer, Gyro, pressure and RH measurement.\nCetaFuel fuel reader\nOlder mechanical engines don’t have access to a fuel monitor. Instead of installatling an expensive fuel reader with the risk of clogging – we have developed a virtual fuel reader. With 97-99,5% accuracy, Cetasol provide customers with CetaFuel for fuel reading. Patent by Cetasol.\nLearn more about Cetafuel here\nMotion measurement\nWe provide our customers with what they need. Weather station is optional in our system and will be used to correct online weather forecasts with local measurement points. Weather station can be also used as source of GPS, compass, accelerometer, Gyro, pressure and RH measurement.\nAdditional features.What sets us apart Additional features.Additional features.Weather station\nWe provide our customers with what they need. Weather station is optional in our system and will be used to correct online weather forecasts with local measurement points. Weather station can be also used as source of GPS, compass, accelerometer, Gyro, pressure and RH measurement.\nCetaFuel fuel reader\nOlder mechanical engines don’t have access to a fuel monitor. Instead of installatling an expensive fuel reader with the risk of clogging – we have developed a virtual fuel reader. With 97-99,5% accuracy, Cetasol provide customers with CetaFuel for fuel reading. Patent by Cetasol.\nLearn more about Cetafuel here\nMotion measurement\nWe provide our customers with what they need. Weather station is optional in our system and will be used to correct online weather forecasts with local measurement points. Weather station can be also used as source of GPS, compass, accelerometer, Gyro, pressure and RH measurement.\nAdditional features.What sets us apart Additional features.Additional features.Weather station\nWe provide our customers with what they need. Weather station is optional in our system and will be used to correct online weather forecasts with local measurement points. Weather station can be also used as source of GPS, compass, accelerometer, Gyro, pressure and RH measurement.\nCetaFuel fuel reader\nOlder mechanical engines don’t have access to a fuel monitor. Instead of installatling an expensive fuel reader with the risk of clogging – we have developed a virtual fuel reader. With 97-99,5% accuracy, Cetasol provide customers with CetaFuel for fuel reading. Patent by Cetasol.\nLearn more about Cetafuel here\nMotion measurement\nWe provide our customers with what they need. Weather station is optional in our system and will be used to correct online weather forecasts with local measurement points. Weather station can be also used as source of GPS, compass, accelerometer, Gyro, pressure and RH measurement.\nRead about all features.Click on the button below to read about more features of iHelm.\niHelm featuresRead about all features.Click on the button below to read about more features of iHelm.\niHelm featuresFAQ’sSo you’re a hardware company?\nNo, we are a software company developing intelligent solutions for maritime sustainability. However, we have a small PC (CMU) that we install to enable our services.\nHow long does an installation take?\nIt all depends on how prepared the vessel is for the installation, how the signals are drawn and what protocol you have onboard. The fastest installation of iHelm took 2.5 hours and the longest 3 days.\nWhat is installed on the boat for iHelm?\nWe make use of the available signals onboard the vessel and our system consists of very little hardware. We install the Cetasol Main Unit (PC) onboard the vessel, antenna and Captain display on the bridge.\nWhat needs to be on the ship to reduce fuel?\nOur solution comes in different layers, to get started we need access to GPS, direction, and fuel consumption but by adding more sensors and signals the model will be more accurate and provide more impactful guidance. For examplae fuel monitoring for older mechanical engines can be done with CetaFuel.\nWhat does the payment look like?\nOur solutions are very affordable and consist of an activation fee (one-time) and a monthly cost, which is paid annually.\nDoes iHelm work on my vessel?\nYes, we can connect to any vessel that has an engine or a battery powertrain.\nMy vessel has an old engine, does iHelm really work then?\nYes, we can read all protocols on the market, even analog signals.\nIs it only for diesel engines?\nNo, iHelm is designed to work on all drivelines. For hybrid operated vessels, iHelm can guide the optimal combination between fuel and electric.\nDoes it work with all brand of engines?\nYes. iHelm is adaptable to all brand of engines. It is dependent on protocols and signals, not brand. Contact us and we can discuss this further.\nDoes it work for non-repeatable operations?  \nYes. The system has two modes – repeatable like a ferry and semi-repeatable like a tug boat operation. Every operation has a degree of reputability, nothing is completely random!\nWhitepapersWhitepapersWe have created whitepapers that entail tips and tricks as well as more technological developments. Go to the page below to find all of our whitepapers.\nFill in the form below to download our white paper to learn more about the development of iHelm for pilot boats.\n\nWhitepapersWe have created whitepapers that entail tips and tricks as well as more technological developments. Go to the page below to find all of our whitepapers.\nFill in the form below to download our white paper to learn more about the development of iHelm for pilot boats.\n\n\n\n\n\n \n \nCompanyBook a demo\nSustainability\nCustomers\nInvestor relations\nNews\nWhite Papers\nPrivacy Policy\nContactGet in touch\nAbout us\nCareer\nSolutionsiHelm\nCetaFuel\nServices\nOur technology\nReceive our newsletter\n© 2022 Cetasol AB\n\n\n\n\n \n \n\n\n\nPage load link\n\n\n\n\n\n\n\n\n"}, {"https://cetasol.com/cetafuel/": "\n\n\n\n\n\n\n\nCetaFuel - Cetasol home of the iHelm platform\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkip to content\n\n\n\n\nToggle NavigationSolutionsiHelmCetaFuelServicesTechnologyBook a demoToggle NavigationSolutionsiHelmCetaFuelServicesTechnologyBook a demo\n \n\n\n\n\n\nCetaFuelVeronica Söderbergh2024-04-29T10:09:45+02:00 \nCetaFuel.Your virtual fuel reader that is affordable, reliable and reduces risk of clogging.\nBook a demoCetaFuel.Your virtual fuel reader that is affordable, reliable and reduces risk of clogging.\nWhy CetaFuel?Why CetaFuel?It is estimated that 25% of small to medium-sized vessels lack a physical fuel sensor.\nPhysical sensors can be expensive and they require installations that can be time consuming and expensive.\nCetaFuel provide fuel reading without the risk of clogging and expensive installation.\nSorry, your browser doesn't support embedded videos.CetaFuel gives you 97-99,5% accuracy CetaFuel gives you 97-99,5% accuracy How does it work?Patented solution. We install the Cetasol Main Unit PC onboard the vessel and connect it to the engines and available signals. The captain are then able to see fuel usage on a screen in the helm. CetaFuel provides fuel reading with 97-98,5% accuracy.\nSorry, your browser doesn't support embedded videos.Sorry, your browser doesn't support embedded videos.How does it work?Patented solution. We install the Cetasol Main Unit PC onboard the vessel and connect it to the engines and available signals. The captain are then able to see fuel usage on a screen in the helm. CetaFuel provides fuel reading with 97-98,5% accuracy.\nReplaces the need for expensive flow metersBook a demoReplaces the need for expensive flow metersBook a demoCombine with iHelm.Combine with iHelm.CetaFuel can be combined with iHelm for fuel savings and further insights into the operation. When used with iHelm, you will have an overview of the entire connected vessel operation and be able to monitor vessel and engine health as well as the fuel usage.\nFAQ’sHow does it actually work?\nWe implement in our advanced physics models through only 2-3 available motor signals, and with that we can generate a real time fuel consumption. Get your fuel consumption in real-time without the risk of clogging.\nWhat is the accuracy?\nWith CetaFuel for fuel monitoring we have a accuracy of 97-99,5%. We have done several tests with CetaFuel on vessels in different sizes and with different brands of engines.\nWhat are the risks?\nWith CetaFuel you reduce the risk of clogging since there is no sensors in the fuel flow. It is also a very affordable solution since there are no need for hardware. With our virtual fuel monitor CetaFuel you reduce the risks for your operation.\nWhat do you need from me?\nWe do need to calibrate the model with 2-3 tanks of the vessel. After that we use our knowledge of data science to provide you with the estimated fuel usage.\nWhitepapersWe have created white papers that entail tips and tricks as well as more technological developments.\nFill in the form below to download our white paper where we explain CetaFuel further.\n\nWhitepapersWhitepapersWe have created white papers that entail tips and tricks as well as more technological developments.\nFill in the form below to download our white paper where we explain CetaFuel further.\n\n\n\n\n\n \n \nCompanyBook a demo\nSustainability\nCustomers\nInvestor relations\nNews\nWhite Papers\nPrivacy Policy\nContactGet in touch\nAbout us\nCareer\nSolutionsiHelm\nCetaFuel\nServices\nOur technology\nReceive our newsletter\n© 2022 Cetasol AB\n\n\n\n\n \n \n\n\n\nPage load link\n\n\n\n\n\n\n\n\n"}, {"https://cetasol.com/services/": "\n\n\n\n\n\n\n\nContact Cetasol - Services Cetasol\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkip to content\n\n\n\n\nToggle NavigationSolutionsiHelmCetaFuelServicesTechnologyBook a demoToggle NavigationSolutionsiHelmCetaFuelServicesTechnologyBook a demo\n \n\n\n\n\n\nServicesVeronica Söderbergh2024-04-29T11:05:56+02:00 \nServices.Cetasol offers energy management solutions for maritime excellence. Our services support you in decision-making, timesaving, emission reduction, and more. With our fleet monitoring system, we provide solutions to enhance maritime operations and services for continuous consultant improvements.\nServices.Cetasol offers energy management solutions for maritime excellence. Our services support you in decision-making, timesaving, emission reduction, and more. With our fleet monitoring system, we provide solutions to enhance maritime operations and services for continuous consultant improvements.\nWe specialize in providing cutting-edge energy management.Our comprehensive services encompass data-based analysis and evaluation, offering consultancy that empowers your maritime operations.Discover our solutions Book your demo nowWe specialize in providing cutting-edge energy management.Our comprehensive services encompass data-based analysis and evaluation, offering consultancy that empowers your maritime operations.\nBook your demo nowDiscover our solutions Explore the range of our servicesEvaluation of energy solutions \nHarness the power of data-driven decision-making with our in-depth evaluation of alternative energy solutions, including optimized propeller performance for both digital ship and digital vessel configurations. We analyze operational data and simulate your final solution within the context of your operations. Our consultancy services extend to advising on the degree of hybridization, CO2 tradeoffs, and ROI calculations to ensure your energy solutions align with both your operational and sustainability goals.\nMotion analysis of the vessel\nOptimize vessel performance with our motion analysis services. Gain insights into the dynamics of your vessel’s motion to enhance stability, reduce energy consumption, and improve overall operational efficiency.\nDevelopment of Digital Twin vessel\nWe create precise digital twins of your vessel, opening doors to various applications such as software in loop, model in loop, and hardware in loop. Unlock new possibilities for simulation, testing, and development.\nScenario Analysis\nNavigate confidently through complex scenarios with our scenario analysis services. Our advanced modeling techniques allow us to calculate scenarios that may not exist yet based on the vessel’s model. This foresight enables you to make proactive decisions in response to potential future challenges.\nRoute Planning\nEfficiently plan routes within predefined areas or free zones with our fleet monitoring tool. Our route planning services include comprehensive weather analysis, ensuring that your chosen routes are not only fuel-efficient but also consider weather conditions for a safer journey.\nHigh Accuracy Fuel Calculations\nPrecision matters. Our high-accuracy fuel calculations ensure that you have reliable data for effective fuel management, helping you make informed decisions to reduce costs and enhance efficiency.\nDigital Twin of Mass Flow Meters\nFor recalibration purposes, we offer digital twins of mass flow meters. Ensure the accuracy of your measurements and maintain optimal performance with our recalibration services.\nTrim Optimization\nMaximize fuel efficiency with our trim optimization services. Fine-tune your vessel’s trim for the best possible fuel consumption and performance.\nHull Cleaning Calculations\nImprove fuel efficiency and reduce environmental impact with our hull cleaning calculations. We analyze data to recommend the most effective cleaning strategies for your vessel.\nExplore the range of our servicesEvaluation of energy solutions \nHarness the power of data-driven decision-making with our in-depth evaluation of alternative energy solutions. We analyze operational data and simulate your final solution within the context of your operations. Our consultancy services extend to advising on the degree of hybridization, CO2 tradeoffs, and ROI calculations to ensure your energy solutions align with both your operational and sustainability goals.\nMotion analysis of the vessel\nOptimize vessel performance with our motion analysis services. Gain insights into the dynamics of your vessel’s motion to enhance stability, reduce energy consumption, and improve overall operational efficiency.\nDevelopment of Digital Twin Vessel\nWe create precise digital twins of your vessel, opening doors to various applications such as software in loop, model in loop, and hardware in loop. Unlock new possibilities for simulation, testing, and development.\nScenario Analysis\nNavigate confidently through complex scenarios with our scenario analysis services. Our advanced modeling techniques allow us to calculate scenarios that may not exist yet based on the vessel’s model. This foresight enables you to make proactive decisions in response to potential future challenges.\nRoute Planning\nEfficiently plan routes within predefined areas or free zones. Our route planning services include comprehensive weather analysis, ensuring that your chosen routes are not only fuel-efficient but also consider weather conditions for a safer journey.\nHigh Accuracy Fuel Calculations\nPrecision matters. Our high-accuracy fuel calculations ensure that you have reliable data for effective fuel management, helping you make informed decisions to reduce costs and enhance efficiency.\nDigital Twin of Mass Flow Meters\nFor recalibration purposes, we offer digital twins of mass flow meters. Ensure the accuracy of your measurements and maintain optimal performance with our recalibration services.\nTrim Optimization\nMaximize fuel efficiency with our trim optimization services. Fine-tune your vessel’s trim for the best possible fuel consumption and performance.\nHull Cleaning Calculations\nImprove fuel efficiency and reduce environmental impact with our hull cleaning calculations. We analyze data to recommend the most effective cleaning strategies for your vessel.\nExplore the range of our servicesEvaluation of energy solutions \nHarness the power of data-driven decision-making with our in-depth evaluation of alternative energy solutions, including optimized propeller performance for both digital ship and digital vessel configurations. We analyze operational data and simulate your final solution within the context of your operations. Our consultancy services extend to advising on the degree of hybridization, CO2 tradeoffs, and ROI calculations to ensure your energy solutions align with both your operational and sustainability goals.\nMotion analysis of the vessel\nOptimize vessel performance with our motion analysis services. Gain insights into the dynamics of your vessel’s motion to enhance stability, reduce energy consumption, and improve overall operational efficiency.\nDevelopment of Digital Twin Vessel\nWe create precise digital twins of your vessel, opening doors to various applications such as software in loop, model in loop, and hardware in loop. Unlock new possibilities for simulation, testing, and development.\nScenario Analysis\nNavigate confidently through complex scenarios with our scenario analysis services. Our advanced modeling techniques allow us to calculate scenarios that may not exist yet based on the vessel’s model. This foresight enables you to make proactive decisions in response to potential future challenges.\nRoute Planning\nEfficiently plan routes within predefined areas or free zones with our fleet monitoring tool. Our route planning services include comprehensive weather analysis, ensuring that your chosen routes are not only fuel-efficient but also consider weather conditions for a safer journey.\nHigh Accuracy Fuel Calculations\nPrecision matters. Our high-accuracy fuel calculations ensure that you have reliable data for effective fuel management, helping you make informed decisions to reduce costs and enhance efficiency.\nDigital Twin of Mass Flow Meters\nFor recalibration purposes, we offer digital twins of mass flow meters. Ensure the accuracy of your measurements and maintain optimal performance with our recalibration services.\nTrim Optimization\nMaximize fuel efficiency with our trim optimization services. Fine-tune your vessel’s trim for the best possible fuel consumption and performance.\nHull Cleaning Calculations\nImprove fuel efficiency and reduce environmental impact with our hull cleaning calculations. We analyze data to recommend the most effective cleaning strategies for your vessel.\nLet us help you enhance your operation with our fleet management tool Want to get in touch?Want to get in touch?Please feel free to reach out to us if you have any questions or concerns. We are eager to hear from you!\n\n\n\n\n\n \n \nCompanyBook a demo\nSustainability\nCustomers\nInvestor relations\nNews\nWhite Papers\nPrivacy Policy\nContactGet in touch\nAbout us\nCareer\nSolutionsiHelm\nCetaFuel\nServices\nOur technology\nReceive our newsletter\n© 2022 Cetasol AB\n\n\n\n\n \n \n\n\n\nPage load link\n\n\n\n\n\n\n\n\n"}]}