{"text": [{"https://www.cowboycleanfuels.com": "\n\n\n\n\n\n\n\nCowboy Clean Fuels\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n              Overview\n            \n\n            TEAM\n          \n\n            NEWS\n          \n\n            Contact Us\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOverviewTEAMNEWSContact Us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nScroll\n\n\n\n\n\n\n \n\nCOWBOY CLEAN FUELSGeologic Carbon Removal & Sequestration with Renewable Energy ProductionCowboy Clean Fuels (CCF) leverages natural systems to generate the most durable and high-quality carbon removal credits in the marketplace, while producing significant volumes of Renewable Natural Gas (RNG).\n\n\n\n\n\n\n\n\n\n\n\nOur Mission\n\n\n\nCCF utilizes state-of-the-art, patented technology to supply both carbon dioxide removal credits to offset emissions and carbon negative RNG to keep fueling companies to reach net zero. Cowboy’s process supports an all of the above energy strategy including advancing the carbon economy.\n\n \n\nOur Method\n\n\n\nCowboy utilizes agricultural byproducts to feed methanogenic organisms through repurposed alternative feedstock coal seams in Wyoming’s Powder River Basin (PRB) area. The output is Renewable Natural Gas (CH4), while the CO2 permanently binds to the coal below Earth’s surface. \n\n \n\nOur Vision\n\n\n\nCowboy Clean Fuels is leveraging natural systems to generate the most durable and high-quality carbon removal credits in the marketplace, while producing significant volumes of Renewable Natural Gas (RNG).  \n\n \n\nProcess Overview\n\n   \n\nCompany NewsJuly 22, 2024PR NewswireCowboy Clean Fuels Announces Transformative Financing and Commercial ProgressJanuary 17, 2024PR NewswireCowboy Clean Fuels Awarded with Energy Matching Funds of $7.8M from Wyoming Energy AuthorityJanuary 16, 2024Wyoming Energy AuthorityCowboy Clean Fuels Announces Significant Funding Award to Support Commercialization of Technology and Build Out of Initial Project in WyomingNovember 13, 2023PR NewswireCowboy Clean Fuels Announces that the Wyoming Center for Business and Economic Analysis Has Confirmed the Significant Potential Economic Impact from its Initial RNG and Carbon Sequestration ProjectMarch 28, 2023PR NewswireCowboy Clean Fuels Completes Series A Financing to Advance Renewable Natural Gas Commercialization PlanJanuary 11, 2022The Energy Investment Summit - Cowboy Interview 2022Exclusive Interview with Cowboy Clean Fuels – potential for high volume, low carbon intensity RNG with carbon captureFebruary 2, 2021The Energy Venture Investment Summit - Cowboy Interview 2021Presented by EnerCom and Colorado School of Mines\n\n\n\n\n\n\n  \n\nContact us\n\n\n\nFor more information on Cowboy Clean Fuels, please send us a message.\n\n \n\n\n\n\n\n\n\n\n              Email\n              \n                *\n\n\n\n\n\n              Message\n              \n                *\n\n\n\n\n\n\n\nThank you. A member of our team will respond as soon as possible.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImage\n\n\n\nAbout\n\n\n\nContact\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n5680 Greenwood Plaza Blvd. Suite 500 Greenwood Village, CO 80111\n\n\n\n2200 Foothills Blvd, Suite BGillette, WY 82716\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n© All Rights Reserved by Cowboy Clean Fuels\n\n\n\n\n\n\n\n\n\n"}]}