{"text": [{"https://cyclize.de": "CYCLIZE          Skip to content NewsJobsDeutschKontaktiere UnsKontaktiere UnsNewsJobsDeutschKontaktiere UnsKontaktiere UnsLET’S DEFOSSILIZE!Enabling a carbon circular economyInnovative plasma sources for chemical recycling, CO2-splitting, and gas reformingWhere recycling still falls shortTo stay on a pathway to net-zero carbon neutrality the emission of CO2 has to be reduced – however, not every industry can do without carbon. Carbon is the backbone of the chemical industry, and virtually every consumer product contains carbon that once originated from fossil resources. At the end of its life, a product becomes waste. Waste, that generates 3.2 million tons of CO2 in Germany by incineration and of which 700 thousand tons are exported annually.However, the term ‘decarbonization’ is not used within the chemical industry, because carbon cannot be replaced in products like plastics – instead, the goal is ‘defossilization’: The renouncement from fossil carbon sources.Plasma technology for a sustainable futureCyclize helps to close this value chain into a circular carbon economy. Our plasma technology will allow the reforming of waste plastics into new intermediate chemicals, which ultimately are used to create new products. This approach has the potential to mitigate CO2 emissions as well as plastic waste pollution. Depending on the desired product, our process can even be carbon negative by using carbon dioxide as feedstock. Thereby, it helps companies reach emission goals and replaced fossil feedstock like natural gas or oil.Enabling a circular economy for carbonThe name Cyclize originates from ‘to cyclize’. In chemistry, this refers to a reaction where a carbon chain gets closed into a ring. In the same way, Cyclize wants to transform the carbon value chain into a ring with a disruptive technology.Electrifying the chemical industryToday, fossil feedstock and fossil energy are at the core of chemical processes. Next to electro- and photochemistry, plasma chemistry is one main pillar of electrification of the chemical industry. As such, it has the potential to replace oil and natural gas as feedstock. The intermediate chemical that is produced in our plasma processes is syngas: A mixture of hydrogen and carbon monoxide. A non-thermal plasma is used to gasify waste material. The generated gas is reformed in the plasma with steam or carbon dioxide. These processes are referred to as dry reforming and steam reforming. Both can efficiently generate syngas. Dry reforming yields carbon monoxide rich gas for phosgenation, while steam reforming yields hydrogen rich syngas that can be used as fuel or for methanol production. The syngas can be used as drop-in to replace natural gas or propane gas reforming. This benefits not only the environment, but also energetic self-reliance.about usWe are a young, passionate team of researchers and entrepreneurs from the University of Stuttgart who are pursuing an ambitious and important goal. Starting in 2018, our team has researched carbon utilization based on plasma technology. From the beginning, we developed and used our own equipment, which we now want to scale and commercialize. In May of 2022, the idea and team behind Cyclize received an EXIST-Forschungstransfer funding from the German government to transfer our technology towards industrial application.Maike LambarthCEO & co-founder   Email     LinkedIn  Stephan RenningerCTO & co-founder   Email     LinkedIn  Jan SteinCOO & co-founder   Email     LinkedIn  Dominik NovakovicCFO & co-founder   Email     LinkedIn  “Big global problems need innovative solutions; Cyclize will contribute to protecting the climate through our versatile and sustainable technology”Maike Lambarth, CEO CyclizeWe are looking forward to getting to know you !*protected email*Contact USMedia Email LegalImprintPrivacy PolicyCopyright © 2024 CYCLIZE   Scroll to Top                      "}, {"https://cyclize.de/en/news/": "News - CYCLIZE             Skip to content NewsJobsDeutschKontaktiere UnsKontaktiere UnsNewsJobsDeutschKontaktiere UnsKontaktiere UnsNewsPress ReleasesFebruary 21, 2024ClimateTech startup Cyclize secures €5 Million in Seed Funding for revolutionary plastic recycling technologyCyclize, the ClimateTech startup from Stuttgart, is forging ahead with €4.75 million in startup capital to initiate a revolution in the chemical industry – the goal: To replace fossil resources using innovative carbon recycling of plastic waste and CO2.DownloadPress ReviewMediaArticles (selection)Leschs Kosmos – ZDF (minute 11:00)Landtagspolitiker zu Besuch – RegioTVPodcast – GründerlebenCHEmanager (22.03.2023)Prozesstechnik Online (28.11.2022)Process (17.05.2022)LinkedIn Display content from widgets.sociablekit.com Click here to display content from widgets.sociablekit.com   Always display content from widgets.sociablekit.com Open \"content\" directly  Media Email LegalImprintPrivacy PolicyCopyright © 2024 CYCLIZE   Scroll to Top                      "}, {"https://cyclize.de/de/": "CYCLIZE          Zum Inhalt springen NewsOffene StellenEnglishKontaktiere UnsKontaktiere UnsNewsOffene StellenEnglishKontaktiere UnsKontaktiere UnsLET’S DEFOSSILIZE!Kohlenstoff-Kreislaufwirtschaft ermöglichenInnovative Plasmaquellen für chemisches Recycling, CO2-Aufspaltung und GasreformierungRecycling immer noch unzureichendUm das Ziel einer angestrebten Klimaneutralität zu erreichen, muss die weltweite CO2-Emission deutlich zurückgehen. Problematisch ist, dass nicht jede Industrie ohne die Nutzung von Kohlenstoff auskommt. Insbesondere in der chemischen Industrie ist Kohlenstoff bislang eine unabdingbare Ressource. Fast jedes Verbraucherprodukt enthält Kohlenstoff, der ursprünglich aus fossilen Rohstoffen entstanden ist. Diese Produkte haben einen endlichen Lebenszyklus und landen früher oder später im Müll. Bei dessen Verbrennung werden alleine in Deutschland 3,2 Mio. Tonnen an jährlichen CO2-Emissionen verursacht. Davon werden zusätzlich 700.000 Tonnen pro Jahr ins Ausland exportiert.In der chemischen Industrie kann nicht von einer „Dekarbonisierung“ gesprochen werden, da Kunststoffe nicht ohne Kohlenstoff auskommen. Stattdessen ist das angestrebte Ziel eine „Defossilisierung“ – Der Verzicht auf fossile Kohlenstoffquellen.Plasmatechnologie für eine nachhaltige ZukunftCyclize unterstützt dabei, diese Wertschöpfungskette zu einer Kohlenstoff-Kreislaufwirtschaft zu schließen. Unsere Plasmatechnologie erlaubt das Umwandeln von Kunststoffabfällen in neue chemische Zwischenprodukte, die unmittelbar zur Herstellung neuer Produkte verwendet werden können. Dieses Vorgehen hat das Potential, gleichzeitig die CO2-Emissionen sowie die Verschmutzung durch Plastikmüll zu reduzieren. Je nach gewünschtem Produkt kann unser Prozess sogar kohlenstoffnegativ sein, indem vorhandenes Kohlenstoffdioxid als Ausgangsquelle genutzt wird. Dadurch unterstützt das Verfahren von Cyclize Unternehmen dabei, ihre Emissionsziele zu erreichen und fossile Rohstoffe wie Erdgas oder Öl zu ersetzen.Ermöglichung einer Kreislaufwirtschaft für KohlenstoffDer Name Cyclize leitet sich von „to cyclize“ ab. In der Chemie wird damit die Reaktion bezeichnet, bei der eine Kohlenstoffkette sich zu einem Kreis schließt. Auf die gleiche Weise möchte Cyclize die Wertschöpfungskette von Kohlenstoff durch eine innovative Technologie zu einem Kreis schließen.Elektrifizierung der Chemischen IndustrieFossile Rohstoffe und fossile Energie bilden heute den Kern von chemischen Prozessen. Neben der Elektro- und Photochemie bildet die Plasmachemie eine der Hauptsäulen in der Elektrifizierung der chemischen Industrie. Als solche hat sie das Potential, Erdöl und Erdgas als Rohstoff zu ersetzen. Das chemische Zwischenprodukt, das in unseren Plasmaprozessen erzeugt wird, ist Synthesegas: Ein Gemisch aus Wasserstoff und Kohlenstoffmonoxid. Ein nicht-thermisches Plasma wird zur Vergasung von Abfallstoffen eingesetzt. Das erzeugte Gas wird im Plasma mit Dampf oder Kohlenstoffdioxid reformiert. Diese Verfahren werden als Trockenreformierung und Dampfreformierung bezeichnet. Beide können effizient Synthesegas erzeugen. Bei der Trockenreformierung wird kohlenstoffmonoxidreiches Gas für die Phosgenierung gewonnen, während bei der Dampfreformierung wasserstoffreiches Synthesegas entsteht, das als Brennstoff oder für die Methanolherstellung verwendet werden kann. Das Synthesegas kann als Ersatz für Erdgas oder Propangasreformierung verwendet werden. Dieser Umstand kommt nicht nur der Umwelt, sondern auch der Energieautarkie zugute.Über unsWir sind ein junges, leidenschaftliches Team von Forscher*innen und Unternehmer*innen der Universität Stuttgart, das ein ambitioniertes und wichtiges Ziel verfolgen. Seit 2018 forschen wir an der Nutzung von Kohlenstoff auf Basis der Plasmatechnologie. Von Beginn an haben wir dabei unser eigenes Equipment entwickelt und eingesetzt, die wir nun skalieren und kommerzialisieren wollen. Im Mai 2022 hat unsere Idee und das Team dahinter eine EXIST-Forschungstransfer-Förderung vom Bundesministerium für Wirtschaft und Klimaschutz erhalten, um unsere Technologie zukünftig auch in die industrielle Anwendung zu überführen.Maike LambarthCEO & co-founder   Email     LinkedIn  Stephan RenningerCTO & co-founder   Email     LinkedIn  Jan SteinCOO & co-founder   Email     LinkedIn  Dominik NovakovicCFO & co-founder   Email     LinkedIn  „Große globale Probleme brauchen innovative Lösungen; Cyclize wird durch seine vielseitige und nachhaltige Technologie zum Klimaschutz beitragen.“Maike Lambarth, CEO CyclizeWir freuen uns darauf, Sie kennen zu lernen!*protected email*Kontaktiere UnsMedia Email LegalImpressumDatenschutzerklärungCopyright © 2024 CYCLIZE   Nach oben scrollen                      "}, {"https://cyclize.de/en/imprint/": "Imprint - CYCLIZE           Skip to content NewsJobsDeutschKontaktiere UnsKontaktiere UnsNewsJobsDeutschKontaktiere UnsKontaktiere UnsImprintCyclize GmbHTaxiswald 970771 Leinfelden-EchterdingenGermanyTel.: +49 711 685 61569E-Mail: *protected email*Handelsregister Stuttgart HRB 790414Ust.-IDNr. DE 364273838Managing DirectorMaike LambarthThis imprint also applies to:https://www.linkedin.com/company/cyclize/Media Email LegalImprintPrivacy PolicyCopyright © 2024 CYCLIZE   Scroll to Top                    "}, {"https://cyclize.de/en/privacy-policy/": "Privacy Policy - CYCLIZE           Skip to content NewsJobsDeutschKontaktiere UnsKontaktiere UnsNewsJobsDeutschKontaktiere UnsKontaktiere UnsPrivacy PolicyResponsible in the sense of the data protection act:CyclizePfaffenwaldring 4770569 StuttgartData protectionAs website operators, we take the protection of all personal data very seriously. All personal information is treated confidentially and in accordance with the legal requirements, as explained in this privacy policy. Our website can, of course, be used without you providing any personal data. However, if at any time personal data such as name, address or e-mail is requested, this will be done on a voluntary basis. Never will data collected by us be passed on to third parties without your specific permission. Data transmission on the Internet, such as via e-mail, can always have security gaps. Complete protection of data is not possible on the Internet.Privacy Policy Facebook PluginsPlugins from Facebook are used on our pages, provider is Facebook Inc, 1 Hacker Way, Menlo Park, California 94025, USA. Facebook plugins are marked with a Facebook logo or show a “Like button” (“Like”). More information about Facebook plugins can be found here: http://developers.facebook.com/docs/plugins/.When you visit our website, the plugin establishes a direct connection between your web browser and the Facebook server. In the process, it is transmitted that you have visited our website with your IP address. If the Facebook “Like” button is clicked while you are logged into your Facebook account, certain contents of our websites can be linked to your Facebook profile. In this process, it is possible for Facebook to save your visit to our websites with your user account. As a website operator, we have no information about what data is transmitted and how it is used. You can find more information about this here:http://de-de.facebook.com/policy.php.To avoid Facebook tracking your visit to our website, please log out of Facebook before using our offer.Information, deletion, blockingAt any time, you can obtain information about the personal data, its origin and recipients and the benefits of data processing and request a correction, blocking or deletion of this data free of charge. Please use the contact channels indicated in the imprint for this purpose. We are also available at any time to answer any further questions you may have on this subject.Server log filesThis website is hosted by Hetzner on servers in Germany. Hetzner automatically collects and stores data in server log files that are transmitted by your browser. This data includes:Browser type / browser versionOperating system of the computerReferrer URLTime of the server requestIP address, that will be anonymized before savingNo personal data will be stored. This data is not merged with other data sources. If we become aware of concrete indications of illegal use, we reserve the right to check this data retrospectively.CookiesMany Internet pages use cookies. Cookies are harmless to your computer and virus-free. They serve to make Internet offers for the visitors of a friendlier, more effective and safer. Cookies are small text files that are stored on your computer and used by your browser.We usually use so-called “session cookies”. These are automatically deleted after you leave our site. Other cookies remain stored on your computer until you delete them. These cookies help to recognize your computer on your next visit.You can use your browser settings to specify that you are to be informed about new cookies and that you must accept cookies in each case. Likewise, you can exclude the acceptance of cookies for certain cases or generally or activate the automatic deletion of cookies when closing the browser. If cookies are deactivated, the functionality of our website may be limited.Embedding LinkedIn posts using SociableKIT integrationLinkedIn posts are displayed on this website using an iFrame provided by a SociableKIT widget. Content is loaded only after explicit permission is granted. If permission is not granted, no data is transmitted.Permission will reload content from SociableKIT (widgets.sociablekit.com), LinkedIn (licdn.com) and AccentAPI (data.accentapi.com), as well as libraries from bootstrapcdn.com, unpkg.com and cdnjs.cloudflare.com. In the process, personal information (including IP address) is transferred to the respective servers.Further information can be found in the respective data protection notices of the providers:LinkedIn: https://www.linkedin.com/legal/privacy-policy/SociableKIT: https://www.sociablekit.com/privacy-policy/MatomoWe use Matomo for web analytics. The data is only stored on our server and is not shared with external services. We have configured Matomo in a data privacy way: It doesn’t use cookies and the IP address is only recorded in shortened form. It is not possible for us to draw conclusions about your person. You can find more information on the Matomo terms of use and the data protection regulations at: https://matomo.org/privacy/.Opt-out complete; your visits to this website will not be recorded by the Web Analytics tool. Note that if you clear your cookies, delete the opt-out cookie, or if you change computers or Web browsers, you will need to perform the opt-out procedure again.You may choose to prevent this website from aggregating and analyzing the actions you take here. Doing so will protect your privacy, but will also prevent the owner from learning from your actions and creating a better experience for you and other users.   You are not opted out. Uncheck this box to opt-out. You are currently opted out. Check this box to opt-in. This opt out feature requires JavaScript.The tracking opt-out feature requires cookies to be enabled.Changes to our Privacy PolicyOur privacy policy may be amended at irregular intervals to comply with current legal requirements or to implement changes to our services, e.g. when new offers are added. The new privacy policy will then automatically apply to your next visit.This policy was last updated on October 06, 2022.Contacting the data protection officerFor questions regarding data protection, please send us a message to *protected email* with the subject “Data protection”.Media Email LegalImprintPrivacy PolicyCopyright © 2024 CYCLIZE   Scroll to Top                     "}]}