{"text": [{"https://eralberta.ca": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome Page - Emissions Reduction Alberta\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImpactProjectsFundingAbout\n\n\n\n\n\n\n\n\nSearchSearch\n\n\n\n\n\n15 YEARS OF INNOVATION\nFor a decade and a half, our clean technology investments have helped innovators develop and demonstrate Alberta-based technologies that reduce emissions, lower costs, attract investment, and create jobs in Alberta.\n\nOur 15 Year History\n\n\n\n\n\n\n\nCALL LAUNCH: ALBERTA ANNOUNCES ANNUAL $50 MILLION INDUSTRIAL TRANSFORMATION CHALLENGE TO SPEARHEAD EMISSIONS REDUCTION ACROSS ALBERTA’S INDUSTRIAL LANDSCAPE \nLearn More\n\t\t\t\t\t\t \nALBERTA ANNOUNCES ALMOST $60 MILLION TO ACCELERATE HYDROGEN TECHNOLOGIES IN ALBERTA\nLearn More\n\t\t\t\t\t\t \nGovernment of Alberta invests over $33 million through Emissions Reduction Alberta to reshape how energy is transported, managed, and used\nLearn More\n\t\t\t\t\t\t \n\n\n\n\n\n\n\n\n\n298\nProjects\n\n\n\n\n\n\n\n$983.5M\nERA Investment\n\n\n\n\n\n\n\n$9B\nTotal Project Value\n\n\n\n\n\n\n\n42.5MT\nof cumulative emission reductions by 2030\n\n\n\n\n\n\nTechnology funding\nERA is investing in a diverse portfolio of transformative, sustainable technologies that reduce GHG emissions and position Alberta for success.\n\nLearn more\n\n\n\nEnergy Savings for Business\nLearn about ERA’s new Energy Savings for Business Program—a funding opportunity to support small- and medium-scale industrial and commercial businesses.\n\nLearn more\n\n\n\n\nBig News\n\n\n\n\n\n\n\nOur 15 Year History\n\n\nRead more\n\n\n\n\n\n\n\n\n\nAlberta invests over $44 million through ERA to help 21 small- and medium-sized enterprises get their clean technology solutions to market faster\n\n\nRead more\n\n\n\n\n\n\n\n\n\nREGISTRATION FOR GHGT-17 IS NOW OPEN\n\n\nRead more\n\n\n\n\n\n\n\n\n\nCarbon Copy Episode 28: Enhancing Grid Stability\n\n\nRead more\n\n\n\n\n\n\n\n\n\nRead more news\n\n\n\nOur Impact\nNew Tech Helps TAQA North Reduce Gas Plant Emissions In HalfTAQA has re-vamped the Crossfield, Alberta facility with a new solution for acid gas, improving their production efficiency and reducing GHG emissions.\nRead moreCity of Edmonton and Strathcona County Trial Hydrogen BusesThe City of Edmonton is exploring new sustainable transportation technology by purchasing and testing new bus technology, powered by hydrogen, through the Alberta Zero Emission Hydrogen Transit (AZEHT) initiative. \nRead moreSparks Eggs Eliminates Waste from the Sorting and Packaging ProcessBy creating valuable pet food and animal feed from commercially unsalable egg products, Calgary’s Sparks Eggs is doing something never done in Canada.\nRead moreReclaiming mining tires could lead to $45 billion market opportunityCircular Rubber Technologies (CRT) has developed a chemical-free devulcanization process that transforms one of the mining industry’s largest waste streams into a new valuable material.\nRead moreCity of Calgary to Deploy Electric Buses and Rapid-Charging InfrastructureIn addition to the immediate GHG reductions through a one-time replacement of diesel buses, the project will also build capacity to continue and transition electric buses into the transit fleet on an ongoing basis. \nRead more\n\n\n\nFUNDING OPPORTUNITIES\nWe use a rigorous multi-stage process to select projects for funding. This helps ensure that ERA’s funds are invested in accordance with our mandate.\n\nLearn more\n\n\n\nNEWSLETTER\nSubscribe to our newsletter to stay up to date for funding opportunities and other valuable news for the technical community.\n\nSign up\n\n\n\n\n\n\n\n\n\n\n© 2024 Emissions Reduction Alberta (ERA)\n#2503, 10088 102 Avenue NW Edmonton, Alberta, T5J 2Z1#3120, 715 5 Avenue SW Calgary, Alberta, T2P 2X6\n\nERA receives its funding from the Government of Alberta through the Technology Innovation Emissions  Reduction (TIER) Fund.\n\nEmissions Reduction Alberta is a registered tradename of the Climate Change and Emissions Management (CCEMC) Corporation.\nPrivacy PolicyTerms of Use\nIn the spirit of reconciliation, we have the privilege of living, working, and investing on traditional territories, which include Treaty 6, Treaty 7, and Treaty 8 Nations; Metis Nations (Region 3 and 4); Inuit; and all others who live and care for these lands. We are dedicated to promoting a culture of collaboration and meaningful engagement.\n\n\nGeneral Inquiries\nEmail: info@eralberta.ca Phone: 780-498-2068\n\n\nStay in touch\nTwitter\nLinkedIn\nMail\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\nImpactProjectsFundingAbout\n\n\n\nEnergy Savings for BusinessProjectsBoard & GovernanceOur 15 Year History\nTechnology RoadmapStewardship UpdateAnnual ReportBusiness PlanResearch ReportsCalculating Emissions Reduction\n\n\nWorkshopsCarbon Copy PodcastTrusted Partners\nNewsFAQContact UsNewsletterCareers\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.eralberta.ca/impact/": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImpact - Emissions Reduction Alberta\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImpactProjectsFundingAbout\n\n\n\n\n\n\n\n\nSearchSearch\n\n\n\n\n\nImpact\nWe are investing in a diverse portfolio of technologies that will reduce GHG emissions, and we’re helping innovators address barriers to commercialization.\nSynergraze is developing a feed additive to reduce emissions from cattle.\n\n\n\n\nPROJECTS TO DATE\n277\n\n\nERA FUNDING\n$937M\n\n\nPROJECTS TOTAL\n$8B\n\n\nGHG REDUCTIONS\n42,000,000\n\n\n\n\n\n\n\nCategories\nCategory\n\n\n— All —\nCleaner Oil & Gas\nLow Emitting Electricity System\nFood, Fibre, & Bioindustries\nLow-Carbon Industrial Processes & Products\nQ&A\nEnergy Efficiency\n\n\n\n\n\n\n\n\n\n\nNanosTech’s New Technology Is Catalyzing Change In Alberta’s Oil Sands\n05/04/24\n\n\nRead more\n\n\n\n\n\n\n\n\n\nNew Tech Helps TAQA North Reduce Gas Plant Emissions In Half\n06/12/23\n\n\nRead more\n\n\n\n\n\n\n\n\n\nCity of Edmonton and Strathcona County trial hydrogen buses\n30/11/23\n\n\nRead more\n\n\n\n\n\n\n\n\n\nScaling Innovation In Alberta’s Concrete Sector\n09/11/23\n\n\nRead more\n\n\n\n\n\n\n\n\n\nSparks Eggs Eliminates Waste from the Sorting and Packaging Process\n23/10/23\n\n\nRead more\n\n\n\n\n\n\n\n\n\nElemental’s Solar And Storage Project Includes Equity Partnership With First Nation\n28/09/23\n\n\nRead more\n\n\n\n\n\n\n\n\n\nFortisalberta Delivers Backup Power To Waterton Lakes National Park Townsite\n22/06/23\n\n\nRead more\n\n\n\n\n\n\n\n\n\nEdmonton Cement Plant Advances Carbon Capture And Storage Project\n22/06/23\n\n\nRead more\n\n\n\n\n\n\n\n\n\nStoring Carbon in Depleted Oil and Gas Reservoirs\n19/04/23\n\n\nRead more\n\n\n\n\n\n\n\n\n\nQube Uses Artificial Intelligence to Identify and Reduce Methane Emissions\n06/04/23\n\n\nRead more\n\n\n\n\n\n\n\n\n\nThe Best Technologies for your Buck\n24/03/23\n\n\nRead more\n\n\n\n\n\n\n\n\n\nReclaiming mining tires could lead to $45 billion market opportunity\n15/03/23\n\n\nRead more\n\n\n\n\n\n\n\n\n\nClean energy transition requires smart investment, sound policy, and promising technologies\n08/03/23\n\n\nRead more\n\n\n\n\n\n\n\n\n\nCalgary Aggregate Recycling Repurposes Waste Into Valuable Construction Materials \n08/02/23\n\n\nRead more\n\n\n\n\n\n\n\n\n\nTremel Greenhouses grows greener with heating and lighting improvements\n25/01/23\n\n\nRead more\n\n\n\n\n\n\n\n\n\nENMAX first utility in Canada to pilot medium-duty electric fleet vehicles\n07/12/22\n\n\nRead more\n\n\n\n\n\n\n\n\n\nGet the most out of the Energy Savings for Business program\n25/11/22\n\n\nRead more\n\n\n\n\n\n\n\n\n\nLanzaTech’s Carbon Recycling Technology Turns Waste into Saleable Products\n03/11/22\n\n\nRead more\n\n\n\n\n\n\n\n\n\nUFA lighting project shines brighter—and greener\n18/10/22\n\n\nRead more\n\n\n\n\n\n\n\n\n\nCarbonova Creates the Material of the Future\n06/09/22\n\n\nRead more\n\n\n\n\n\n\n\n\n\nCity of Calgary to Deploy Electric Buses and Rapid-Charging Infrastructure\n28/07/22\n\n\nRead more\n\n\n\n\n\n\n\n\n\nENMAX explores carbon capture unit at its Shepard Energy Centre\n13/07/22\n\n\nRead more\n\n\n\n\n\n\n\n\n\nLED lighting provides perfect growing conditions for Sunterra Greenhouse’s ripe-picked produce\n07/07/22\n\n\nRead more\n\n\n\n\n\n\n\n\n\nATCO explores heating homes with hydrogen to reduce emissions\n12/05/22\n\n\nRead more\n\n\n\n\n\n\n\n\n\nInnovative project refines low-grade oil and hatches “Big Ugly Battery”\n03/03/22\n\n\nRead more\n\n\n\n\n\n\n\n\n\nCHP Solutions leads the way in co-generative power transition\n09/02/22\n\n\nRead more\n\n\n\n\n\n\n\n\n\nCapital Power to convert carbon into a versatile, highly-valuable product\n03/02/22\n\n\nRead more\n\n\n\n\n\n\n\n\n\nCeres Solutions turns brewery waste into gourmet mushrooms and enhanced cattle feed\n23/11/21\n\n\nRead more\n\n\n\n\n\n\n\n\n\nCP looks to hydrogen locomotives to lead decarbonization of freight transportation sector\n01/11/21\n\n\nRead more\n\n\n\n\n\n\n\n\n\nSYLVIS Environmental Services reclaims old mines to produce biomass feedstock\n31/08/21\n\n\nRead more\n\n\n\n\n\n\n\n\n\nSavings from new boiler help YWCA reinvest in core programs\n27/08/21\n\n\nRead more\n\n\n\n\n\n\n\n\n\nFrozen food packaging company cuts electricity consumption with energy efficient upgrades\n27/08/21\n\n\nRead more\n\n\n\n\n\n\n\n\n\nLafarge improves efficiency and cuts emissions with new lighting and upgraded motor drives\n27/08/21\n\n\nRead more\n\n\n\n\n\n\n\n\n\nSki resort upgrades chairlift to reduce emissions and lower operating costs\n27/08/21\n\n\nRead more\n\n\n\n\n\n\n\n\n\nThe Ice Cream Depot keeps desserts frozen with help from the sun\n27/08/21\n\n\nRead more\n\n\n\n\n\n\n\n\n\nERA invests $1.8 million in drone reforestation technology pilot project\n27/07/21\n\n\nRead more\n\n\n\n\n\n\n\n\n\nBlindman Brewing adopts carbon capture and reuse technology\n10/06/21\n\n\nRead more\n\n\n\n\n\n\n\n\n\nReducing cattle emissions up to 90 per cent through a feed additive\n10/06/21\n\n\nRead more\n\n\n\n\n\n\n\n\n\nModern Wellbore’s technology helps drill wells more economically and environmentally efficiently\n28/05/21\n\n\nRead more\n\n\n\n\n\n\n\n\n\nNew solar project helps supply power to Enbridge pipelines\n19/04/21\n\n\nRead more\n\n\n\n\n\n\n\n\n\nProvince’s first co-produced geothermal power project a made-in-Alberta solution\n19/04/21\n\n\nRead more\n\n\n\n\n\n\n\n\n\nGazoduq aims to cut pipeline emissions with new technology\n15/03/21\n\n\nRead more\n\n\n\n\n\n\n\n\n\nQuantiam bolsters business model to support technology\n15/03/21\n\n\nRead more\n\n\n\n\n\n\n\n\n\nKuva Systems: Making the invisible measurable\n19/01/21\n\n\nRead more\n\n\n\n\n\n\n\n\n\nIn Situ Oil Sands Investments Are Creating Alberta’s Energy Future\n07/01/21\n\n\nRead more\n\n\n\n\n\n\n\n\n\nEnergy efficiency helps Alberta sawmill stay on the cutting edge\n02/11/20\n\n\nRead more\n\n\n\n\n\n\n\n\n\nFort McMurray shopping mall saves big on power\n02/11/20\n\n\nRead more\n\n\n\n\n\n\n\n\n\nOrion Plastics gains competitive advantage through better energy management\n02/11/20\n\n\nRead more\n\n\n\n\n\n\n\n\n\nCarbon Upcycling uses the pollution of today to build tomorrow\n22/09/20\n\n\nRead more\n\n\n\n\n\n\n\n\n\nATCO project blends hydrogen with natural gas to reduce emissions\n27/07/20\n\n\nRead more\n\n\n\n\n\n\n\n\n\nNew peatland study outlines ways to protect valuable carbon sinks\n04/06/20\n\n\nRead more\n\n\n\n\n\n\n\n\n\nBeef without the burps: lowering methane emissions from cattle with new feed ingredient\n04/06/20\n\n\nRead more\n\n\n\n\n\n\n\n\n\nLethbridge Biogas providing value-added opportunity for agricultural production, processing\n04/06/20\n\n\nRead more\n\n\n\n\n\n\n\n\n\nLafarge’s low carbon fuels project to create jobs, reduce emissions, limit landfilling\n31/03/20\n\n\nRead more\n\n\n\n\n\n\n\n\n\nDarkVision goes downhole to improve integrity and performance of wells\n25/02/20\n\n\nRead more\n\n\n\n\n\n\n\n\n\nTitanium recovers valuable minerals from oil sands waste\n25/02/20\n\n\nRead more\n\n\n\n\n\n\n\n\n\nMangrove opens up $450 million opportunity\n14/01/20\n\n\nRead more\n\n\n\n\n\n\n\n\n\nCarbonCure creates cleaner concrete with new technology\n04/12/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\nInsight M’s methane emissions technology taking of globally\n08/11/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\nFirst-of-its-kind geothermal pilot to produce reliable baseload power\n08/11/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\nConditions for Success: Inspiring a Culture of Innovative Leadership\n10/10/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\nScaling Cleantech 2.0: Continuing a Globe Capital Conversation \n03/10/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\nScaling up: Going from the garage to global markets\n24/09/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\nDriving change is “not a single-threaded problem”\n23/09/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\nTesting facilities help advance carbon positive technologies\n22/09/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\nFraming a Carbon Positive Discussion\n16/09/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\nCarbon Creativity: Turning A Problem Into a Solution\n09/09/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\nCanadian technologies can help decarbonize emissions around the world\n05/08/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\nAlberta-Pacific is not just a pulp and paper company, it’s a pulp and power company\n21/06/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\nENMAX to test solar and battery storage at oil and gas plant\n21/06/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\nInventys to demonstrate carbon capture technology at Husky\n21/06/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\nBrooks Solar can now power 3,000 homes\n06/02/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\nQ&A with Steve MacDonald: CEO\n06/02/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\nQ&A with Mark Summers: Executive Director, Technology and Innovation\n06/02/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\nCNRL’S in pit extraction process targets eliminating tailings ponds, reducing GHGs\n06/02/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\nQ&A with Kathleen Sendall: Outgoing Board Chair\n06/02/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\nTechnology aims to help in-situ oil sands operations reduce GHG’s, operating costs\n06/02/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\nMEG Energy expands  eMVAPEX propane-injection project\n06/02/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\nClean seas technology seen as solution to new shipping regulations\n06/02/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\nQ&A with Elizabeth Shirt: Executive Director, Policy and Strategy\n06/02/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\nImperial Project could reduce emissions by 90 per cent\n06/02/19\n\n\nRead more\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n© 2024 Emissions Reduction Alberta (ERA)\n#2503, 10088 102 Avenue NW Edmonton, Alberta, T5J 2Z1#3120, 715 5 Avenue SW Calgary, Alberta, T2P 2X6\n\nERA receives its funding from the Government of Alberta through the Technology Innovation Emissions  Reduction (TIER) Fund.\n\nEmissions Reduction Alberta is a registered tradename of the Climate Change and Emissions Management (CCEMC) Corporation.\nPrivacy PolicyTerms of Use\nIn the spirit of reconciliation, we have the privilege of living, working, and investing on traditional territories, which include Treaty 6, Treaty 7, and Treaty 8 Nations; Metis Nations (Region 3 and 4); Inuit; and all others who live and care for these lands. We are dedicated to promoting a culture of collaboration and meaningful engagement.\n\n\nGeneral Inquiries\nEmail: info@eralberta.ca Phone: 780-498-2068\n\n\nStay in touch\nTwitter\nLinkedIn\nMail\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\nImpactProjectsFundingAbout\n\n\n\nEnergy Savings for BusinessProjectsBoard & GovernanceOur 15 Year History\nTechnology RoadmapStewardship UpdateAnnual ReportBusiness PlanResearch ReportsCalculating Emissions Reduction\n\n\nWorkshopsCarbon Copy PodcastTrusted Partners\nNewsFAQContact UsNewsletterCareers\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.eralberta.ca/projects/": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nProjects - Emissions Reduction Alberta\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImpactProjectsFundingAbout\n\n\n\n\n\n\n\n\nSearchSearch\n\n\n\nProjects\nWe are investing in a diverse portfolio of technologies that will reduce GHG emissions, and we’re helping innovators address barriers to commercialization.\nCanadian Pacific looks to hydrogen locomotives.\n\n\n\n\n\nClose\n\n\n\nOpen Data License\n\n\nName(Required)\n\n\nFirst\n\n\n\nLast\n\nEmail(Required)\n\nTerms of ServiceEmissions Reduction Alberta\nDISCLAIMER\nThis file contains information and data (Information) that Emissions Reduction Alberta (ERA) receives from the proponents of projects that ERA has funded. The disclosure is consistent with terms of the contribution agreements signed between ERA and its proponents.\nThe Information is subject to the ERA Open Data Licence. If you copy, modify, publish, translate, adapt, distribute, or otherwise use the Information in any way, you must include the following attribution statement:\nContains information from Emissions Reduction Alberta licensed under its ERA Open Data Licence.\nIn addition to the disclaimers in that licence, note that any greenhouse gas (GHG) emissions reduction data included in the Information is a forecasted value of what a project may achieve, and is estimated using standard calculation methods. These values do not demonstrate actual emissions reductions achieved, and should be interpreted with the appropriate level of uncertainty.\nERA may distribute or provide access to project reports written and published by proponents whose ‎projects received ERA funding. ‎\nERA does not audit, substantiate, or otherwise verify, and is not responsible or liable for, any ‎environmental claims, environmental performance metrics, or any representations, statements, or claims ‎regarding emissions or emissions reductions contained in any such report, or any assumptions or ‎methodologies underlying any such claims. To the extent any such report contains statements, ‎representations, warranties, or guarantees of a product’s, businesses, or business activity’s benefits for ‎protecting or restoring the environment or mitigating the environmental, social and ecological causes or ‎effects of climate change, those statements, representations, warranties, or guarantees are made by the ‎project report’s authors and not ERA.‎\nLICENCE TERMS\nEmissions Reduction Alberta – Open Data Licence\nERA makes Information available to you, and you are encouraged to use that Information, under this licence with only a few conditions.\nUsing Information under this licence\n\nYour access or use of any Information indicates your acceptance of the terms below.\nERA grants you a worldwide, royalty-free, perpetual, non-exclusive licence to use the Information, including for commercial purposes, subject to the terms below.\nThis licence’s terms are important. If you fail to comply with any of them, the rights granted to you under this licence will end automatically.\n\nAcceptable use\n\nYou may copy, modify, publish, translate, adapt, distribute, or otherwise use the Information in any medium, mode, or format for any lawful purpose.\n\nSource Attribution\n\nYou must acknowledge the source of the Information by including the following attribution statement:\nContains information and data from Emissions Reduction Alberta licensed under its ERA Open Data Licence.\n\n\nExemptions\n\nThis licence does not grant you any right to use:\n\npersonal information (as defined in Alberta’s Personal Information Protection Act);\nthird-party rights that ERA is not authorized to license;\nERA’s names, logos, or other trademarks;\nInformation subject to other intellectual property rights, including patents and trademarks.\n\n\n\nNon-endorsement\n\nThis licence does not grant you any right to use the Information in a way that suggests any official status or that ERA endorses you or your use of the Information. You must not attribute to ERA any results, information, or data derived from the use, interpretation, or analysis of the Information. If you must reference your use of the Information, include the following statement:\n\nAll analysis, inferences, opinions, and conclusions drawn in this [_________________] are those of the authors, and do not reflect ERA’s opinions, position, or policies.\n\n\nNo warranty\n\nERA licenses the Information “as is”, and ERA excludes all representations, warranties, obligations, and liabilities, whether express or implied, to the maximum extent permitted by law.\nERA is not liable for any errors or omissions in the Information, and will not under any circumstances be liable for any direct, indirect, special, incidental, consequential, or other loss, injury or damage caused by its use or otherwise arising in connection with this licence or the Information, even if specifically advised of the possibility of such loss, injury or damage.\n\nGoverning Law\n\nThis licence is governed by the laws of Alberta and the applicable laws of Canada. Legal proceedings related to this licence may only be brought in the Alberta courts.\n\nDefinitions\n\nIn this licence:\n\n“ERA”\nmeans Emissions Reduction Alberta [and its affiliates].\n“Information”\nmeans information resources that are expressly offered for use under this Licence’s terms or reference this licence.\n“You”\nmeans the natural or legal person, or body of persons corporate or incorporate, acquiring rights under this licence.\n\n\n\nVersioning\n\nThis is version 1.0 of the ERA Open Data Licence. ERA change this licence’s terms from time to time. Your use of the Information will be governed by the terms of the licence in force as of the date you accessed the Information.\n\n\n\n\n\nI agree to the Terms of Service\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClose\nAlberta’s Carbon Pricing System\nTechnology Innovation and Emissions Reduction Regulation\nThe Technology Innovation and Emissions Reduction Regulation (TIER) is Alberta’s industrial carbon pricing and emissions trading system. The regulation is designed to help industrial facilities invest in innovative approaches to reduce emissions using clean technology to ensure they can remain competitive in a global market. Compliance payments under this system are collected in the TIER fund and is the source of funding for ERA’s investments in emissions reduction technologies.\nRegulated Facilities and Exemption from Federal Requirements\nTIER Regulated facilities include those that emit 100,000 tonnes or more of carbon dioxide equivalent (tonnes of CO2e) per year or those that import more than 10,000 tonnes of hydrogen annually. Facilities that emit less than this may also opt in to the regulation. The minimum threshold for facilities that choose to opt in is 2,000 tonnes of CO2e or more.\nSince Alberta has an industrial carbon pricing system that meets federal requirements, facilities that are regulated under the TIER regulation can receive an exemption to the federal fuel charge under the Greenhouse Gas Pollution Pricing Act (GGPPA). The TIER system protects Alberta’s regulated facilities from the full costs of complying with the GGPPA, while achieving cost-effective emissions reductions.\nCompliance Obligations\nUnder the TIER system, facilities have a benchmark which establishes the amount of emissions that they are allowed to emit. If a facility emits more then what is permitted, the facility has an obligation to comply with the regulation. Compliance can be achieved in one of three ways:\n\nusing emission offset credits that are generated from projects using protocols in Alberta’s emissions offset system,\nsubmitting emissions performance credits, or\npurchasing credits by paying into the TIER Fund at the prescribed TIER Fund price which tracks the federal carbon price schedule.\n\nMore Information\nFor more information on Alberta’s TIER system, visit the Government of Alberta’s website on the Technology Innovation and Emissions Reduction Regulation. The government’s website contains a wealth of information to explain how benchmarks for regulated facilities are established, the reporting that facilities need to complete for compliance, the methodologies for quantifying emissions and how emissions are verified.\n\n\n\n\n\n\nClose\nWhat are emissions reductions for a project and how do we calculate them?\nProject emissions reductions are those emissions reductions that result from the ERA-funded project and are based on the actual units of equipment, technology, or processes implemented during the project time frame. Project emissions reductions may include both direct and indirect emissions reductions in Alberta. The project time frame includes the life of the funded project, including operation beyond the end of the contribution agreement period if the equipment, technology, or processes continue to operate.\nTo calculate emissions reduction for a project, a baseline emissions scenario must first be determined. The baseline scenario is the GHG emissions that would occur in the absence of the proposed project. The project emissions are the emissions after the project is implemented and for the duration of the project life. The difference between the baseline scenario and the project scenario (baseline emissions minus project emissions) is the emissions reduction. Emissions may be on-site, upstream, and downstream of the project site. As an example; a renewable power generation project that replaces an existing natural-gas-combined-cycle power plant has near-zero emissions and therefore the emissions reductions for the project would be equal to the emission generated from the natural-gas-combined-cycle power plant.\nWhere applicable, ERA follows GHG emission quantification methodologies, emission factors, and/or principles from the Government of Alberta’s carbon-pricing system, known as the Technology Innovation and Emissions Reduction system. This includes methodologies for GHG quantification protocols under the Alberta Emissions Offset System. All methodologies used to quantify emissions reduction for projects conform to the five accounting and reporting principles described under ISO 14064, namely: accuracy; completeness; consistency; relevance; and transparency.\n\n\n\n\n\n\nClose\nWhat are market emissions reductions and how do we calculate them?\nMarket emissions reductions are emissions reductions that result from the commercial adoption of the technology into the Alberta marketplace and are based on the market rollout plan and anticipated market adoption. Market emissions reductions typically occur after project completion as the project is deployed in the marketplace. These are accounted for up to 2050.  These emissions reductions may occur during the ERA-funded project period (e.g., within the start and end date as per the Contribution Agreement) if the technology is commercialized during the ERA-funded project period.\nMarket Emission Reductions (MER) are forecasted for each funded technology in which the technology is expected to result in emission reductions in the Alberta economy.\nThe GHG team utilizes the information provided by the proponents at the project proposal or completion stage to set up the forecast for each project in ERA’s GHG database.\nThe framework for forecasting MERs for each technology follows a simple two-step process:\n\nForecast the size of the market through 2050 in units or measure relevant to the market; for example, barrel of oil for the Crude Oil market, then\nApply the factors that will affect the commercialization of the technology in the market, including:\n\t\t\t\t\t\nMarket penetration limit: fraction of the market that will be affected by the technology\nCommercialization start and end dates\nSteady state start and end dates (the dates in which the technology will have reached full saturation of the market limit and the date in which the technology starts exiting the market because it is being superseded by another technology or is no longer relevant)\nEmission reduction factor; for example, tonnes of carbon dioxide equivalent reduction per barrel of crude produced.\n\n\n\n\n\n\n\n\n\nClose\nFunding Amount by Sector\nThese amounts represent the total of actual funds paid to projects that are now complete and funding commitments to projects that are active.\n\n\n\n\n\n\nClose\nProject Value by Sector\nThese amounts represent the total estimated cost of the projects that ERA is supporting.\n\n\n\n\n\nWhere does ERA get it’s funding from?\n\n\n\nKey statistics\n \n\n\nFilter project overview\nDownload data set\n\n\n\nSector\n\n\nPrimary Technology Area\n\n\nStage of Innovation\n\n\nType of Organization\n\n\nStatus\n\n\n\n\n\n\n\nMarket Emission Reductions are a prediction of the emissions benefits that may occur in a market and are represented at a portfolio level. These categories are independent of the project filtering fields and therefore the data does not respond to those selections. Users can select and deselect market categories using the chart legend.\n\n\n\n\n\n\n\n\nSort by\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\tBioenergy, biofuel and bioproduct\t\t\t\t\t\t\t\n\n\n\nCommercialization of Bio-based Sprayfoam\n1782815 ALBERTA LTD. /Spray Foam Co.\n\n\nProject type:\nR&D\n\n\nProject value:\n$240,000\t\t\t\t\t\t\t\n\n\nFunding amount:\n$200,000\n\n\nStatus:\nCompleted\n\n\nType of organization:\nSME\n\n\n\n\nRead more\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\tOil & Gas\t\t\t\t\t\t\t\n\n\n\nRadio Frequency XL (RF XL) Enhanced Oil Recovery\nAcceleware Ltd.\n\n\nProject type:\nDemonstration\n\n\nProject value:\n$24,500,000\t\t\t\t\t\t\t\n\n\nFunding amount:\n$5,000,000\n\n\nStatus:\nActive\n\n\nType of organization:\nSME\n\n\n\n\nRead more\n\n\n\n\n\n\n\n\n\n\nPilot Production of Electrodes for Energy Storage Systems on Industrial-scale Equipment via a Transformative Dry Process\nAdvEn Inc\n\n\nProject type:\nImplementation\n\n\nProject value:\n$5,640,000\t\t\t\t\t\t\t\n\n\nFunding amount:\n$2,000,000\n\n\nStatus:\nActive\n\n\nType of organization:\nSME\n\n\n\n\nRead more\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\tAgriculture\t\t\t\t\t\t\t\n\n\n\nTechnologies for Reducing Greenhouse Gas Emissions and Providing Offset Options for the Beef and Dairy Industries\nAgriculture and Agri-Food Canada\n\n\nProject type:\nR&D\n\n\nProject value:\n$2,760,000\t\t\t\t\t\t\t\n\n\nFunding amount:\n$1,377,523\n\n\nStatus:\nCompleted\n\n\nType of organization:\nResearch\n\n\n\n\nRead more\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\tAgriculture\t\t\t\t\t\t\t\n\n\n\nDemonstrating the impact of genomics-enhanced whole herd genetic management platform on reducing beef greenhouse gas emissions\nAgriculture and Agri-Food Canada\n\n\nProject type:\nImplementation\n\n\nProject value:\n$5,840,000\t\t\t\t\t\t\t\n\n\nFunding amount:\n$487,370\n\n\nStatus:\nActive\n\n\nType of organization:\nLarge\n\n\n\n\nRead more\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\tHeavy Industry\t\t\t\t\t\t\t\n\n\n\nNutrien Redwater Carbon Capture Study\nAgrium Canada Partnership\n\n\nProject type:\nImplementation\n\n\nProject value:\n$12,600,000\t\t\t\t\t\t\t\n\n\nFunding amount:\n$3,276,450\n\n\nStatus:\nActive\n\n\nType of organization:\nLarge\n\n\n\n\nRead more\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\tHeavy Industry\t\t\t\t\t\t\t\n\n\n\nNew Edmonton Blue Hydrogen Hub\nAir Products Canada Ltd.\n\n\nProject type:\nImplementation\n\n\nProject value:\n$1,614,000,000\t\t\t\t\t\t\t\n\n\nFunding amount:\n$15,000,000\n\n\nStatus:\nActive\n\n\nType of organization:\nLarge\n\n\n\n\nRead more\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\tLand and Nature Based Solutions\t\t\t\t\t\t\t\n\n\n\nBiodiversity Management and Climate Change Adaptation\nAlberta Biodiversity Monitoring Institute\n\n\nProject type:\nR&D\n\n\nProject value:\n$2,400,000\t\t\t\t\t\t\t\n\n\nFunding amount:\n$2,394,631\n\n\nStatus:\nCompleted\n\n\nType of organization:\nResearch\n\n\n\n\nRead more\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\tTransportation\t\t\t\t\t\t\t\n\n\n\nAlberta Zero Emissions Truck Electrification Collaboration (AZETEC)\nAlberta Motor Transport Association\n\n\nProject type:\nDemonstration\n\n\nProject value:\n$18,200,000\t\t\t\t\t\t\t\n\n\nFunding amount:\n$7,338,782\n\n\nStatus:\nActive\n\n\nType of organization:\nSME\n\n\n\n\nRead more\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\tForestry\t\t\t\t\t\t\t\n\n\n\nKraft Pulp Mill Flue Gas Energy Recovery Project\nAlberta-Pacific Forest Industries Inc.\n\n\nProject type:\nDemonstration\n\n\nProject value:\n$39,600,000\t\t\t\t\t\t\t\n\n\nFunding amount:\n$6,000,000\n\n\nStatus:\nCompleted\n\n\nType of organization:\nLarge\n\n\n\n\nRead more\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\tOil & Gas\t\t\t\t\t\t\t\n\n\n\nWhitecourt Energy Efficiency Project\nAlliance Pipeline (NR Green Limited Partnership)\n\n\nProject type:\nDemonstration\n\n\nProject value:\n$97,000,000\t\t\t\t\t\t\t\n\n\nFunding amount:\n$7,000,000\n\n\nStatus:\nCompleted\n\n\nType of organization:\nSME\n\n\n\n\nRead more\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\tElectricity\t\t\t\t\t\t\t\n\n\n\nWhitecourt Transmission Deferral Battery\nAltaLink Investment Limited Partnership\n\n\nProject type:\nDemonstration\n\n\nProject value:\n$26,800,000\t\t\t\t\t\t\t\n\n\nFunding amount:\n$10,000,000\n\n\nStatus:\nActive\n\n\nType of organization:\nLarge\n\n\n\n\nRead more\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\tElectricity\t\t\t\t\t\t\t\n\n\n\nTransmission BESS Project Development\nAltaLink Investment Limited Partnership\n\n\nProject type:\nImplementation\n\n\nProject value:\n$3,000,000\t\t\t\t\t\t\t\n\n\nFunding amount:\n$1,500,000\n\n\nStatus:\nActive\n\n\nType of organization:\nLarge\n\n\n\n\nRead more\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\tOil & Gas\t\t\t\t\t\t\t\n\n\n\nDeploying Autonomous Oil & Gas Production Operations with an Adaptive Controller\nAmbyint Inc.\n\n\nProject type:\nDemonstration\n\n\nProject value:\n$7,940,000\t\t\t\t\t\t\t\n\n\nFunding amount:\n$2,000,000\n\n\nStatus:\nCompleted\n\n\nType of organization:\nSME\n\n\n\n\nRead more\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\tOil & Gas\t\t\t\t\t\t\t\n\n\n\nAnax Power Turboexpander Project\nAnax Power\n\n\nProject type:\nDemonstration\n\n\nProject value:\n$5,240,000\t\t\t\t\t\t\t\n\n\nFunding amount:\n$2,388,607\n\n\nStatus:\nActive\n\n\nType of organization:\nSME\n\n\n\n\nRead more\n\n\n\n\n\n\n\n\n\n\nibex SAGD Steam and Solvent TRL 7 Field Trial\nArcher BD Inc. \n\n\nProject type:\nDemonstration\n\n\nProject value:\n$960,000\t\t\t\t\t\t\t\n\n\nFunding amount:\n$410,000\n\n\nStatus:\nContribution Agreement\n\n\n\n\nRead more\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\tHeavy Industry\t\t\t\t\t\t\t\n\n\n\nHUMASORB® -L for Removal of CO2, NOx GHGs, along with SOx and Trace Metals from Fossil Fuel Combustion Gases and Recycling of CO2 into a Value Generation\nHUMASORB® -CS, a Stable Multipurpose Water Filter\nARCTECH, Inc.\n\n\nProject type:\nDevelopment\n\n\nProject value:\n$649,000\t\t\t\t\t\t\t\n\n\nFunding amount:\n$423,256\n\n\nStatus:\nCompleted\n\n\nType of organization:\nSME\n\n\n\n\nRead more\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\tOil & Gas\t\t\t\t\t\t\t\n\n\n\nCorrosion inspection robot and advanced analytics software for industrial applications\nARIX Technologies Inc.\n\n\nProject type:\nDemonstration\n\n\nProject value:\n$6,110,000\t\t\t\t\t\t\t\n\n\nFunding amount:\n$3,000,000\n\n\nStatus:\nActive\n\n\nType of organization:\nSME\n\n\n\n\nRead more\n\n\n\n\n\n\n\n\n\n\nEvaluation of reduced enteric methane emissions in beef cattle using a novel vaccine at research farms in Alberta\nArkeaBio\n\n\nProject type:\nDemonstration\n\n\nProject value:\n$4,900,000\t\t\t\t\t\t\t\n\n\nFunding amount:\n$2,350,000\n\n\nStatus:\nContribution Agreement\n\n\n\n\nRead more\n\n\n\n\n\n\n\n\n\n\nData Management Solutions for High Frequency Methane Monitoring\nArolytics Incorporated\n\n\nProject type:\nDemonstration\n\n\nProject value:\n$2,530,000\t\t\t\t\t\t\t\n\n\nFunding amount:\n$1,000,000\n\n\nStatus:\nContribution Agreement\n\n\n\n\nRead more\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n© 2024 Emissions Reduction Alberta (ERA)\n#2503, 10088 102 Avenue NW Edmonton, Alberta, T5J 2Z1#3120, 715 5 Avenue SW Calgary, Alberta, T2P 2X6\n\nERA receives its funding from the Government of Alberta through the Technology Innovation Emissions  Reduction (TIER) Fund.\n\nEmissions Reduction Alberta is a registered tradename of the Climate Change and Emissions Management (CCEMC) Corporation.\nPrivacy PolicyTerms of Use\nIn the spirit of reconciliation, we have the privilege of living, working, and investing on traditional territories, which include Treaty 6, Treaty 7, and Treaty 8 Nations; Metis Nations (Region 3 and 4); Inuit; and all others who live and care for these lands. We are dedicated to promoting a culture of collaboration and meaningful engagement.\n\n\nGeneral Inquiries\nEmail: info@eralberta.ca Phone: 780-498-2068\n\n\nStay in touch\nTwitter\nLinkedIn\nMail\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\nImpactProjectsFundingAbout\n\n\n\nEnergy Savings for BusinessProjectsBoard & GovernanceOur 15 Year History\nTechnology RoadmapStewardship UpdateAnnual ReportBusiness PlanResearch ReportsCalculating Emissions Reduction\n\n\nWorkshopsCarbon Copy PodcastTrusted Partners\nNewsFAQContact UsNewsletterCareers\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.eralberta.ca/apply-for-funding/": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFunding - Emissions Reduction Alberta\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImpactProjectsFundingAbout\n\n\n\n\n\n\n\n\nSearchSearch\n\n\n\n\nFunding\nERA has two funding streams to help Alberta prosper while reducing emissions. We fund innovative technology projects, as well as infrastructure upgrades for our businesses. Learn more about the stream that suits your project below. \n\n\n\n\n\n\n\nTECHNOLOGY FUNDING\nERA is investing in a diverse portfolio of transformative, sustainable technologies that reduce GHG emissions and position Alberta for success.\n\n\n\n\t\t\t\t\t\t\t\t\t\t\tLearn More\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\nENERGY SAVINGS FOR BUSINESS\nLearn about ERA’s new Energy Savings for Business Program—a funding opportunity to support small- and medium-scale industrial and commercial businesses.\n\n\n\n\t\t\t\t\t\t\t\t\t\t\tLearn More\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n© 2024 Emissions Reduction Alberta (ERA)\n#2503, 10088 102 Avenue NW Edmonton, Alberta, T5J 2Z1#3120, 715 5 Avenue SW Calgary, Alberta, T2P 2X6\n\nERA receives its funding from the Government of Alberta through the Technology Innovation Emissions  Reduction (TIER) Fund.\n\nEmissions Reduction Alberta is a registered tradename of the Climate Change and Emissions Management (CCEMC) Corporation.\nPrivacy PolicyTerms of Use\nIn the spirit of reconciliation, we have the privilege of living, working, and investing on traditional territories, which include Treaty 6, Treaty 7, and Treaty 8 Nations; Metis Nations (Region 3 and 4); Inuit; and all others who live and care for these lands. We are dedicated to promoting a culture of collaboration and meaningful engagement.\n\n\nGeneral Inquiries\nEmail: info@eralberta.ca Phone: 780-498-2068\n\n\nStay in touch\nTwitter\nLinkedIn\nMail\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\nImpactProjectsFundingAbout\n\n\n\nEnergy Savings for BusinessProjectsBoard & GovernanceOur 15 Year History\nTechnology RoadmapStewardship UpdateAnnual ReportBusiness PlanResearch ReportsCalculating Emissions Reduction\n\n\nWorkshopsCarbon Copy PodcastTrusted Partners\nNewsFAQContact UsNewsletterCareers\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.eralberta.ca/about-era/": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbout ERA - Emissions Reduction Alberta\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImpactProjectsFundingAbout\n\n\n\n\n\n\n\n\nSearchSearch\n\n\n\n\n\nAbout ERA\nERA was created in 2009 to help deliver on the province’s environmental and economic goals. ERA takes action on climate change and supports economic growth by investing in the pilot, demonstration and deployment of clean technology solutions that reduce GHGs, lower costs, attract investment, and create jobs in Alberta.\nLearn more about Flash Forest’s drone reforestation technology.\n\n\n\n\nERA receives its funding from the Government of Alberta through the Technology Innovation Emissions Reduction (TIER) Fund.\n\n\n\n\n\n\n\n\n\nHome > About ERA\n\n\nMandate & Vision\nMandate\nReduce GHG emissions and grow Alberta’s economy by accelerating the development and adoption of innovative technology solutions.\nVision\nAlberta has competitive industries that deliver sustainable environmental outcomes, attract investment, and are building a diversified, lower carbon economy.\nValue Proposition\nOur investments help innovators develop and demonstrate GHG-reducing technologies.These technologies will lower costs, improve competitiveness and accelerate Alberta’s transformation to a low carbon economy.\n\n\nStrategic Priorities\nTo achieve ERA’s vision and mandate, we will:\nAccelerate Technology\nInvest in GHG-reducing technologies that help Alberta grow existing industries and create new ones.\nDrive Commercialization\nConvene the resources required to accelerate the commercialization and wide spread adoption of technology solutions that lead to economic growth and GHG reductions in Alberta.\nMaximize Impact\nMaximize our impact through leveraged funding, communications, operational excellence, and by measuring and reporting on key performance metrics.\n\n\n\n\n\n\n\nExecutive Team\n\n\n \n\n\n\t\t\t\tJustin Riemer\t\t\t\nChief Executive Officer\n\n\nAn Albertan through and through, Justin Riemer has dedicated his career to strengthening the province he loves. Now the Chief Executive Officer of Emissions Reduction Alberta (ERA), Justin leads the team dedicated to advancing innovations that are reducing Alberta’s greenhouse gas emissions and diversifying its economy. He has earned a reputation for skillfully navigating Canada’s innovation system, building relationships inside and outside of Alberta, and developing a strong network in support of innovation and economic development.\nFor more than 25 years, he has achieved results in regional economic development, industry expansion, investment attraction, and innovation. Before joining ERA, he led the Alberta Region of Prairies Economic Development Canada in the federal government to support economic development across the province. Prior to that, he held several senior positions focused on innovation and investment attraction at the Government of Alberta and briefly at Alberta Health Services. Justin graduated from the University of Alberta with a Bachelor of Arts (Honours) in Political Science and went on to earn a Master’s Degree in International Affairs from Carleton University. Justin is happily married, has two grown boys and a daughter in law. He is a leader. A connector. A changemaker.\n\n\n\n\n\n\n \n\n\n\t\t\t\tHeather Stephens\t\t\t\nChief Operating Officer\nHeather Stephens is ERA’s Chief Operating Officer. Heather has worked with ERA since inception and has played a key role in operating and growing the organization over the past 12 years. In her current role, Heather leads teams responsible for finance, project portfolio management, information technology, contract management, governance, and Human Resources. As a Chartered Professional Accountant, Heather brings her extensive background in audit and financial accounting with not-for-profit organizations, Government of Alberta agencies, as well as various private and public Canadian and International companies. Prior to joining ERA directly, Heather spent 20 years with the multi-national accounting firm PricewaterhouseCoopers in both the Edmonton and London, UK offices, the last nine of which were primarily dedicated to helping establish and operate ERA (formerly Climate Change and Emissions Management Corporation). Heather graduated from the University of Alberta with Bachelor of Science and Bachelor of Commerce degrees.\n\n\n\n\n \n\n\n\t\t\t\tChristophe Owttrim\t\t\t\nExecutive Director, Technology and Innovation\nChris Owttrim is the Executive Director of Technology and Innovation for Emissions Reduction Alberta (ERA). He oversees ERA’s strategic direction in technology investments, spearheads competitive funding calls, and provides thought leadership on clean technology garnered from ERA’s investments. Chris has spent the last seven years in a variety of roles with Alberta Innovates and ERA, most recently serving as ERA’s Technology Investment Lead.\nChris is a clean technology and green energy specialist with experience supporting research, development, and commercialization projects for emerging technologies as well as researching, modelling, and analyzing energy systems and decarbonization pathways. He is highly passionate about the intersection of climate, energy, economics, and policy. Chris holds a bachelor’s and master’s degree in mechanical engineering from the University of Alberta.\n \n\n\n\n\n\nEDI Statement\nAchieving Alberta’s environmental, economic, and social sustainability goals is complex, requiring a broad set of expertise and range of perspectives. Integrating equity, diversity, and inclusion principles is important to ensuring ERA remains a strategically and operationally effective organization.\nEquity – ERA will endeavour to ensure equity in access to funding opportunities and in attraction, development and retention of ERA staff.\nDiversity – ERA will incorporate diverse perspectives and experiences into its decision-making processes to advance innovative technologies and solutions.Inclusion – ERA will engage internal staff, service providers, and external stakeholders in a manner that allows them to fully contribute to achieving ERA’s objectives.\n\n\n\n\n\n\n\n\n\n© 2024 Emissions Reduction Alberta (ERA)\n#2503, 10088 102 Avenue NW Edmonton, Alberta, T5J 2Z1#3120, 715 5 Avenue SW Calgary, Alberta, T2P 2X6\n\nERA receives its funding from the Government of Alberta through the Technology Innovation Emissions  Reduction (TIER) Fund.\n\nEmissions Reduction Alberta is a registered tradename of the Climate Change and Emissions Management (CCEMC) Corporation.\nPrivacy PolicyTerms of Use\nIn the spirit of reconciliation, we have the privilege of living, working, and investing on traditional territories, which include Treaty 6, Treaty 7, and Treaty 8 Nations; Metis Nations (Region 3 and 4); Inuit; and all others who live and care for these lands. We are dedicated to promoting a culture of collaboration and meaningful engagement.\n\n\nGeneral Inquiries\nEmail: info@eralberta.ca Phone: 780-498-2068\n\n\nStay in touch\nTwitter\nLinkedIn\nMail\n\n\n\n\n\n\n\nSearch\n\n\n\n\n\n\n\n\n\n\nSearch\n\n\n\nImpactProjectsFundingAbout\n\n\n\nEnergy Savings for BusinessProjectsBoard & GovernanceOur 15 Year History\nTechnology RoadmapStewardship UpdateAnnual ReportBusiness PlanResearch ReportsCalculating Emissions Reduction\n\n\nWorkshopsCarbon Copy PodcastTrusted Partners\nNewsFAQContact UsNewsletterCareers\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}]}