{"text": [{"https://evercloak.com": "\n\n\n\n\nEvercloak\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkip to content\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\nTechnology\nProducts\nAboutExpand\n\n\nCompany\nCareers\n\n\nContact\nNews\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nToggle Menu\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNanofilms • graphene • tech\nTransforming today’s technology with tomorrow’s advanced materials\nWe’re creating advanced material manufacturing processes that can solve some of the world’s biggest environmental issues.\nOur ultra-thin nanofilms can curb greenhouse gas emissions by radically reducing the energy required for commercial and residential air conditioning and dehumidification systems. They can transform seawater into drinking water in drought-prone areas. They can improve batteries and solar cells, making renewable energy more viable. They can even help stop the spread of COVID-19.\nAnd thanks to our patented technology, we can manufacture large sheets of these nanofilms efficiently and affordably, positioning us at the forefront of cleantech and climate tech innovation.\nOur Technology\n\n\n\n\n\n\n\n\n\nBuilding the Future\nMeet Our Team\nEvercloak is building a strong team of talented individuals who are passionate about innovation, technology, and driving a positive impact on the world.\nTeam\n\n\n\n\nHOT OFF THE PRESS\nRecent Updates\nIntroducing Helen Papachronis: Evercloak’s new Chief Operating OfficerNovember 7, 2023\nCall for partnerships: Join Evercloak in forging a new Cleantech futureOctober 1, 2023\nIntroducing Matt Heuft: Evercloak’s new VP of Business DevelopmentDecember 3, 2022\n\n\n\n\nGrowing Together\nPartners\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInvestors\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDon’t Be Shy\nInterested In What We’re Building? Contact Us!\nI’m Ready\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\nTechnology\nProducts\nCompany\nContact\nCareers\nNews\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLinkedin\nTwitter\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n© 2024 Evercloak\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\nTechnology\nProducts\nAboutExpand child menuExpand\n\n\nCompany\nCareers\n\n\nContact\nNews\n \n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.evercloak.com/technology/": "\n\n\n\n\nTechnology – Evercloak\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkip to content\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\nTechnology\nProducts\nAboutExpand\n\n\nCompany\nCareers\n\n\nContact\nNews\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nToggle Menu\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTechnology\n\n\n\n\n\n\n\n\nGame Changing\nPatented & Energy Efficient\nThanks to our thin-film, game-changing manufacturing production technologies, Evercloak can manufacture large area, low-cost, high-performance nanocoatings, ranging from single atomic layers to hundreds of nanometers in thickness.\nOur roll-to-roll coating process requires minimal energy and produces minimal waste, keeping costs low. It’s also very flexible. Evercloak can produce films using a variety of materials and “inks,” including graphene oxide, graphene, carbon nanotubes, hexagonal boron nitride, and other 2D nanomaterials. \nAs a result, Evercloak can engineer high-performance films for a wide variety of applications, from dehumidifying membranes to coatings that kill the COVID-19 virus.\n\n\n\n\n\n\nBreakthrough\nApplications\n\n\nControlling humidity effectively and economically\nTraditional dehumidifiers waste a lot of electricity to cool air until the water vapor condenses out. Evercloak takes a far more energy-efficient approach.\nEvercloak’s membrane creates perfect humidity levels for indoor comfort and for industrial processes at a fraction of the cost of conventional systems.\nWe’ve designed our membrane to be highly selective, letting water molecules pass through while keeping out the other components of air. Because the membrane is so thin, drawing water vapor through the nanopores takes very little energy. That keeps operating costs impressively low.\n\n\n\n\n\n\n\n\n\n\nMaking air conditioning radically more efficient\nTo create a cool environment, A/C systems don’t just have to lower the temperature of the air. They also have to remove water vapor, because water holds a lot of heat. Conventional units do that by cooling the vapor until it condenses — a process that requires a lot of energy.\nEvercloak offers a better solution. We start by extracting water vapor using our high-performance dehumidification membrane. Then, we use conventional vapor compression to cool the air that remains. Because that air is dry, it requires far less energy.\nEvercloak’s disruptive membrane technology cuts A/C energy requirements in half, making it a less expensive and greener way to cool commercial and residential buildings. And that’s going to become ever-more important as global warming, urbanization, and rising incomes in developing countries drive greater demand for air conditioning.\n\n\n\n\nEmerging Applications\nEvercloak’s future growth markets also include antiviral coatings, fuel cells, and battery separators, and membranes for gas dehydration.\n\n\n\n\n\n\n\n\n\nAwards & Recognition\n\n\nWomen in Cleantech Finalist\n\n\nNRCan Breakthrough Energy Solutions Winner\n\n\nIgnite Pitch Competition Winner\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\nTechnology\nProducts\nCompany\nContact\nCareers\nNews\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLinkedin\nTwitter\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n© 2024 Evercloak\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\nTechnology\nProducts\nAboutExpand child menuExpand\n\n\nCompany\nCareers\n\n\nContact\nNews\n \n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.evercloak.com/products/": "\n\n\n\n\nProducts – Evercloak\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkip to content\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\nTechnology\nProducts\nAboutExpand\n\n\nCompany\nCareers\n\n\nContact\nNews\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nToggle Menu\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nProducts\n\n\n\n\n\nAvailable\nGraphene Oxide Composite Membranes\n\n\nOur custom graphene oxide composite membranes have superior water vapor permeance, have tunable performance, and are cost-competitive.\nEvaluation samples for research and development are currently available for purchase as we scale to offer commercial membrane production volumes.\nSample sizes include:\n\n3” x 3”\n6” x 6”\n10” x 10”\n\n\n\n\n\n\nQuotes and Orders\nTo learn more about our membrane products or to purchase a sample, contact us by completing the contact information below.\n\n\n\n\n\n\n\n\nGame Changing\nWhy Graphene Oxide Membranes\n\nHighest demonstrated water vapor permeance – less material needed, smaller capex\nNegligible swelling upon exposure to water or organics – easier manufacturing\nStable to harsh chemicals like chlorine – easier cleaning if needed in water applications\nNot fluorinated therefore no release of PFAs\nStudies have shown them to be fouling resistant\n\n\n\n\n\n\nBreakthrough\nApplications\nApplication areas include humidification, dehumidification, pervaporation, and gas dehydration among many others.\n\n\nVapor-vapor phase separations\n\nAir dehumidifiers*\nEnergy recovery ventilators (ERVs)*\nFuel cell humidifiers*\nGas dehydration (e.g., hydrogen, Co2, natural gas*)\nTritiated water recovery*\nAir dehumidification for more energy efficient air conditioning\n\nVapor-liquid phase separations\n\nEvaporative cooling*\nHumidifiers\nSolvent dehydration\n\n*Preliminary demonstration completed\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\nTechnology\nProducts\nCompany\nContact\nCareers\nNews\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLinkedin\nTwitter\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n© 2024 Evercloak\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\nTechnology\nProducts\nAboutExpand child menuExpand\n\n\nCompany\nCareers\n\n\nContact\nNews\n \n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.evercloak.com/company/": "\n\n\n\n\nCompany – Evercloak\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkip to content\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\nTechnology\nProducts\nAboutExpand\n\n\nCompany\nCareers\n\n\nContact\nNews\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nToggle Menu\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCompany\n\n\n\n\n\n\nWho are we?\n\n\nEvercloak is an advanced material innovation spin-out company from the University of Waterloo, Ontario. Evercloak is commercializing a manufacturing platform for producing continuous, large-area nano-films. These films are increasingly used for a wide range of applications such as energy storage, smart packaging, electronic devices, corrosion inhibitors, and membranes. \nEvercloak’s initial focus is on manufacturing graphene-based membranes for dehumidification to significantly reduce the energy use and associated greenhouse gas-related with building cooling.\nEvercloak is a winner of the NRCan Breakthrough Energy Solutions Canada program, which includes seed funding to accelerate technology development in this area.\n\n\nVisionIntegrating graphene breakthroughs for a healthier, sustainable, and more comfortable world\nMissionTransforming today’s technology with tomorrow’s advanced materials\n\n\n\n\n\n\nBuilding a Brighter Future\nMeet Our Team\n\n\nEvelyn Allen, P.Eng., M.Eng.CEO & Co-founderPioneer in the cleantech space, leading engineering projects, growing multi-million dollar technology innovation platforms, and building corporate strategic partners.\n\n\nTed Mao, Ph.D.CTOExecutive experience driving technology development and commercialization. Previously CTO & VP, Research and Development at Trojan Technologies, part of Danaher, S&P 100.\n\n\n\n\nMatt Heuft, Ph.D.Vice President, Business DevelopmentExperienced leader passionate about the commercialization of technology. Delivers results by leveraging his strong business and technical background.\n\n\nMichael Pope, Ph.D.Scientific Advisor & Co-founderExpert in 2D nanomaterials, leadership in research and development at the University of Waterloo, and product development at Vorbeck Materials.\n\n\n\n\nMark Weigel, CPA, CACFOOver 25 years of experience in finance and senior management with extensive experience in manufacturing, including automotive, consumer packaged goods, and hi-tech, but also non-manufacturing including distribution, and health care.\n\n\n\n\n\n\nMeet Our Advisors\n\n\nAshish Kulkarni, Ph.D.Former Chief Innovation Offer at GAF, Chief Technology & Innovation Officer at Celanese, VP of Global Engineering at Carrier, VP, Global Engineering American Standard, and GE Plastics.\n\n\nTrent Ogilvie, ICD.DFormer President of ROCKWOOL North America, growing the business from 60 to over 1000 people and revenue up to $500M.\n\n\n\n\nSteve Hoover, Ph.D.Former CTO & SVP at Xerox and former CEO of the Palo Alto Research Center (Parc) with roles in product development and research.\n\n\nWayne Maddever, Ph.D.Bioindustrial Innovation Canada\n\n\n\n\n\n\n\n\nLet’s Do It Together\nLooking To Join A Great Team?\nI’m Ready\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\nTechnology\nProducts\nCompany\nContact\nCareers\nNews\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLinkedin\nTwitter\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n© 2024 Evercloak\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\nTechnology\nProducts\nAboutExpand child menuExpand\n\n\nCompany\nCareers\n\n\nContact\nNews\n \n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.evercloak.com/careers/": "\n\n\n\n\nCareers – Evercloak\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkip to content\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\nTechnology\nProducts\nAboutExpand\n\n\nCompany\nCareers\n\n\nContact\nNews\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nToggle Menu\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCareers\n\n\n\n\n\n\nJoin Us!\nEvercloak is an award-winning cleantech start-up based in Kitchener, Ontario. Join us on our mission to transform today’s technology with tomorrow’s advanced materials to address some of the world’s biggest environmental challenges. \nEvercloak is an Equal Opportunity Employer. We value the strength of our unique team, which benefits from and welcomes a diverse and inclusive workforce and working environment.\nWe’re always looking for talented people to join our team. If you’re passionate about making a difference, working with smart people in a fast-paced environment (while having fun!), apply to one of our open positions below. If you don’t see an opening, send us your resume at [email protected] and let us know why you are a great fit.\n\n\n\n\nThe Future IS BRight\nOpportunities\nNo posts\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\nTechnology\nProducts\nCompany\nContact\nCareers\nNews\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLinkedin\nTwitter\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n© 2024 Evercloak\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome\nTechnology\nProducts\nAboutExpand child menuExpand\n\n\nCompany\nCareers\n\n\nContact\nNews\n \n\n\n\n\n\n\n\n\n\n\n\n"}]}