{"text": [{"http://www.founderful.com": "FounderfulFounderful FamilyWhat we doMeet the teamFounderful CampusJoin usWhat's newFounderful FamilyWhat we doMeet the teamFounderful CampusJoin usWhat's newFirst. Fast. And  founder-friendly.We're joining forces with Switzerland's finest founders, helping them start, scale and sell market-leading companies.What we doAbout usWelcome to Founderful; make yourself at home. First up, some introductions. We're a venture capital firm based in Switzerland. We've been founders ourselves, and our experiences shape the way we invest. We lead with an understanding of founders, offering companionship and support as the first investor.00Investments00People at FFLJobs created0Founderswe've backedOfferingsInvesting to the fullest.Leading your first round.We back founder teams as their lead investor in their first financing round; first, fast, and founder-friendly. We have the courage to invest early, when it matters the most, giving our founders the support they need to get started and convince people of their big ambitions.Experience, empathy and expert support.Take the next step with those who've been in your shoes. Whether it's strategic or operational, our team - built from experienced entrepreneurs and operators in finance, legal, people and culture, marketing, and branding - is here to answer all your questions and more.An entire network invested in your success.Get access to our community of investors, made up of the top entrepreneurs from the Swiss and wider European ecosystem. This includes the founders of Duolingo, Climeworks, Scandit, Delivery Hero, Proton, and many other category-defining technology companies.PortfolioWe've backed over 50 startups and more than 120 founders, including companies such as Wingtra, DePoly, Ethon AI, Archlet, Corintis and Oxyle. We love seeing them grow, and together, we've shifted the world's focus towards the Swiss tech startup ecosystem.View portfolioTestimonialsFounderful FamilyWhat we doMeet the teamFounderful CampusJoin usWhat's newImprintPrivacy PolicyLinkedInCrunchbaseZurichFounderful AGBadenerstrasse 608004 ZurichSwitzerlandLuxembourgFounderful Sàrl5 Avenue Gaston Diderich1420 LuxembourgLuxembourg"}]}