{"text": [{"https://geopura.com": "     GeoPura: Renewable Energy Solutions, Green Hydrogen, Green H2            Our serviceEV charging & transportConstructionFilm & TV productionOutdoor eventsBespoke solutionsHydrogen productionOur technologyHydrogen fuelsEnergy generationHydrogen Power UnitCase studiesNews and viewsBlogPress releasesHydrogen for Power Generation CPDAbout usAbout usFAQsCareersContact  Call +44 1509 882 340 100% renewable energy without limits GeoPura has a totally zero-emissions answer to how we’re going to generate, store and distribute the vast amount of energy required to decarbonise our global economies. Clean fuels. Green fuels. We believe that renewable energy is the future. Find out more Renewable off-grid energy generationRenewable Energy Solutions from GeoPuraWith experience in providing zero-emissions power to a wide range of industries – from construction, to film and TV production, to outdoor events – GeoPura harnesses hydrogen technology to generate and distribute the vast amount of energy required to decarbonise our global economies.https://youtube.com/watch?v=_KjXiyD15xAVideo can’t be loaded because JavaScript is disabled: GeoPura | Zero Emission HPUs In Production in Newcastle Upon Tyne (https://youtube.com/watch?v=_KjXiyD15xA)   EV charging & transport Read more    Construction Read more    Film & TV production Read more    Hydrogen production Read more    Outdoor events Read more    Bespoke Read more Renewable off-grid energy generationHow it worksThe GeoPura solution uses renewable energy, normally solar PV or wind, to create hydrogen and hydrogen based zero emission fuels. This fuel is then transported to locations where a local generator converts it to electrical power. From start to finish the process is clean and carbon free – the only by-product is pure water.The ProcessStep 1Step 2Step 3Step 4Step 5Step 6 1. Renewable energy generation 2. Water electrolysis to produce green hydrogen 3. Store renewable energy as a hydrogen based fuel 4. Transport hydrogen fuel to where it is needed 5. Hydrogen Power Unit uses hydrogen fuel to produce zero-emissions electricity 6. Zero emissions power for limitless applications   GeoPura in actionLatitude Festival and GeoPura Partnership Brings Hydrogen Power to This Year’s Festival Grounds GeoPura partnered with Latitude Festival 2024, to introduce an innovative solution to power the event more sustainably. This year, GeoPura’s Hydrogen Power Units (HPUs) replaced HVO biofuel generators, providing zero-emission electricity to part of the festival’s village area including medical / welfare, merchandise stand, VIP camping, and the festival’s recycling and waste sorting hub.  Hydrogen: […] Discover moreRenewable off-grid energy generationWhy green hydrogen?As the world looks for emission-free alternatives to replace our reliance on fossil fuels; green, renewable hydrogen is the fuel of the future. It is estimated that in the EU alone we will invest over €180 billion by 2050 to roll out hydrogen power.To deliver our net-zero commitments, a carbon-free future needs to be fuelled with renewable energy, way beyond the capabilities of any electricity distribution network. GeoPura has found a way to store and transport renewable energy as a fuel so that it’s available when and where you need it. Renewable off-grid energy generationThe opportunity for renewable energy producers Extract more valueInstead of being forced to export at a low return or curtail generation, hydrogen production allows a local, higher value use for your renewable electricity. Expand your operationDon’t be limited by your current grid connection. Your operation can expand to produce green hydrogen. Renewable energy storageGreen hydrogen is the answer to storing renewable energy for use at a later date. About GeoPuraGeoPura was founded to help source enough clean energy to electrify our global economy and navigate the logistical issues of getting this energy to where it is needed.The GeoPura solution uses renewable energy, normally solar PV or wind, to create hydrogen and hydrogen based zero emission fuels. This fuel is then transported to locations where a local generator converts it to electrical power. From start to finish the process is clean and carbon free – the only by-product is pure water.GeoPura In Action    Latitude Festival and GeoPura Partnership Brings Hydrogen Power to This Year’s Festival Grounds     World First: Hydrogen Powered Touch Rugby World Cup    Isle of Wight Festival 2024: Pioneering Sustainable Power Solutions with Hydrogen Generators Latest news    ESB launches new hydrogen power demonstration to showcase first deployment of hydrogen to electricity in Ireland      Introducing the HPU2: More Power, Less Space, Lower Weight, Lower Cost!     Empowering Electric Vehicle Adoption: GeoPura HPU supports the launch of the new Cadillac Lyriq in France    GeoPura closes £56 million investment round with backing from UK Infrastructure Bank to accelerate UK’s green hydrogen expansion>Speak to us todayOur team is here to discuss your clean energy generation requirements or your renewable energy investments Get in touchThe solution for renewable green\n energy off–grid\n generationOur pagesHomeOur serviceOur technologyCase studiesNews and viewsAbout usContact usContact usinfo@geopura.com+44 (0)1509 882 340C A Parsons Works Shields Road Newcastle Upon Tyne NE6 2YL United KingdomFollow us          © Copyright 2024 GeoPura, Ltd. — All rights\n reserved. Privacy     Website design and\n development by Atomic                     "}, {"https://www.geopura.com/our-service/": "     Our service - GeoPura            Our serviceEV charging & transportConstructionFilm & TV productionOutdoor eventsBespoke solutionsHydrogen productionOur technologyHydrogen fuelsEnergy generationHydrogen Power UnitCase studiesNews and viewsBlogPress releasesHydrogen for Power Generation CPDAbout usAbout usFAQsCareersContact  Call +44 1509 882 340 Our service With experience in providing zero-emissions power to a wide range of industries – from construction, to film and TV production, to outdoor events – GeoPura harnesses hydrogen technology to generate and distribute the vast amount of energy required to decarbonise our global economies. Get in touch See in action Renewable off-grid energy generationSolutions from GeoPura   EV charging & transport Read more    Construction Read more    Film & TV production Read more    Hydrogen production Read more    Outdoor events Read more    Bespoke Read more Renewable off-grid energy generationHow it worksThe GeoPura solution uses renewable energy, normally solar PV or wind, to create hydrogen and hydrogen based zero emission fuels. This fuel is then transported to locations where a local generator converts it to electrical power. From start to finish the process is clean and carbon free – the only by-product is pure water.The ProcessStep 1Step 2Step 3Step 4Step 5Step 6 1. Renewable energy generation 2. Water electrolysis to produce green hydrogen 3. Store renewable energy as a hydrogen based fuel 4. Transport hydrogen fuel to where it is needed 5. Hydrogen Power Unit uses hydrogen fuel to produce zero-emissions electricity 6. Zero emissions power for limitless applicationsRenewable off-grid energy generationWhy green hydrogen?As the world looks for emission-free alternatives to replace our reliance on fossil fuels; green, renewable hydrogen is the fuel of the future. It is estimated that in the EU alone we will invest over €180 billion by 2050 to roll out hydrogen power.To deliver our net-zero commitments, a carbon-free future needs to be fuelled with renewable energy, way beyond the capabilities of any electricity distribution network. GeoPura has found a way to store and transport renewable energy as a fuel so that it’s available when and where you need it.  About GeoPuraGeoPura was founded to help source enough clean energy to electrify our global economy and navigate the logistical issues of getting this energy to where it is needed.The GeoPura solution uses renewable energy, normally solar PV or wind, to create hydrogen and hydrogen based zero emission fuels. This fuel is then transported to locations where a local generator converts it to electrical power. From start to finish the process is clean and carbon free – the only by-product is pure water.>Speak to us todayOur team is here to discuss your clean energy generation requirements or your renewable energy investments Get in touchThe solution for renewable green\n energy off–grid\n generationOur pagesHomeOur serviceOur technologyCase studiesNews and viewsAbout usContact usContact usinfo@geopura.com+44 (0)1509 882 340C A Parsons Works Shields Road Newcastle Upon Tyne NE6 2YL United KingdomFollow us          © Copyright 2024 GeoPura, Ltd. — All rights\n reserved. Privacy     Website design and\n development by Atomic                     "}, {"https://www.geopura.com/our-service/ev-charging-transport/": "     EV Charging Solutions, Renewable & Electric Vehicle Charging | GeoPura            Our serviceEV charging & transportConstructionFilm & TV productionOutdoor eventsBespoke solutionsHydrogen productionOur technologyHydrogen fuelsEnergy generationHydrogen Power UnitCase studiesNews and viewsBlogPress releasesHydrogen for Power Generation CPDAbout usAbout usFAQsCareersContact  Call +44 1509 882 340 EV charging & transport With the numbers of electric and hydrogen-powered vehicles on our roads rapidly increasing and our grid under growing pressure; fully redundant, off-grid charging solutions are more critical than ever to support our grid and provide the vast amounts of power needed to sustain the future of EVs. Get in touch See in action  EV charging & transportThe challengeThe electric car market is growing rapidly, with more than 215,000 pure-electric cars on UK roads at the end of February 2021, and over 455,000 plug-in models when including plug-in hybrids (PHEVs). The market for mainstream hydrogen fuel cell vehicles is also expanding, with leading manufacturer Hyundai planning to roll out around 500,000 of these vehicles per year by 2030.These vehicles will all need refuelling. The demand for EV charging facilities is increasing exponentially and will place huge pressures on the grid. The limited number of hydrogen fueling stations will need to grow many times over to support a hydrogen fleet.Powering carbon-free transportOvercoming the challengesA successful transition to zero-emissions transport will need a network of charging and refuelling stations across the globe, in locations and quantities dictated by the transport industry and necessity; not grid capacity or accessibility.The places where people live, work and spend their free time and our existing infrastructure does not fit comfortably with access to large amounts of electrical power.Up until now, diesel generators would have been an option for off-grid power, but the need to transfer to zero-emission alternatives makes this unfeasible.You may have already considered turning your car park into an EV charging station but had concerns about the rate at which new EV charging bays should be introduced, or how you will secure the additional energy capacity and manage costs.You may also be concerned about keeping up with rapidly changing technology and keeping pace with clean air and zero-emissions regulations.EV charging & transportThe solutionThe GeoPura HPU provides large-scale, reliable energy wherever and whenever the grid cannot reach; and its only emissions are pure water. Each unit delivers 250kVA of standard three-phase, 400V critical electrical power backed up by an integral 216kWh battery system and multiple units can be combined, providing seamless scalability for any scope of project.Navigating the challenge with Renewable ChargingPartnering with Siemens and GeoPura can help you navigate all of the challenges you may face. We build, fuel, and run an emissions-free electricity generator in your car park as part of a long-term contract to provide all the energy, charging and payment infrastructure you need, as the number of EVs using your facility increases.Whether car parking is your primary operation, or an additional facility for your customers or employees, offering car park EV charging is a big opportunity and an increasingly important requirement. Regardless of your location, GeoPura can support you in delivering fast renewable charging for 1,000s of EVs. And our experience with hydrogen technology means we can deliver hydrogen refuelling as well as EV charging on a fully serviced basis.The flexibility of Car Park EV ChargingOur HPU and fast-charging posts can be provided on a permanent or temporary basis. This means that we are the perfect partner for outdoor events that have an EV focus or need visitor parking; construction sites using EVs or any other temporary/seasonal requirements.  The benefits Why choose us?  More efficient HPUs convert hydrogen fuel directly into electrical energy. Unlike traditional\n combustion engines that convert fuel into heat and then mechanical work.  No harmful emissions HPUs emit just water and a little heat. Internal combustion engines emit CO2 and\n pollutants such as NOx and particles.  Reliability HPUs have no moving parts and require less maintenance. Integrated 216kWh battery\n storage provides hours of back-up should a hydrogen supply be interrupted at any stageGeoPura In Action    Polestar European Press Drive    Goodwood Festival of Speed    Clean Air Day>Speak to us todayOur team is here to discuss your clean energy generation requirements or your renewable energy investments Get in touch From our blog    Empowering Electric Vehicle Adoption: GeoPura HPU supports the launch of the new Cadillac Lyriq in France    GeoPura wins EV Infrastructure Project of the Year    Meeting the challenge of the National Grid future energy scenarios    100% solar car?The solution for renewable green\n energy off–grid\n generationOur pagesHomeOur serviceOur technologyCase studiesNews and viewsAbout usContact usContact usinfo@geopura.com+44 (0)1509 882 340C A Parsons Works Shields Road Newcastle Upon Tyne NE6 2YL United KingdomFollow us          © Copyright 2024 GeoPura, Ltd. — All rights\n reserved. Privacy     Website design and\n development by Atomic                     "}, {"https://www.geopura.com/our-service/construction/": "     Zero Emissions Power & Renewable Energy for Construction | GeoPura            Our serviceEV charging & transportConstructionFilm & TV productionOutdoor eventsBespoke solutionsHydrogen productionOur technologyHydrogen fuelsEnergy generationHydrogen Power UnitCase studiesNews and viewsBlogPress releasesHydrogen for Power Generation CPDAbout usAbout usFAQsCareersContact  Call +44 1509 882 340 Construction As one of the largest users of fossil fuel generators, the construction industry must source off-grid, sustainable power solutions to help meet the low-emissions requirements expected of them, while still having access to the huge amounts of power needed to complete their projects. Get in touch See in action  ConstructionThe challengeThe construction industry is a big user of natural resources and a significant contributor to greenhouse gas emissions. As the climate crisis deepens and the finite nature of these resources is more clearly understood; there is an increasing pressure on the industry to reduce its environmental impact. Anyone operating within this sector will understand the numerous challenges that this presents.Grid connection and zero-emissions zonesA viable alternativeDuring the early phases of any construction project, access to a grid connection is either unavailable or extremely limited; but the requirement for power is as high as at any other stage.Increasingly, developers are finding themselves operating within zero and low-emissions zones or tendering for work that requires them to meet environmental targets and standards.Powering construction sites with diesel generators is a major contributor to highly damaging CO2, NOx, particulate, and watercourse pollution. The use of traditional generators is often restricted and sometimes prohibited entirely.A number of renewable energy and zero-emission power solutions for the construction industry are being offered including the use of biodiesel and portable renewable solutions with differing levels of effectiveness and reliability.Our offer provides a truly viable alternative. We deliver reliable, zero-emissions, grid-independent power; ensuring that construction sites have all the power they need, can meet the increasing regulatory requirements, and operate successfully and safely.ConstructionThe solutionZero Emissions Power for the Construction IndustryThe GeoPura Hydrogen Power Unit (HPU) provides 250kVA of standard three-phase, 400V critical electrical power backed up by an integral 216kWh battery system and can effectively replace on-site diesel generators with an emissions-free alternative.FlexibilityThe HPU can be configured to deliver combined heat and power (CHP) at no extra costs, providing hot water and heating for on-site welfare units, sanitary facilities, or other requirements. We can also integrate highspeed EV charging to support zero-emissions travel to and from site or enable electric site vehicles to be charged and used on site.Any available power provision on-site, such as existing renewables or limited grid availability, can be easily incorporated within the final system and battery backup provides further resilience. Should the hydrogen fuel supply be interrupted at any stage whilst construction is ongoing, the output of the system will be unaffected and can supply power autonomously for several hours.  The benefits Why choose us?  More efficient HPUs convert hydrogen fuel directly into electrical energy. Unlike traditional\n combustion engines that convert fuel into heat and then mechanical work.  No harmful emissions HPUs emit just water and a little heat. Internal combustion engines emit CO2 and\n pollutants such as NOx and particles.  Reliability HPUs have no moving parts and require less maintenance. Integrated 216kWh battery\n storage provides hours of back-up should a hydrogen supply be interrupted at any stageGeoPura In Action    HS2 reveals successful results of hydrogen generator trial    GeoPura green hydrogen generator fuelling construction and reducing emissions at Hull highways site    Construction world first>Speak to us todayOur team is here to discuss your clean energy generation requirements or your renewable energy investments Get in touch From our blog    Building a Greener Future: GeoPura Hydrogen Power and the Future of Diesel-Free Construction     Sustainability Matters: The Top 3 Reasons Why Construction Companies Should Switch to Hydrogen GeneratorsThe solution for renewable green\n energy off–grid\n generationOur pagesHomeOur serviceOur technologyCase studiesNews and viewsAbout usContact usContact usinfo@geopura.com+44 (0)1509 882 340C A Parsons Works Shields Road Newcastle Upon Tyne NE6 2YL United KingdomFollow us          © Copyright 2024 GeoPura, Ltd. — All rights\n reserved. Privacy     Website design and\n development by Atomic                     "}, {"https://www.geopura.com/our-service/film-tv-production/": "     Zero Emissions Power & Renewable Energy for Film & TV | GeoPura            Our serviceEV charging & transportConstructionFilm & TV productionOutdoor eventsBespoke solutionsHydrogen productionOur technologyHydrogen fuelsEnergy generationHydrogen Power UnitCase studiesNews and viewsBlogPress releasesHydrogen for Power Generation CPDAbout usAbout usFAQsCareersContact  Call +44 1509 882 340 Film & TV production Filming on location poses a number of challenges for the film and TV industry; and when the grid can’t deliver and you’re increasingly conscious of the carbon footprint left behind, you need an emissions-free alternative to provide reliable, crucial power for your productions. Get in touch See in action  Film & TV productionThe challengeAccording to BAFTA (British Academy of Film and Television Arts), a single hour of television produced in the UK, whether fiction or nonfiction, produces an average of 13 metric tons of carbon dioxide (CO2). These emissions amount to nearly as much as the average person generates in an entire year.Despite this, the demand for TV and film production remains as strong as ever. The vast amounts of energy required to power production equipment, combined with the emissions caused by transport makes film and TV production one of the biggest polluting sectors in the country.WeAreAlbertThe Generator ProjectAt GeoPura, we are committed to helping the Film and TV industry to reduce their CO2 emissions. We are proud to be albert accredited and have already worked with the world’s biggest broadcaster, the BBC.We support The Generator Project, a collaboration of industry members focusing on the use of diesel generators in film and TV production to support the transition to low-carbon, renewable energy alternatives. We value this opportunity to discuss how broadcasters across the globe can embrace the power of zero-emission technology.Film & TV productionThe solutionZero Emissions Power for the film & TV industryWith such a large energy requirement and a vast variety of locations, the opportunity for the film & TV industry to reduce energy usage or begin to source it all from the grid is extremely limited. It is crucial for the industry to find a reliable and viable alternative to diesel generators and this is what GeoPura offers.The GeoPura Hydrogen Power Unit delivers 250kVA of standard three-phase, 400V critical electrical power backed up by an integral 216kWh battery system. It can be transported to remote locations and provide reliable, uninterruptable power for live broadcasting or recording, and its only by-product is pure water.On-location, off-grid renewable energy for the film & TV industryWe understand that on-location filming has its challenges. To overcome these, the HPU provides 100% emissions-free, off-grid power and can also deliver heating and hot water and fast EV charging. These capabilities can further improve the sustainability of your production by supporting cast and crew welfare facilities and onsite transport with zero-emissions power. The flexible nature of the HPU allows for multiple units to be combined to produce as much power as necessary.   The benefits Why choose us?  More efficient HPUs convert hydrogen fuel directly into electrical energy. Unlike traditional\n combustion engines that convert fuel into heat and then mechanical work.  No harmful emissions HPUs emit just water and a little heat. Internal combustion engines emit CO2 and\n pollutants such as NOx and particles.  Reliability HPUs have no moving parts and require less maintenance. Integrated 216kWh battery\n storage provides hours of back-up should a hydrogen supply be interrupted at any stageGeoPura In Action    All 12 of Springwatch’s live broadcasts were powered by green hydrogen    Zero-emissions for Winterwatch    Polestar European Press Drive>Speak to us todayOur team is here to discuss your clean energy generation requirements or your renewable energy investments Get in touch From our blog    Netflix is testing a new, cleaner approach to TV  and film production    Sustainability Matters: Reasons Why Film and TV Production Companies Should Switch to Hydrogen Powered Generators    “The crews are ready to go green” and GeoPura is proud to be part of the solution    We were thrilled to be back on set for BBC’s Winterwatch 2022The solution for renewable green\n energy off–grid\n generationOur pagesHomeOur serviceOur technologyCase studiesNews and viewsAbout usContact usContact usinfo@geopura.com+44 (0)1509 882 340C A Parsons Works Shields Road Newcastle Upon Tyne NE6 2YL United KingdomFollow us          © Copyright 2024 GeoPura, Ltd. — All rights\n reserved. Privacy     Website design and\n development by Atomic                     "}]}