{"text": [{"https://hohmenergy.com": "Solar ‎Marketplace | Solar Panels | Hohm Energy\n\n\n\nHow it WorksCompanySolar-Installer PartnerEnterprise PartnerBecome a PartnerSolar Installer PartnerEnterprise PartnerHow Solar WorksLearnFAQsSolar ResourcesHow Solar WorksLearnFAQsContactGet StartedLoginYour Premier Solar Energy MarketplaceThank you! Your submission has been received!Oops! Something went wrong while submitting the form.Get StartedThank you! Your submission has been received!Oops! Something went wrong while submitting the form.Go solar with Hohm’s network of accredited solar providers in just a few clicks.Thank you! Your submission has been received!Oops! Something went wrong while submitting the form.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCurrent active provinces and expanding to national footprintThe states that we currently service.NameEmail AddressThank you! Your submission has been received!Oops! Something went wrong while submitting the form.No need to shop around - we find the best offers for youWe have built a network of vetted contractors and installers, allowing you to choose the best option for your needs.We manage your entire solar journey from A-ZLet our qualified Energy Advisors help you navigate your solar journey, oversee your installation and ensure the process is both seamless and enjoyable.We ensure you receive the best-available financing options.We have a proven network of leading finance providers so you receive the best financing options available.Your clean energy home: the future is hereSolar rooftopGenerate your power from the sun by mounting solar PV panels onto your roof. Rooftop solar is the most convenient and cost effective way to save money on your energy needsBattery storageStore your own power with an integrated battery storage system, providing you theability to save money when electricity is most expensive.Energy-efficient lightingReplacing your old lighting can save you as much as 90% compared to traditional lighting. Speak to your Energy Advisor to learn more about making the switch to energy efficient lighting.Heat pumpsThe way your home lets in sun light and retains heat can have a massive impact to your electricity bill. Speak to your Energy Advisor to find out more.Smart thermostatSmart Thermostats track your usage, help maximize your heating and cooling efficiency and provide valuable insights that help you save.Electric Vehicles ChargersThe charging of your electric vehicle must be taken into consideration when it comes to your clean energy home design. The added convenience of a home EV charger will save you both time and money.Why work with Hohm?20% cheaperWith our bulk discountsyou get best price40%faster With our online platformand service model1-Stop shopWith our marketplace thatconnects you to vettedcontractors in your areaLearn more about solarThe best and simplest solution aroundNo one wants to deal with door-to-door salesmen or multiple contractors. We manage your entire clean energy journey using our service model and online digital platform.Online platformEngineeringdesignContractorinstallation$1.95per WattOther providersOffice &infrastructureDesign & engineeringPushysalesmenMultiplecontractors$2.70+per WattGet StartedGet started within minutes.Energy independence and solar savings in 5 easy steps:1Generate an instant proposal2Get matched with a provider3Final design and financing4Installation & quality control5All-inclusive maintenance planGet StartedTrusted By:hohmmm...Make your solar experience hassle free, with Hohm.Get StartedTrusted By:Why use hohm?Solar providersGoogle search with no assurance.3-10 days proposal lead time.Need for oversight.Long manual process.Cumbersome to get best price.Do it yourselfSlow process.Engineering heavy with steep learning curve.You run risk with compliance.Cheap option  high administration.Long lead times.Your bespoke options in minutes.Let us manage everything.Transparent & best pricing.Fast process end-to-end.Quality installation.Solar providersGoogle search with no assurance.3-10 days proposal lead time.Need for oversight.Long manual process.Cumbersome to get best price.Your bespoke options in minutes.Let us manage everything.Transparent & best pricing.Fast process end-to-end.Quality installation.Do it yourselfSlow process.Engineering heavy with steep learning curve.You run risk with compliance.Cheap option  high administration.Long lead times.Generate your proposal in minutes and without having to deal with a sales person.Hohm uses technology to provide the most efficient, convenient & seamless solar-purchase experience.Get StartedYour Energy Advisor in your pocketMeet Hohmie, your personal Energy Advisor that talks you through every step and automates your proposals, site bookings and any coordination throughout your entire Hohm Energy journey.Get Custom PricingEnjoy Your Energy FreedomHassle-free solar with hohm.Going solar can be daunting. Hohm coordinates all the stakeholders using our managed marketplace so you don’t need to worry about which solar installer to trust, which product combination is the best fit for your needs, and how to structure the most suitable finance option to meet your budget.Faster timesUp to 70% faster turn around time.Great valueMatching your needs at the best price.Quality controlQuality control every step of the way.Where we shine.Hohm is up to 70% faster than traditional solar options, saving you time and money.Comparison between Hohm and other methodsSolar journey milestonesInitial proposalFinal proposal & designFinance structuring & approvalInstallation & handoverMaintenance planTraditional  providers3 - 10 days from call/visit3 - 10 days from site visit10 days3 - 5 days1 yearDo ityourself (DIY)10 days +10 days +10 days +3 - 10 daysNo maintenace plan5 minutes2 days from site visit1 - 2 days3 - 5 daysOngoingHiring Heroes.Hohm is an active partner in the Hiring Our Heroes program, offering transitioning service member the opportunity to start a career in the solar industry.“One of the best parts of the military is the sense of comradery and I was afraid I wasn’t going to be able to find that in the civilian world, but Hohm’s culture is so inviting; I felt right at HOHM! ”-Jason Filauro, U.S. Marine CorpsWe are growing across the USAs a trusted and reliable clean energy marketplace, we connect you with vetted installers in your area. We have conducted thorough due diligence on each of our installers and provide ongoing insight and quality control so you can transition to clean energy with absolute peace of mind that you have a trusted partner every step of the way.Partner With HohmMoving towards a solar future together.Hohm is an online software platform and marketplace that connects you with customers in the market. Speak with us about how to become involved.Become a Hohm Solar InstallerQuicklinksHomeHow It WorksCompanyBecome a Solar PartnerBecome an Enterprise PartnerHow Solar WorksFAQsSolar Savings TipsNewsContactFollow UsInstagramFacebook© Hohm Energy 2021. All Rights ReservedTerms & ConditionsWe are on a mission to accelerate the adoption of solar rooftop to move us towards a lower-carbon future, faster.Thank you! Your submission has been received!Oops! Something went wrong while submitting the form.\n\n\n\n\n\n\n"}, {"http://app.hohmenergy.com/": "Solar Marketplace"}, {"https://app.hohmenergy.com/get-my-proposal/": "Solar Marketplace"}]}