{"text": [{"https://holiferm.com": " Holiferm - Holiferm            window.dataLayer = window.dataLayer || [];\n function gtag(){dataLayer.push(arguments);}\n gtag('js', new Date());\n gtag('config', 'G-X3WV5HY99J');  Skip to contentToggle NavigationHomeAboutProductsPartnersTeamVacanciesNewsContact HolifermTom Brookes2023-08-14T11:37:53+01:00Manufactured by HolifermEngineering fermentation processes for sustainable productionRenewableBiosurfactantsLarge ScaleFind Out MoreAbout HolifermWe use natural fermentation to produce environmentally friendly and economically competitive alternatives to petrochemical-derived ingredientsFind Out MoreRenewable materialsHoliferm accelerates the transition to a biosurfactant based economy by using renewable materials to manufacture non-toxic ingredients for industrial and consumer products. Our cutting-edge collaborative approach allows us to push technical boundaries towards a circular bioeconomy.Excellence in BioprocessingOur team’s expertise in biotechnology and process engineering, alongside our patented technology, enables us to develop green manufacturing processes that surpass the state of the art in productivity and cost efficiency.Our teamHoliferm is growingOur open and collaborative company culture and the welfare of our staff are central to our mission and vision.Our TeamOur ProductsBiosurfactant ProductsWe offer a range of sophorolipid products for use in a variety of application areas.Find Out moreNewsKeep up to date with the latest news from HolifermHoliferm News, NewsHoliferm announces search for new CEO to ready business for international growth17th Jun, 2024|   Andrew HardwickNewsGreen Pyramid and Holiferm Partner on new Formulation Trials31st Jul, 2024|   Andrew HardwickHoliferm News, NewsHoliferm announces search for new CEO to ready business for international growth17th Jun, 2024|   Andrew HardwickHoliferm News, NewsBiosuds- The World’s First Car Shampoo containing Biosurfactants8th Jul, 2024|   Andrew HardwickHoliferm News, NewsHoliferm News Issue 3 is out now!1st Jul, 2024|   Andrew HardwickTestimonials“Holiferm are an outstanding company to work with! Their products are fantastic; highly effective, superb quality and eco-credentials to match. Highly engaging group of professionals with a drive (and passion) to make this the bio-surfactant everyone will want to get hold of.”Kate Deacon, CEO of Mix Clean Green“Being a small start – up company we have felt supported by Holiferm 100% of the way, we have received advice, back up and help from this wonderful company, we look forward to doing more business in the future.”Tina & Lizzy Grayson, Co-founders of An’du Care Limited“The Holiferm expertise in the area of fermentation technology and production is a perfect fit with Sasol’s position as a global leader in the supply of surfactants and surfactant intermediates into the Fabric and Home Care, Personal Care as well as Industrial and Institutional Cleaning markets. We were so excited to discover Holiferm and their new environmentally friendly methods of manufacturing surfactants.”Silke Hoppe, Vice President, Essential Care Chemicals (ECC), Sasol  R&D LabUnit 15, Severnside Trading Estate, Trafford Park, Manchester M17 1WAContactinfo@holiferm.comcommercial plantUnits 7-14 Ocean Park, Dock Road Wirral CH41 1HWContactinfo@holiferm.com © Holiferm 2024 | Privacy Notice & Cookies | SitemapSite by Double D Creative   Page load link This website uses cookies to ensure you get the best experience on our website, click 'allow all cookies' below to enable third-party embeds and tracking cookies. More information about cookies can be found here. Choose Which Cookies to Allow    Allow All Cookies   Reject About Cookies Cookies are very small text files that are stored on your computer when you visit a website. We use cookies for a variety of purposes and to enhance your online experience on our website. You can change your preferences and decline certain types of cookies to be stored on your computer while browsing our website. You can also remove any cookies already stored on your computer, but keep in mind that deleting cookies may prevent you from using parts of our website by clicking here.Third Party Embeds Third-party cookies are cookies that are set by other websites, not this one. This website may use embedded content from other websites, such as Google maps. Your consent if required to view content from these website embedded on this site.   YouTube    Facebook    X    Google Maps Tracking Cookies These cookies are used to collect information to analyze the traffic to our website and how visitors are using our website. For example, these cookies may track things such as how long you spend on the website or the pages you visit which helps us to understand how we can improve our website site for you. The information collected through these tracking and performance cookies do not identify any individual visitor.   Tracking Cookies   "}, {"https://holiferm.com/about/": " About - Holiferm            window.dataLayer = window.dataLayer || [];\n function gtag(){dataLayer.push(arguments);}\n gtag('js', new Date());\n gtag('config', 'G-X3WV5HY99J');  Skip to contentToggle NavigationHomeAboutProductsPartnersTeamVacanciesNewsContact AboutTom Brookes2023-08-14T10:58:23+01:00About HolifermCommercialising efficient fermentation processesAbout HolifermHoliferm develops processes to manufacture sustainable biosurfactant products for use at commercial scale.What we doIntegrated gravity separation technology.Holiferm transforms conventional batch fermentation into efficient continuous processes and our patented integrated gravity separation technology enables cost competitive large scale production of biosurfactant products.Our products have been quickly adopted by various distributors and environmentally conscious product manufacturers. Our kiloton scale commercial plant for production of sophorolipid biosurfactants is the first and largest of its kind – and we’re not going to stop there.What we doOur processWhat comes nextExpanding our reachOur technology can be applied to a wide range of different biosurfactants, and many other lipid molecules. We have the capability to scale up and commercialise biosurfactant molecules.Through our own independent research and numerous partnerships, we continue to work on expanding our portfolio to provide customers viable and affordable choices.Our achievementsHoliferm company history and milestones.May 2018Holiferm founded to bring environmentally friendly bioproducts to market.May 2019Investment from Icos Capital’s ICF III fund enables Holiferm to scale-up its activities with the construction of a new R&D lab and pilot plant.Aug 2020The R&D laboratory is finished and fully operational.Feb 2021Portfolio expanded at the R&D laboratory, starting the development of manufacturing processes for a new range of biosurfactants.April 2021The Pilot plant begins operation and completes its first 600L bioreactor run, successfully producing and purifying hundreds of kgs of sophorolipid, demonstrating the continued efficacy of the technology and process at a massively increased scale.Nov 2021Holiferm receives a combined investment of $9.5M from Rhapsody Venture Partners and Clean Growth Fund, known for their contributions in supporting sustainable technology development. The investment will support the launch of the new commercial plant and expansion into new products.Jan 202290,000 sq ft site for commercial plant in Wallasey acquired.Mar 2022Construction of commercial plant begins.May 2022Holiferm wins Innovation of the Year at the Chemical Northwest awards.Feb 2023Commercial plant opens.  R&D LabUnit 15, Severnside Trading Estate, Trafford Park, Manchester M17 1WAContactinfo@holiferm.comcommercial plantUnits 7-14 Ocean Park, Dock Road Wirral CH41 1HWContactinfo@holiferm.com © Holiferm 2024 | Privacy Notice & Cookies | SitemapSite by Double D Creative   Page load link This website uses cookies to ensure you get the best experience on our website, click 'allow all cookies' below to enable third-party embeds and tracking cookies. More information about cookies can be found here. Choose Which Cookies to Allow    Allow All Cookies   Reject About Cookies Cookies are very small text files that are stored on your computer when you visit a website. We use cookies for a variety of purposes and to enhance your online experience on our website. You can change your preferences and decline certain types of cookies to be stored on your computer while browsing our website. You can also remove any cookies already stored on your computer, but keep in mind that deleting cookies may prevent you from using parts of our website by clicking here.Third Party Embeds Third-party cookies are cookies that are set by other websites, not this one. This website may use embedded content from other websites, such as Google maps. Your consent if required to view content from these website embedded on this site.   YouTube    Facebook    X    Google Maps Tracking Cookies These cookies are used to collect information to analyze the traffic to our website and how visitors are using our website. For example, these cookies may track things such as how long you spend on the website or the pages you visit which helps us to understand how we can improve our website site for you. The information collected through these tracking and performance cookies do not identify any individual visitor.   Tracking Cookies   "}, {"https://holiferm.com/products/": " \n Products - Holiferm            Skip to contentToggle NavigationHomeAboutProductsPartnersTeamVacanciesNewsContact ProductsGreg Johnston2024-02-09T12:53:17+00:00Holiferm ProductsBiosurfactants from renewable feedstocksLearn more about our products for specific markets by clicking on the buttons below:Home Care BrochurePersonal Care BrochureHoliSurf HFHoliSurf LFHoneySurf HFHoneySurf LFHoneySurf AGPersonal CareHome CareIndustrial CleaningAgricultureIn-use pH3-105-83-105-85-8Wetting% Active~60~60~60~60~60SophorolipidsWe offer low foaming (LF) and high foaming (HF) versions of our sophorolipidsLow Foaming (LF)The LF product is directly obtained from the fermentation process and is not modified further – it can be used for a variety of applications including Hand Dish Wash liquids, Facial cleansers, Shampoos and Shower Gels.High Foaming (HF)The HF product has undergone a mild chemical transformation which allows generation and stabilisation of a greater amount of foam. This can be used for a variety of applications from detergents to car washing products.Product SamplesTrial our productsHoliferm can supply product samples and are always open to partnering discussions. TDS, SDS, and example COA’s are available on request. Please contact sales@holiferm.com or fill out the form below for more information or to make a request.Contact FormWant to find out more?\"*\" indicates required fieldsName*   First    Last Email* PhoneCompany NameHow can we help you?*Consent*  I consent to my submitted data being collected and stored | Privacy PolicyCAPTCHA        Δ  R&D LabUnit 15, Severnside Trading Estate, Trafford Park, Manchester M17 1WAContactinfo@holiferm.comcommercial plantUnits 7-14 Ocean Park, Dock Road Wirral CH41 1HWContactinfo@holiferm.com © Holiferm 2024 | Privacy Notice & Cookies | SitemapSite by Double D Creative   Page load link           "}, {"https://holiferm.com/partners/": " Partners - Holiferm            window.dataLayer = window.dataLayer || [];\n function gtag(){dataLayer.push(arguments);}\n gtag('js', new Date());\n gtag('config', 'G-X3WV5HY99J');  Skip to contentToggle NavigationHomeAboutProductsPartnersTeamVacanciesNewsContact PartnersGreg Johnston2023-08-02T14:00:20+01:00PartnersOur partnersHoliferm’s PartnersWe work with a variety of partners from local independent businesses to multinationals.Our PartnersCustomers and CollaboratorsDistributorsInvestorsMemberships and certificationSupportersAn’du, a small family run company in South West London, is using Holiferm’s HoneySurf sophorolipid to produce a shampoo bar in the UK for the very first time. The 100g bar is environmentally friendly, biodegradable and comes in compostable packaging.Our Partners  R&D LabUnit 15, Severnside Trading Estate, Trafford Park, Manchester M17 1WAContactinfo@holiferm.comcommercial plantUnits 7-14 Ocean Park, Dock Road Wirral CH41 1HWContactinfo@holiferm.com © Holiferm 2024 | Privacy Notice & Cookies | SitemapSite by Double D Creative   Page load link This website uses cookies to ensure you get the best experience on our website, click 'allow all cookies' below to enable third-party embeds and tracking cookies. More information about cookies can be found here. Choose Which Cookies to Allow    Allow All Cookies   Reject About Cookies Cookies are very small text files that are stored on your computer when you visit a website. We use cookies for a variety of purposes and to enhance your online experience on our website. You can change your preferences and decline certain types of cookies to be stored on your computer while browsing our website. You can also remove any cookies already stored on your computer, but keep in mind that deleting cookies may prevent you from using parts of our website by clicking here.Third Party Embeds Third-party cookies are cookies that are set by other websites, not this one. This website may use embedded content from other websites, such as Google maps. Your consent if required to view content from these website embedded on this site.   YouTube    Facebook    X    Google Maps Tracking Cookies These cookies are used to collect information to analyze the traffic to our website and how visitors are using our website. For example, these cookies may track things such as how long you spend on the website or the pages you visit which helps us to understand how we can improve our website site for you. The information collected through these tracking and performance cookies do not identify any individual visitor.   Tracking Cookies   "}, {"https://holiferm.com/team/": " Team - Holiferm            window.dataLayer = window.dataLayer || [];\n function gtag(){dataLayer.push(arguments);}\n gtag('js', new Date());\n gtag('config', 'G-X3WV5HY99J');  Skip to contentToggle NavigationHomeAboutProductsPartnersTeamVacanciesNewsContact TeamTom Brookes2024-07-29T09:12:15+01:00Holiferm’s TeamMeet the teamour teamWe have a diverse team with people from commercial, scientific, and engineering backgrounds.Our missionWe will facilitate the manufacture of holistically sustainable bio-products at a value point at which they are affordable to everyone therefore eliminate the need for petrochemicals.Just as importantly, we will enhance the lives of our employees and external stakeholders by working collaboratively by always looking for mutual benefit and providing opportunities for growth and impact.Company CharterThe TeamMeet the teamServicesTechnical Sales ManagerLawrence Clarke Talent Acquisition LeadAmy Hallworth Marketing and Business Support ManagerAndrew Hardwick Sales Account ManagerTom Lester Supply Chain ManagerSid Palmer Commercial ManagerJoana Pereira Team Growth LeadTom Pallett Assistant AccountantLewis Wright Head of EHSKarl Williams PurchaserAmy LuntSenior Sales ManagerGlen McCaugherty Technical Business AssistantJaime Lowe Head of Global Regulations and Product SafetyClare Walker Executive Assistant to the CEOAmanda Grant Facilities and Laboratory Management CoordinatorJamal Everett Senior Management AccountantGary Deeny ManufacturingProcess EngineerRichard Bullen Laboratory Support LeadPaul Carr Fermentation and Downstream EngineerMagda Costa Fermentation ScientistPatrícia Domingues Plant OperatorJohn Faber Plant OperatorEwa Fic OperatorJames Lovell OperatorTommy Ball OperatorPaul Keeley Production SupervisorJon Daly Maintenance Technician MechanicalBen Abbott OperatorNick Davies Scale up and manufacturing engineerDanail Milev OperatorWayne Peers Fermentation ScientistSerena Simonetti Analytical ScientistAlastair Veitch OperatorMatt Wharton Pilot Plant TechnicianJames Wilding QC/QA ScientistLuke Anderson QC/QA Lab TechnicianJames Vickers Research AssistantLulu Amanda Fermentation Process EngineerNick Huneidi Quality ManagerDave Atherton OperatorEd Barton OperatorLewis Jarvis Materials Maintenance OperatorLee BradleyJunior Analytical ScientistSophie Bell Principal Process Development EngineerVicky de Groof Head of ProjectsAndrew Herod  Projects ManagerLouie Holbrook  Facilities Maintenance TechnicianJon Bartley Leadership, Directors & Board ObserversChief Executive OfficerBen Dolman Finance DirectorBeth Foster Investor DirectorPeter van Gelderen Chief Operating Officer / Managing DirectorRichard Lock Operations DirectorAlice Robinson Board ObserverJonathan Tudor Investor DirectorJason Whaley Technical DirectorJames Winterburn People and Culture ManagerMariane Gaio Non-Executive DirectorCarolyn Fritz People and Culture DirectorLynne Webster Chief Commercial OfficerSimon Bennett Holiferm missionCharter & GoalsCompany missionWe will facilitate the manufacture of holistically sustainable bioproducts at a value point at which they are affordable to everyone therefore eliminate the need for petrochemicals. Just as importantly, we will enhance the lives of our employees and external stakeholders by working collaboratively by always looking for mutual benefit and providing opportunities for growth and impact.Company visionTo work together to create a World where better value and sustainable biochemicals eliminate the need for petrochemicals.Company charterOwnership and trust We win and lose as a team. We take ownership of what we do and share in the ownership and success of the business. We know everyone believes and counts on us to deliver, and trust that we will, knowing we are all committed to support each other.Flexibility We are ready to make major changes of direction and objectives in a single day. We change as soon as it makes sense to do so, and avoid putting further time after sunk time. We have the freedom to work when we wish and make ourselves available when we are needed.Safety The safety of both employees and third parties is of utmost importance, we look for inherently safe solutions and never compromise safety.Growth and challenge We seek out novel ideas and different ways of doing things, even when these challenge our preconceived notions and the orthodoxy, building a team with diversity of both ideas and backgrounds. -We actively look for opportunities every week to improve in our roles, as people and as a company, both inviting, acting on and giving feedback irrespective of job role and discomfort we may find doing so. We find opportunities to help each other learn, be that personal support, recommendations or training opportunities.Proactiveness, innovation and efficiency We find solutions to do things quicker and cheaper than others are prepared to do, finding creative ways and taking risks to make things work, as long as safety isn’t compromised we do as much as we can with as little as possible. Because of this, we have many failures, but we make them quickly, cheaply and once. We focus on delivering what our customers want, rather than what we think they want. We take the time to step back, observe, learn and ask why? We set audacious objectives and track our progress from both an internal and external perspective.Respect We value everyone’s ideas, time and personality, including our own. We engage with everyone’s ideas and ensure that ours are also expressed. If we will have something more important than a meeting or deadline we scheduled, we communicate this immediately and don’t expect others to wait for us.Collaboration There are no competitors, only collaborators we aren’t yet working with. We make win-win deals with collaborators, customers, suppliers and funders, finding creative opportunities for a win-win, and aim to work with collaborators who do the same. The opportunity is big enough for many players, and the challenge is big enough that no company has all the answers. We apply all of our values outside of the company as well as inside.Sustainability We aim to build an inherently sustainable company, ensuring both our everyday and major decisions lead to sustainability for the company, for the environment and the community. We believe a focus on all three aspects will lead to greater success in all 3 dimensions.Kindness support and happiness We support each other no matter who, where or when, and from a personal perspective as well as a professional one. We go out of our way to learn about each other as people as well as teammates, and endeavour to make a teammate smile each day. Our policies are a baseline, and we will take into account the needs and feelings of every individual when making decisions.Enthusiasm We commit 100% to achieve agreed goals and perspectives, even when they differ from what we might have set in the first place. We bring a genuine enthusiasm and excitement to everything that we do and extend this enthusiasm to the public and our collaborators.  R&D LabUnit 15, Severnside Trading Estate, Trafford Park, Manchester M17 1WAContactinfo@holiferm.comcommercial plantUnits 7-14 Ocean Park, Dock Road Wirral CH41 1HWContactinfo@holiferm.com © Holiferm 2024 | Privacy Notice & Cookies | SitemapSite by Double D Creative   Page load link This website uses cookies to ensure you get the best experience on our website, click 'allow all cookies' below to enable third-party embeds and tracking cookies. More information about cookies can be found here. Choose Which Cookies to Allow    Allow All Cookies   Reject About Cookies Cookies are very small text files that are stored on your computer when you visit a website. We use cookies for a variety of purposes and to enhance your online experience on our website. You can change your preferences and decline certain types of cookies to be stored on your computer while browsing our website. You can also remove any cookies already stored on your computer, but keep in mind that deleting cookies may prevent you from using parts of our website by clicking here.Third Party Embeds Third-party cookies are cookies that are set by other websites, not this one. This website may use embedded content from other websites, such as Google maps. Your consent if required to view content from these website embedded on this site.   YouTube    Facebook    X    Google Maps Tracking Cookies These cookies are used to collect information to analyze the traffic to our website and how visitors are using our website. For example, these cookies may track things such as how long you spend on the website or the pages you visit which helps us to understand how we can improve our website site for you. The information collected through these tracking and performance cookies do not identify any individual visitor.   Tracking Cookies   "}]}