{"text": [{"https://www.intelligentgrowthsolutions.com/": "Intelligent Growth Solutions | Global Vertical Farming Technology\n\n\n\n\n\n\nVertical FarmingOur technologyGrowth TowersTCEATake a tourFAQsWho we helpNurseriesSeed-to-harvestPharmaceuticalEntrepreneursEnergy producersForestryAboutWho we areThe IGS StoryResearch networkOur impact: ESGAwardsPeopleLife at IGSCareersThe crewCurrent vacanciesResourcesBlogEventsWebinarsGuidesMedia centreGet in touchVertical farming technology Powered by IGSDiscover moreOur technologyModular | Scalable | FlexibleIGS designs and builds industrial-scale vertical farms, globally. Our proprietary technology is designed to grow a variety of crops and plants by creating the perfect growing environment, year-round. Our end-to-end service is designed to support you each step of the way, from building a business case to build completion, as well as ongoing maintenance and support.It is the combination of technology, people and service that makes IGS the perfect partner for growers.Discover our technologyGrowth TowersIn our Growth Towers, elements such as lighting, water, energy, and nutrient delivery can be controlled to create the perfect growing environment year-round.Find out moreTCEADesigned with simplicity in mind, our technology delivers Total Controlled Environment Agriculture (TCEA). Find out moreWho benefits from our technologyAs a pure technology vendor, IGS only grows crops for research and development. Our team of plant scientists works alongside our software and hardware engineers to deliver technology designed with the grower in mind. Nursery growersOur vertical farming technology integrates with existing operations to create a hybrid growing solution, which allows nurseries to produce a diverse range of high quality, high health plants for growing or planting on. See moreSeed-to-harvest growersFrom leafy greens to herbs, our powerful vertical farming technology is designed to grow a range of different seed-to-harvest crops, giving growers the ability to flex production to meet market demand.See moreWhy partner with IGSWe are passionate about tackling one of the world’s greatest challenges - sustainable food production. This shared mission is at the core of IGS, and drives the team to make our technology best in class. It’s the combination of our technology and our people that makes IGS unique. Our technology is:Modular, easy to build and maintainClosed-loop environmentDesigned to be a smart consumer of energySuitable for a range of crop and plants in one Growth TowerFully integrated, managed via a single sourceFully supported with ongoing serviceFind out moreWhat our customers say\"IGS team's friendly and 'get it done' attitude truly sets them apart from other vertical farming companies. IGS’ innovative technology powering the Growth Towers showcases remarkable adaptability for diverse crops. At Potager, we believe whole heartedly that a continued success is synonymous with ours, and we can only wish for more of it in the future.\"Andonis Sarmias - Managing DirectorPotager Farm\"Every staff member at IGS, regardless of their position, displayed friendliness, approachability and extensive knowledge.Their cohesive efforts shine through, making them the perfect technology partner for our operations.\"Graeme Warren - CEOVertegrowResourcesFrom blog posts on the latest updates to our cutting-edge vertical farming technology, to webinars hosting industry experts discussing everything from the future of vertical farming to financing your project, you’ll find all you need to know here.Discover moreFrequently asked questions\nWill vertical farming take place of traditional farming?Vertical farming is key to the future of farming and will become a key part, however it will not take place of traditional farming. Find out more about IGS.See moreWhy is vertical farming important?Vertical farming has the serious potential to address areas of global agricultural & environmental needs. Find out more about Intelligent Growth Solutions.See moreWho is your target market?IGS offers global vertical farming solutions to traditional farms, entrepreneurs, governments, food producers & pharmaceuticals, among others. Read more.See moreWhat is a vertical farm?Vertical farming is the practice of producing food in vertically stacked layers where all environmental factors can be controlled to optimise plant growth. See moreOur latest updates from the newsroomWednesday, July 17, 2024Using modern technologies in agriculture for better health and food security Does modern agricultural technology (such as vertical farming) hold the secret to food security and public health? Take a deep dive with IGS’ Offer Manager Chris Lloyd. Does modern agricultural technology (such as vertical farming) hold the secret to food security and public health? Take a deep dive with IGS’ Offer Manager Chris Lloyd. Read moreWednesday, July 17, 2024Using modern technologies in agriculture for better health and food security Thought leadershipDoes modern agricultural technology (such as vertical farming) hold the secret to food security and public health? Take a deep dive with IGS’ Offer Manager Chris Lloyd. Does modern agricultural technology (such as vertical farming) hold the secret to food security and public health? Take a deep dive with IGS’ Offer Manager Chris Lloyd. Read moreMonday, May 27, 2024Artificial intelligence and agriculture: how can AI impact vertical farming? What we know so far Thought leadershipRead IGS’ Chief Technology Officer, Dave Scott, and Head of Data, Emily Seward’s thoughts on artificial intelligence and agriculture, and how vertical farming can benefit.Read IGS’ Chief Technology Officer, Dave Scott, and Head of Data, Emily Seward’s thoughts on artificial intelligence and agriculture, and how vertical farming can benefit.Read moreThursday, April 25, 2024Can you grow tomatoes with vertical farming? A crop scientist’s insight. Crop scienceRead IGS’ Head of Science Tanveer Khan’s insight on growing tomato starter plants with vertical farming, covering everything from nutritional value to specific nuances between varieties. Read IGS’ Head of Science Tanveer Khan’s insight on growing tomato starter plants with vertical farming, covering everything from nutritional value to specific nuances between varieties. Read moreThursday, April 18, 2024Growing strawberry runners with vertical farming – what the science tells us Crop scienceHere's how we utilise the latest research to grow strawberry runners using vertical farming. Here's how we utilise the latest research to grow strawberry runners using vertical farming. Read moreThursday, April 11, 2024Growing lettuce seedlings with vertical farming: a crop science insight Crop scienceHere’s how we take cutting-edge crop science to grow lettuce seedlings with vertical farming. Here’s how we take cutting-edge crop science to grow lettuce seedlings with vertical farming. Read moreThursday, April 4, 2024How to grow chillies with vertical farming: a crop science perspective Crop scienceInterested in growing chillies vertically? Get a crop scientist’s perspective.Interested in growing chillies vertically? Get a crop scientist’s perspective.Read moreTuesday, March 19, 2024How we've helped Potager Farm reach new heightsCustomer announcementsWe’ve been helping Potager Farm grow delicious produce for Berlin’s food scene. Here’s how. We’ve been helping Potager Farm grow delicious produce for Berlin’s food scene. Here’s how. Read moreTuesday, January 23, 2024Elevating Veganuary – how vertical farming can help cut food system emissions General newsEvents such as Veganuary and Meatless Monday have swept the world in recent times. Here’s how vertical farming can work in tandem. Events such as Veganuary and Meatless Monday have swept the world in recent times. Here’s how vertical farming can work in tandem. Read moreFriday, January 12, 2024How we benefit from STEM ambassador expertise at IGS BlogsNurturing the next generation of STEM talent is crucial to the future of our industry. Here’s how we reap the benefits of ambassador expertise at IGS.Nurturing the next generation of STEM talent is crucial to the future of our industry. Here’s how we reap the benefits of ambassador expertise at IGS.Read moreSee all articlesGet in touch with IGSOur team of experts are ready and waiting to talk with you. We'd love to hear from you.Contact usProductOur technologyGrowth TowersTCEATake a tourFAQsCompanyWho we areCultureCrewCareersVacanciesOur impact: ESGUpdatesBlogEventsAwardsBrexit statementPress releasesContact+44 (0)131 202 1050IGSUnit 19Belleknowes Industrial EstateAdmiralty RoadInverkeithingKY11 1HZOur global addresses >Copyright © 2024 Intelligent Growth Solutions Limited. All rights reserved.Company registration number: SC440534Cookie PolicyPrivacy PolicyTerms and ConditionsEnvironmental policyEquality & Diversity policyGovernance\n\n\n"}]}