{"text": [{"https://impactshakers.com": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImpact Ecosystem | Impact Shakers\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageHomeEventsSummitLightning TalksIncubatorAcceleratorImpact AngelRaiseAwardsMicrofundVenturesCorporate Impact InnovationOur WorkResourcesOur ManifestoOur TeamIn the NewsGet InvolvedTackling Societal & Environmental Challenges Through Inclusive EntrepreneurshipYour Impact Ecosystem\nFrom Idea to ScaleWe connect, develop & invest.We believe entrepreneurship is the best vehicle for change but to tackle more complex problems through entrepreneurship we need more diverse entrepreneurs and we need to activate all of this underused problem-solving potential. \n \nWe built the Impact Shakers ecosystem to enable a systemic shift, to level the playing field and change the entrepreneurial narrative.\n \nWe do this by working with entrepreneurs AND investors on the complete lifecycle of impact businesses, from awareness raising into new ideas, business validation & growth up to exits. Get Involved\n\n\n\n\nImpact Shakers launches its venture fund\nof €20 million at the intersection of diversity & impactRead the Article\n\n\n\n\nIncubator#BEATINGTHEODDS is a 4-month fast-track incubator for underrepresented founders to launch their impact startup.Learn More\n\n\n\n\nAcceleratorA 6 month accelerator for underrepresented founders to grow and scale their impact business.Learn More\n\n\n\n\nImpact AngelA 6 week programme to help you get started with impact angel investing.\n​Learn More\n\n\n\n\nMicrofundAn independent investment vehicle in underrepresented founders.Learn More\n\n\n\n\nVenturesImpact Shakers Ventures invests in diverse founded impact startups.Learn More\n\n\n\n\nSummitStartup summit on the intersection of impact & diversityLearn More\n\n\n\n\nImpact Shakers in the NewsImpact Shakers launches €20m VC fund to back diverse founders\n Read the Article\n\n\n\n\nBelgium’s Impact Shakers Announces €20M Fund to Support Early-stage Startups in EuropeRead the Article\n\n\n\n\nBelgium's Impact Shakers launches €20M fund to support early-stage startups across EuropeRead the Article\n\n\n\n\nArchive\n\n\n\n\nOur PartnersGet in Touchhello@impactshakers.com© 2023 by Impact ShakersSubscribe to our newsletter:SubscribeThank you for your subscription!bottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.impactshakers.com/events": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEvents | Impact Shakers\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageHomeEventsSummitLightning TalksIncubatorAcceleratorImpact AngelRaiseAwardsMicrofundVenturesCorporate Impact InnovationOur WorkResourcesOur ManifestoOur TeamIn the NewsGet InvolvedWhere to meet usTech BBQCopenhagen, DK10 - 13 September\n\n\n\n\nPYM Belgium Impact DayBrussels, BE25 September\n\n\n\n\nThe Ethical AssemblyLisbon, PT2 - 3 October\n\n\n\n\nImpact Week 2024Barcelona, ES6 - 7 November\n\n\n\n\nWeb SummitLisbon, PT11 - 15  November\n\n\n\n\nSME AssemblyBudapest, HU18 - 20 November\n\n\n\n\nImpact Week 2024Bilbao, ES27 - 29 November\n\n\n\n\nEventsIn the past years, we have been organising ad hoc events in cities across Europe.\nWe would like to make them more known, accessible and regular.Archive\n\n\n\n\nImpact DinnersInvite-only Intimate Dinners with Impact Leaders across Europe\n​\nCurrent cities: Brussels, London, Lisbon, Ghent, Hamburg\n​Sign up here\n\n\n\n\nto receive an invite in your cityMicrofund Member MeetupsMicrofund-Member only events in cities across Europe\n​\n​\n​\n​Learn more\n\n\n\n\nabout the Microfund hereImpact Shakers SummitIn May 2023 we organised the first Impact Shakers Summit together with +70 impact ecosystem builders, +50 impact investors, +400 attendees, +400 pitching applicationsNewsletter \n\n\n\n\nFollow us via our newsletterLinkedIn\n\n\n\n\nand LI to see what’s next!Get in Touchhello@impactshakers.com© 2023 by Impact ShakersSubscribe to our newsletter:SubscribeThank you for your subscription!bottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.impactshakerssummit.com/": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nImpact Shakers Startup Summit\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageHomeSpeakersScheduleBelgian Entreprenoires Pitching CompetitionFinalistsPrizesPracticalGet InvolvedAboutBuy a Ticket\n\n\n\n\nImpact Shakers Summit\n\n\n\n AboutThe Future is\nInclusive & SustainableJoin the first European startup event focusing on \ninclusive entrepreneurship and impact!\n \nThe Summit will unite all innovation ecosystem players working towards an inclusive & sustainable future.May 5th 2023\nBrussels, Belgium\n You were amazing!Would you like to engage\nmore with Impact Shakers?Impact Angel ProgrammeBecome part of the solutionIn our virtual 6 week programme we help you get started with angel investing in a safe environment and we teach you how to apply an impact lens to your angel investments. \n​\nAs an impact angel, you can align your investments with your purpose while supporting founders & businesses that work towards building a better world. Making it an excellent way to make your money matter.\n \nIn 6 weeks of online sessions, you'll learn alongside value-driven angels from the Impact Shakers Venture team & guests.Apply Before July 1st\nto get the Early Bird RateMore Info\n\n\n\n\nMicrofundMake your Money MatterJoin the Impact Shakers Microfund and help to finance businesses with a positive impact on people and planet.\n​\nThe Microfund exists to:1Provide capital and expertise to exceptional diverse impact founders who don’t have friends & family with tens of thousands of Euros to spare to invest in their venture at the early stage2Create an inclusive community of diverse change makers and Impact Shakers, who would like to put their money where their values areMore Info\n\n\n\n\n\"This Impact Shakers Summit allows impact players -or shakers as you call them - to exchange and meet. That’s essential because YOU are the ones creating the economy of tomorrow and, it is together that we will make our dream become the reality of tomorrow.\"Barbara TrachteSecretary of State of the Brussels-Capital Region, responsible for Economic Transition and Scientific ResearchNETWORK & CONNECTThis Summit is the opportunity to bring the movers and shakers building the inclusive impact economy together in person for the first time! \n \nImpact leaders from all corners of Europe and all types of stakeholders will meet to connect, network and build together.CELEBRATE & SHOWCASEThe event will celebrate the European impact startup ecosystem.\n \nIt will showcase underrepresented entrepreneurial talent and visionary sustainable solutions. \n \nThere are so many impressive impact businesses in Europe, let’s give them the right stage to share and accelerate their growth! AMPLIFY & BUILDIt is time to join forces! Startups, investors, academia, corporate & governmental impact leaders will link up with each other. \n \nThe Summit will facilitate the amplification of their impact and will offer them opportunities to build new and inclusive alliances.\"Respect, vision, smiles, curiosity, sense of purpose: an instant community by design…\"Imène MaharziSenior Adviser, INDEFI Sustainable FinanceInstead of ripples,\nlet’s make waves togetherInspiring\nLightning TalksInteractive\nPanel DiscussionsImpact Leaders RoundtablesBelgian\nEntreprenoires MarketPitching CompetitionMatchmakingImpact Capital contributes actively to solutions for some of the world’s most pressing challenges and offers financial as well as impact returns. \nThe spectrum of impact capital solutions is growing rapidly and impact investors are at the forefront of capital innovation.\nNew instruments are being created at a high pace and by changing how financing\nworks they are contributing to systemic change. IMPACT CAPITALNew economic thinking leads the way to regeneration. To accelerate the transition to the new economy, we need to integrate new thinking like doughnut economics, regenerative economy, climate financing, sustainability, circular economy, impact measurement and management, wellbeing, diversity, equity and inclusion and many more into the way we build businesses.\nIt is no longer enough to not do harm, we need to actively work on regeneration.IMPACT ECONOMYIMPACT INFRASTRUCTUREIn order to realise the economic transition, we need to build the impact infrastructure that will enable this transition.\n \nWe will need to not only invest in and work on the “sexy”, visible solutions like sustainable energy and modes of transport, we will also need to build an operational structure that is rooted in inclusive entrepreneurship and inclusive partnerships across verticals that represent the “operations department” of the economyWho is coming?IMPACT STARTUPS &\nSCALEUPSIMPACT ECOSYSTEM BUILDERSIMPACT INVESTORSCORPORATE IMPACT LEADERSPOLICY IMPACT LEADERSACADEMIAPitching Competition\n2023Calling all European headquartered impact startups with diverse founding teams!Applications Closed\n\n\n\n\n\"A conference that feels more like a friends reunion than another work summit\"Laura-Jane SilvermanHead of LSE GenerateSome of our SpeakersBabusi NyoniFounder & CEOSila Health, NLDr Audrey-Flore NgomsikFounder & CEOTrianon Scientific Communication, BELuisa FerreiraHead of Social ProgrammeEIB Institute, LUPriscilla BoiardiCoordinatorOECD OCDE, FRFernando CabralChief Venture GrowthDjassi Africa, UKCarmen PumariñoInvestment DirectorZubi Capital, ESDiane DelavaSenior Project ManagerImpact Finance Belgium, BEAurélie MulowaFounderBelgian Entreprenoires, BEDavid DessersFounding PartnerCresco, BEJacqueline van den EndeCo-founder & CEOCarbon Equity, NLLeslie KapinDirector of Impact and SustainabilityAstanor, BEImène MaharziSenior AdvisorINDEFI Sustainable Finance, FRAgnieszka WojdyrPolicy OfficerEuropean Commission, BEGuus van PuijenbroekDirector Strategic & Family MattersVP Capital, NLAlina KlarnerHead of VenturesImpact Shakers, BERita CasimiroPartnerMaze X, PTYama SarajEntrepreneur / Founder & CEOTERN / SensAI Technologies, FREva SadounCo-founder / chairwomanLITA.co, FRHannah WheatleyAssociate DirectorAcumen, UKSissel HansenFounder & CEOStartup Guide, DKAll Speakers\n\n\n\n\nIn the NewsVenturing Women Podcast Live Recorded at the\nImpact Shakers SummitListen to the Podcast\n\n\n\n\nFour fresh impact-led enterprise ideas from the Impact Shakers SummitRead the Article\n\n\n\n\nThe Editors' Post: The problem is the pipe, not the pipelineRead the Article\n\n\n\n\nJoin The Summit as a PartnerInterested in learning more about partnership opportunities?\nLeave your contact details and we'll be in touch soon!Learn More\n\n\n\n\nThe Summit is made possible\nby the support of our partners ❤Ecosystem PartnersInvestors\n\n\n\n\nMedia PartnersStay Updatedhello@impactshakers.comSubscribe to our newsletterSubscribeThanks for subscribing!© 2023 by Impact Shakers\n\n\n\n\n\n\n\nbottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.impactshakers.com/lightningtalks": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLightning Talks | Impact Shakers\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageHomeEventsSummitLightning TalksIncubatorAcceleratorImpact AngelRaiseAwardsMicrofundVenturesCorporate Impact InnovationOur WorkResourcesOur ManifestoOur TeamIn the NewsGet InvolvedLightning TalksAt the Impact Shakers Summit, 17 Impact Leaders took the stage to inspire a more inclusive and sustainable future. \n \nThese are the Lightning Talks. Fernando CabralLinkedIn\n\n\n\n\nAFROPRENEURS\nState of Black Founders \nin Portugal & EuropeWatch the Talk\n\n\n\n\nHannah ThomsonLinkedIn\n\n\n\n\nThe Joy of\nIntergenerational\nco-creationWatch the Talk\n\n\n\n\nMoh Al-HaifiLinkedIn\n\n\n\n\nThe Next Generation of Marketing is Regenerative\n​Watch the Talk\n\n\n\n\nRumbi MakangaLinkedIn\n\n\n\n\nWe are not who we\nthink we are\n​Watch the Talk\n\n\n\n\nDr Audrey-Flore NgomsikLinkedIn\n\n\n\n\nRegenerative Sustainability - The New Sustainable?​Watch the Talk\n\n\n\n\nSissel HansenLinkedIn\n\n\n\n\nHow to Implement Solutions Locally, and Scale it GloballyWatch the Talk\n\n\n\n\nBruno DeleprierreLinkedIn\n\n\n\n\nThe only thing that \ndoesn't change, is change\n​\n​Watch the Talk\n\n\n\n\nEva SadounLinkedIn\n\n\n\n\nSlow and steady wins the race: Why hyper growth is not the Holy Grail\n​Watch the Talk\n\n\n\n\nYama SarajLinkedIn\n\n\n\n\nNewcomers in Business: Empowering the Entrepreneurial Potential of Refugees and MigrantsWatch the Talk\n\n\n\n\nEmiliano GutiérrezLinkedIn\n\n\n\n\nA fresh take on vertical farming\n​\n​\n Watch the Talk\n\n\n\n\nAlain BoribonLinkedIn\n\n\n\n\nPermaculture financing\n​\n​\n​\n​Watch the Talk\n\n\n\n\nSuzanne JenkinsLinkedIn\n\n\n\n\nFacing what you don't know: How collaboration can develop talent for complex societal challengesWatch the Talk\n\n\n\n\nFederico CristoforoniLinkedIn\n\n\n\n\nThe State of Climate Tech\n​\n​\n​Watch the Talk\n\n\n\n\nGerrit Jan van 't VeenLinkedIn\n\n\n\n\nAdopting a new narrative for talking about entrepreneurial success\n​Watch the Talk\n\n\n\n\nHeidrun TwestenLinkedIn\n\n\n\n\nThe most undervalued x-factor: Your startup's equity story is the easiest value driver!Watch the Talk\n\n\n\n\nAlina KlarnerLinkedIn\n\n\n\n\nImpact starts with you\n​\n Watch the Talk\n\n\n\n\nBabusi NyoniLinkedIn\n\n\n\n\nSmall Talk. Big Impact. Using AI to increase access to Healthcare in Africa.Watch the Talk\n\n\n\n\nGet in Touchhello@impactshakers.com© 2023 by Impact ShakersSubscribe to our newsletter:SubscribeThank you for your subscription!bottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.impactshakers.com/accelerator": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAccelerator | Impact Shakers\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageHomeEventsSummitLightning TalksIncubatorAcceleratorImpact AngelRaiseAwardsMicrofundVenturesCorporate Impact InnovationOur WorkResourcesOur ManifestoOur TeamIn the NewsGet InvolvedImpact Shakers\nAcceleratorA 6-month tailored accelerator for underrepresented founders in Europe to scale their impact startup.\n​\nCall Closed, will open again Fall 2024Get on the Radar\n\n\n\n\nScale Your Impact The Impact Shakers Accelerator is the heart of our Impact Shakers Ecosystem. It is where we work directly with exceptional founder teams and connect them to our own impact investment vehicles, as well as to our partner ecosystem. \n \nBecause we are serious about driving systemic change, we will invest €150k in capital and support in your business as part of this programme. We are committed to giving you everything you need as a founder to scale your business AND your impact. \n​\nBuilding a successful business is hard and we know that you have a lot on your plate. That is why we make sure that our programme works for you, regardless of the stage you are at and the challenges you are facing. Let us help you grow and succeed in your mission to make a positive impact on people and the planet!\n​Our offerFounder CentricWe fund people.\n \nIn addition to investing €150.000 in equity & support, we back your growth and wellbeing. We design your personal and business development path together. Our programme shapes itself around your needs. Our Impact EcosystemWe have built a leading impact ecosystem over the past years and invite you to join and benefit from the support 200+ partners can give you. \n​\nWe work with you to make sure you find a scaling and fundraising strategy that works for you and find the experts and impact investors that match your strategy.Hands on SupportWe become part of your team.\n \nWe've directly coached 500+ startups and catalysed €20M in capital. We know that creating systemic impact isn't chasing rainbows and found there is method to the madness. \n\nOur Impact Scaling Method is built on the lean startup methodology and incorporates inclusion, impact and wellbeing as core values. \"I had never met investors who not only truly “got” impact, but were as genuinely committed to it as the Impact Shakers team. From the terms in our formal agreements to the conversations, it’s just so refreshing to have investors who are challenging you to grow a business, but even more so, to grow your impact to the best and biggest it can be.\"Kimberley Abbott\nFounder & CEO Vested ImpactOur ApproachInclusive\nBusiness BuildingWe take an intersectional approach and work with teams that are diverse in gender, ethnic background, migration background, are differently abled, and LGBTQIA+. \n \nOur lens on inclusion also spans wider than the team. We help you look at your entire value chain, from suppliers to customers to partners and help you design impactful offerings from start to finish. Embedded ImpactFrom setting impact KPIs to measuring impact and stroytelling, we help you build your impact strategy & roadmap. \n​\nOur comfort zone is to relentlessly push the envelope on impact - and we know yours is too. \n \nTogether with you, we pioneer embedding impact as a way of doing business and provide you with professional coaching for you to become the impact leader you want to Wellbeing & CareWe understand that your health and wellbeing as a founder is critical to the success of your business.\n \nWe deeply care about you and embed safeguards for your wellbeing into our contracts and our ways of working. Our coaching and programme are setup to unlock your potential to the fullest - with the room to breathe.\n\n The ProgrammeWe combine what we know works for startupsAnd add what is needed for maximum impactWho we work withScalable impact solutionsClimate Tech\nImpact Infrastructure\nInclusion TechExceptional diverse foundersHQ in Europe (incl UK)Pre-Seed/Seed StageRaised less than €2MPortfolio\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOur Track RecordWe accelerated over 500 startupsWe helped startups raise over €20 millionAs underrepresented founders, we wanted our first cheque to come from an investor that understood the context of our journey so that they could support us adequately. We were blown away by Impact Shakers' mission and how they empower founders like us in our mission to build sustainable, and impactful companies.Babusi Nyoni\nFounder & CEO Sila HealthWhat we care aboutFounder FocusedWe invest in people. Your business will still change a lot and we invest in those that have the resilience and strength to steer it and their team into the future.Problems & MarketsWe love learning about the problem you want to solve and the market and your place in it. Teach us something new and we'll be the happiest and most curious kids in class.ImpactUnderstand the impact you want to make. You don't have to have a shiny impact model yet, we'll build one together and help you keep your mission in focus.Care about Your UsersIf you understand and care about the real pain points of your users and can offer them a solution, you're well on your way to building a successful business.TimingWe accept applications on a rolling basis, even before the deadline of 22 December 2023.\nThere are only 6 seats available, so apply now!\n\n\n\nApplications Open22 NovemberApplications Close\n\n\n\n22 DecemberUntil 31 January​Interviews\n\n\n\n\n\n\n\nSelection & SigningApril\n\n\n\nKick off MayTheir candid perspective as an investor and pragmatic guidance have greatly accelerated our understanding and progress toward achieving our fundraising goals for early next year.Lisa Stafford\nChief Executive Officer @ TAZAAROur PartnersFAQGet in Touchhello@impactshakers.com© 2023 by Impact ShakersSubscribe to our newsletter:SubscribeThank you for your subscription!bottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}]}