{"text": [{"https://inspirafarms.com": "\n\n\n\n\n\n\n\nInspiraFarms Cooling © | Pre-cooling and cold chain technology for fresh & perishables supply chains.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to content\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nSearch for:\n\n\n\n\n\n\n\n\nHomeProductsCold RoomsCold RoomsSmall Standard Cold RoomsPre-cooling solutionsPackhousesLong-term storageFreezer storageSlaughterhousesIndustriesFruitsVegetablesAnimal ProteinsFlowersPotato & OnionsTemperature-controlled warehousingFinanceLease-to-OwnServicesDataClientsCompanyAbout usOur TeamBlogImpactContact\n\n\n\n \n\n\n\n\n\n\nLoading...\n\n\n\n\n\n\n\nLooking for pre-cooling and cold chain solutions for your farm? \n\n\n\nGet in touch today with our cold chain experts to find the best solution for you  \n\n\nAsk for a quote now\nDownload brochure\n\n\n\n\n\n\n\n\n\n\n\nWe work with you to find the right cold chain solutions for your business \n\n\n\nContact us, our dedicated team of experts are here for you. \n\n\nAsk for a quote now\nDownload brochure\n\n\n\n\n\n\n\n\n\n\n\nTailored cooling solutions to meet your business needs, in every industry \n\n\n\nGet in touch today to discover our cold chain technology \n\n\nAsk for a quote now\nDownload brochure\n\n\n\n\n\n\n\n\n\n\n\nEfficient, safer, sustainable and connected cold chain, for every industry \n\n\n\nExplore how InspiraFarms Cooling can enhance your cold chain operations \n\n\nAsk for a quote now\nDownload brochure\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHomegludesign2023-07-14T14:03:28+00:00 \nWho we are\nInspiraFarms Cooling designs, develops, installs, services, and finances the best and most efficient precooling and cold chain technology for fresh fruit & vegetables, flowers, and animal protein supply chains in Africa and other emerging markets.\nWe provide agribusinesses of all sizes, exporters, 3PL, and food distributors with cooling solutions to handle their perishable products, that significantly cut energy costs, reduce food losses and meet major international food safety certifications.\nRead MoreWho we are\nInspiraFarms designs, develops and supplies modular and energy-efficient on-farm and close-to-farm cold rooms and packhouses for the horticultural sector in emerging markets, with a focus in African countries.\nWe provide agribusinesses, exporters, 3PL and food distributors with sustainable growth solutions for handling their fresh produce, that significantly cut energy costs, reduce food losses and come ready to meet the major international food safety certifications, and allows remote performance monitoring.\nRead MoreProducts\nCold Rooms\nCold Rooms\nPre-fabricated and modular facilities, with the best cooling features to maintain the core of perishable products at a predetermined low or medium temperature, according to their specific protocols on cold chain for the best quality possible.\nREAD MORE\nPre-cooling\nPre-cooling\nForced-air solutions for optimizing cooling performance by reducing cooling times by half or more, and removing field heat faster than other conventional cooling methods.\nREAD MORE\nPackhouses \nPackhouses\nPre-fabricated and modular facilities, designed and engineered tailored to the type of perishable product (fruits, vegetables, flowers), with best-in-class workflows, with the most efficient cooling and processing, for enhanced production capacity.\nREAD MORE\nLong-term storage\nLong-term storage \nPre-fabricated facilities designed and engineered for bulky crops and long-storage needs for root vegetables such as potatoes and onions, or for fruits that can be stored for many months such as apples and oranges.\nREAD MORE\nFreezing Rooms\nFreezing Rooms\nModular & energy-efficient freezer for managing temperatures down to -30°C, ideal to store consumable products for long periods, designed to boost stock longevity of perishable products, preserving stock through even temperature control.\nREAD MORE\nSlaughterhouses\nSlaughterhouses\nPre-fabricated and modular facilities, designed and engineered tailored to the type of animal protein (cattle, goats and sheep, pork, poultry) and their specific protocols on cold chain for the best quality possible.\nREAD MORE\n\nIndustries\n InspiraFarms ensures the best and most efficient cooling treatment of fresh products and perishables in the following industries:\nFruits\nVegetables\nFlowers\nPotato & Onion\nAnimal Protein\nTemperature Controlled Warehouses\nSee all industries\nValue-Added\n\n\n\n\nIoT\nDigitise your cold room or packhouse, take control and make more money from your produce with our real-time data monitoring system.\nREAD MORE\n\n\n\n\n\nFinancing\nOur preferred financing on repayment terms are Ideal for agribusinesses looking to invest in cold chain assets while keeping cash free for operations. \nREAD MORE\n\n\n\n\nAfter-sale Services\nOptimize the performance and reliability of all your refrigerated systems with our after-sales support packages, available across Eastern, Western and Southern Africa.\nREAD MORE\nClients\nSharon Cheboi2023-07-31T07:54:07+00:00\n\n\n\n\nKakuzi Plc, Kenya\n\n\n\n\nKakuzi Plc, KenyaSharon Cheboi2023-04-19T10:00:02+00:00\n\n\n\n\nLauetta Phase 2, Zimbabwe\n\n\n\n\nLauetta Phase 2, ZimbabwePaula Rodriguez2023-02-22T08:44:38+00:00\n\n\n\n\nLauetta Farm, Zimbabwe\n\n\n\n\nLauetta Farm, Zimbabwe\nDo you have questions or interested in starting a project?\nGet in touch with our local team today!\nContact nowDownload brochureStrategic Partnerships & Certifications\nBlog\n\n\n\n\n\n\n\n\n\nZimbabwe’s citrus grower AshFresh benefits from a cold room for export-grade fruits.\n\n\n\n\n\n\n\nZimbabwe’s citrus grower AshFresh benefits from a cold room for export-grade fruits.Sharon Cheboi2024-07-11T08:06:31+00:00July 11th, 2024| Zimbabwe’s citrus exporter benefits from efficient on-farm cold room for export-grade fruits. The Zimbabwean horticultural sector is growing rapidly in response to the increasing demand for fresh fruit and [...]Read More\n\n\n\n\n\n\n\n\n\n\nEffective cold rooms and packhouses for avocado export from Africa.\n\n\n\n\n\n\n\nEffective cold rooms and packhouses for avocado export from Africa.Sharon Cheboi2024-06-03T21:33:16+00:00June 2nd, 2024| Effective cold rooms and cooling techniques for avocado export. Cooling is the most important operation within the post-harvest chain, as this sets the parameters for fruit quality, as well [...]Read More\n\n\n\n\n\n\n\n\n\n\n5 benefits of acquiring a cold room through a lease-to-own model.\n\n\n\n\n\n\n\n5 benefits of acquiring a cold room through a lease-to-own model.Sharon Cheboi2024-04-28T13:39:49+00:00April 28th, 2024| 5 benefits of acquiring a cold room through a lease-to-own model. Limited finances are often a significant barrier to the adoption of on-farm cooling solutions, delaying the growth and efficiency of [...]Read More\n\nSubscribe to our newsletter!\nReceive updates of our technology, projects & clients\nSubscribe\n\n\n\n \n \n\n\n\n\n\nFollow Us\n\n\n\n\n\n\n \n\n Company Info\nTel:+44 (0) 20 3893 2420\ninfo@inspirafarms.com\n\n Get the latest InspiraFarms news & updates\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n  Subscribe \n\n\n\n\n\nInspiraFarms may use your contact information to contact you about our products and services. You may unsubscribe from these communications at anytime.\n\n \n\n Links\n\nAbout us\nProducts\nOur clients\nBlog\n\n\nPrivacy notice\nCookie policy\nSpeak Up\n\n\n \n\n \n\n \n \n \n\n\n\n\n\n\t\t© Copyright  InspiraFarms | All rights reserved. | Registration No: 08098061 | VAT No. GB164196985\r\nInspiraFarms Cooling is the trading name of Enterprise Projects Ventures Limited.\t\n\n\n\n \n \n \n \n\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis site uses cookies:  Find out more.Okay, thanks\n\n\n \n\n\nGo to Top\n\n\n\n\n"}, {"https://www.inspirafarms.com/products/": "\n\n\n\n\n\n\n\nInspiraFarms© Products: Cold Rooms | Packhouses | Pre-cooling | Freezers\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to content\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nSearch for:\n\n\n\n\n\n\n\n\nHomeProductsCold RoomsCold RoomsSmall Standard Cold RoomsPre-cooling solutionsPackhousesLong-term storageFreezer storageSlaughterhousesIndustriesFruitsVegetablesAnimal ProteinsFlowersPotato & OnionsTemperature-controlled warehousingFinanceLease-to-OwnServicesDataClientsCompanyAbout usOur TeamBlogImpactContact\n\n\n\n \n\n\n\n\n\n\n\n\n\nProductsgludesign22023-03-08T10:04:57+00:00 \nOur Products\nWhat we do\nInspiraFarms Cooling engineers and delivers the best and most efficient precooling and cold chain technology for fresh fruit & vegetables, flowers, and animal protein supply chains in Africa and other emerging markets. \nOur solutions are developed from an extensive agricultural background and from successfully becoming leaders of on-farm and first-mile cooling, from which we expanded to different cold chain assets. \nWe engineered our products to maximise the returns of our customers, and the potential social and environmental impact cold chain can generate.\nOur solutions are designed to ensure the best quality outcome and product life possible.\nASK FOR A QUOTE NOWInspiraFarms Cooling ensures the best quality and product life for every fresh & perishable product\n\nFor fruit and vegetables, our cold rooms, pre-coolers and packing houses ensure longer shelf-life and lower shrinkage while reducing operational costs and optimizing post-harvest logistics. We offer as well long-term storage and controlled atmosphere solutions. \nFor animal proteins, such as meat and fish, our solutions can provide slaughterhouses, as well positive and negative temperature storages for different stages of the supply chain, ensuring quality, efficiency, as well as health and safety. \n\n\n\n\nFor third party logistics, we offer solutions from 300 to 7,000+ pallets to support land, air, and sea freight. From cross-docking to terminals, leveraging high efficiency buildings and cooling, both above and below zero.\nFor small operations we provide a range of easy to deploy cold rooms from 15 to 60m2 ideal for small scale agriculture and local markets. \n\nOur Formula\nProducts\nCold Rooms\nCold Rooms\nPre-fabricated and modular facilities, with the best cooling features to maintain the core of perishable products at a predetermined low or medium temperature, according to their specific protocols on cold chain for the best quality possible.\nREAD MORE\nPre-cooling\nPre-cooling\nForced-air solutions for optimizing cooling performance by reducing cooling times by half or more, and removing field heat faster than other conventional cooling methods.\nREAD MORE\nPackhouses \nPackhouses\nPre-fabricated and modular facilities, designed and engineered tailored to the type of perishable product (fruits, vegetables, flowers), with best-in-class workflows, with the most efficient cooling and processing, for enhanced production capacity.\nREAD MORE\nLong-term storage\nLong-term storage \nPre-fabricated facilities designed and engineered for bulky crops and long-storage needs for root vegetables such as potatoes and onions, or for fruits that can be stored for many months such as apples and oranges.\nREAD MORE\nFreezing Rooms\nFreezing Rooms\nModular & energy-efficient freezer for managing temperatures down to -30°C, ideal to store consumable products for long periods, designed to boost stock longevity of perishable products, preserving stock through even temperature control.\nREAD MORE\nSlaughterhouses\nSlaughterhouses\nPre-fabricated and modular facilities, designed and engineered tailored to the type of animal protein (cattle, goats and sheep, pork, poultry) and their specific protocols on cold chain for the best quality possible.\nREAD MORE\n\nKey components\nStructures & Buildings\n\nCan be outdoor or indoor to better fit our customers’ needs. It only requires concrete flooring and, in most cases, a roof/shed. \nBuilt using dry construction solutions, steel structures and high-quality ISOPAN high-density polyurethane sandwich panels to ensure superior durability and maximize thermal insulation.The thickness of the panels, finishings and fittings, as well as door types vary depending to temperatures and room’s function.\nEquipped with corrugated steel roofs and gutters that allow ventilation and allow for the assembly of PV panels for solar hybrid cold rooms. \nAvailable solutions in light, medium and heavy steel carpentry, from 3 to 12+ meters of height, including roofing. \nFor indoor cold rooms or under an existing shed the structures are made of panels and profiles, and they can either be self-standing or hanged, depending on the dimensions of the individual room. \nFor below zero cold rooms, specific insulation arrangements should be built in the slab to prevent major damages to the slab and overarching building and require much thicker sandwich panels than rooms at positive temperatures.\nvariety of accessories such as sliding, roll-up and hinged cold room doors, bollards and railing.\nDoors, finishings, fittings and protections comply with BRC, ISO2200, and GLOBALG.A.P. in low, medium and high care facilities.\n\n\nCooling Technology\n\nBuilt with the highest European and global standards, with components from well-known manufacturers with a global network of spares distributors, such as Bitzer, Siemens and Danfoss to ensure reliability and serviceability of our solutions.\nRanges from 8 to 500+kW of thermal power capacity. Configured and set to maximize specific perishables quality, volumes and to minimize energy bills. Available either direct expansion and chiller-based cooling technology. \nServes a wide range of food chains, from fresh fruit & vegetables such as blueberries, avocado and green beans, to root vegetables such as potatoes and onions, or animal protein such as poultry, meat, fish, and non-food items such as fresh flowers, ornamentals and pharmaceuticals. \nFor fresh fruit, vegetables, and flowers we offer a range of pre-coolers, blast chillers, positive temperature cold storage and temperature-controlled processing and packing room. \nFor meat and fish we offer blast freezers and frozen storage machines. \nFor potatoes, onions and other crops suitable for long term storage, we offer long-term storage and controlled atmosphere solutions that includes ad hoc ventilation, gases and humidity control systems. \n\n\nIndustries\n InspiraFarms ensures the best and most efficient cooling treatment of fresh products and perishables in the following industries:\nFruits\nVegetables\nFlowers\nPotato & Onion\nAnimal Protein\nTemperature Controlled Warehouses\nSee all industries\nDo you have questions or interested in starting a project?\nGet in touch with our local team today!\nGet a quote\n\n\n\n \n \n\n\n\n\n\nFollow Us\n\n\n\n\n\n\n \n\n Company Info\nTel:+44 (0) 20 3893 2420\ninfo@inspirafarms.com\n\n Get the latest InspiraFarms news & updates\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n  Subscribe \n\n\n\n\n\nInspiraFarms may use your contact information to contact you about our products and services. You may unsubscribe from these communications at anytime.\n\n \n\n Links\n\nAbout us\nProducts\nOur clients\nBlog\n\n\nPrivacy notice\nCookie policy\nSpeak Up\n\n\n \n\n \n\n \n \n \n\n\n\n\n\n\t\t© Copyright  InspiraFarms | All rights reserved. | Registration No: 08098061 | VAT No. GB164196985\r\nInspiraFarms Cooling is the trading name of Enterprise Projects Ventures Limited.\t\n\n\n\n \n \n \n \n\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis site uses cookies:  Find out more.Okay, thanks\n\n\n \n\n\nGo to Top\n\n\n\n\n"}, {"https://www.inspirafarms.com/products/cold_room/": "\n\n\n\n\n\n\n\nCold rooms for fruit and vegetables | InspiraFarms Cooling©\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to content\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nSearch for:\n\n\n\n\n\n\n\n\nHomeProductsCold RoomsCold RoomsSmall Standard Cold RoomsPre-cooling solutionsPackhousesLong-term storageFreezer storageSlaughterhousesIndustriesFruitsVegetablesAnimal ProteinsFlowersPotato & OnionsTemperature-controlled warehousingFinanceLease-to-OwnServicesDataClientsCompanyAbout usOur TeamBlogImpactContact\n\n\n\n \n\n\n\n\n\n\n\n\n\nCold Roomsgludesign22023-03-06T13:56:40+00:00 \nCold rooms\nAbout our cold rooms\n\nfruit\n\n\nvegetables\n\n\nflowers\n\nonions - potatoes\nanimals\ncoldrooms\nBack to Products\nReduce shrinkage, extend shelf-life, and ensure maximum capture of the best quality possible.\nOur cold rooms allow maintaining the core of perishable products at a predetermined low or medium temperature, depending on the crop, variety, value chain requirements, and needs.\nEach solution is delivered with a specific configuration on temperature, pressure, relative humidity, and airflow to maintain freshness as quickly as possible.\nCold rooms and their specific functions, such as precooling, are the most important method for stabilizing perishables and guaranteeing the shelf-life needed to generate value for both producers (reducing claims and rejections), consumers (guaranteeing fresh produce), and citizens (reducing losses and waste).\nMost fruit and vegetables require rapid removal of field heat through pre-cooling to slow down the physiological activity and generate the needed shelf-life while minimizing the shrinkage (the water lost during the cooling process is very aggressive).\nFor most delicate and high-value crops, each hour of delay between the picking and the pre-cooling might represent over one day of shelf-life loss.\nFor flowers, as well as for high-value perishables, the rapid removal of field heat, the reduction of ethylene, and the management of the fungi-related risks when entering the cold chain are fundamental to achieving the expected shelf-life and price, especially when planning to shift from air to sea freight.\nFor animal proteins, cold storage represents a fundamental process for health and safety, extending shelf life and preventing oxidations that depreciate the value.\nFreezing processes can be carried out on specific machines or in blast-freezing rooms, dedicated cold rooms that, following industry standards, allow to freeze the animal proteins without altering the structure of the fibers and therefore the value for final consumers.\nASK FOR A QUOTE NOW\nStructure\n\nThe cold room structure is a modular solution, built in 5 x 5 meters modules, easily expandable so it can grow with our customers needs. It is built with laser cut steel and hot-dip galvanized after welding to guarantee maximum durability in harsh environments.\nWalls and ceilings are made of high density closed cells PUR (Polyurethane) cold room sandwich panels to ensure superior durability and energy efficiency in any climatic conditions.\nThe full structure is lightweight, expandable, and fast and easy to install. Completely self-standing and can grow in modules of 25 m², offering dimensions ranging from 25 to 1,000m² and more, with 3 meters height.\nIn-door and outdoor solutions are available that can be installed in your farm or everywhere.\n\nCooling equipment\n\n\nAvailable in either direct expansion or chiller-based cooling technology.\n\n\nRanges from 8 to 500+kW of thermal power, determined according to the type of product and volumes to be cooled.\n\n\nConfigured and set to maximize specific perishables quality and to minimize energy bills.\n\n\nIt can be powered by grid-connected and hybrid solar solutions, with additional solutions for unreliable and unstable power grids.\n\n\nSimple installation, either outside or indoors (depending on system specifications).\n\n\nCan be complemented with forced-air precooling machinery for increasing the rate of cooling and dropping-down pulp temperature as quickly as possible. Solutions from 1 to 20 pallets, multiple units can be placed in the same room. \n\n\nLocal maintenance services packages are available for any cooling machine.\n\n\n\n\nBenefits of our cold rooms\n\n\nFlexibility\nYou can position a cold room almost anywhere there is space, in-door or out-door, on-farm or close-to-farm, offering prompt extraction of field heat and cold chains, facilitating significant reduction of losses and rejections.\n\n\nProduct specific\n Our solutions are designed following the perishable product specific protocols to offer the best cooling treatment of your perishable product. We offer our clients custom temperatures, relative humidity, airflows and pressure are tuned for specific requirements, enabling increase in quality and safety of our clients.\n\n\nFirst-mile\nOur cold chain technology can be placed on-farm or close-to-farm to offer prompt extraction of field heat and placing cold chains to start at the farm when it is required, facilitating significant reduction of losses and rejections.\n\n\nRevenues\nCooling is essential to reduce claim risks and increase revenues and off takers satisfaction. With reduced shrinkage and increased shelf-life, our clients can have the possibility to shift from airfreight to sea freight reducing cost by unit of produce, increasing revenues and helping emission reduction.\n\n\nTurnkey\nInspiraFarms is a one stop shop solution. Every component required to build the cold room fits in a single container. Our clients can avoid hiring an architect, an engineer, a cold room panel supplier, a cold room machinery supplier, electricians, compliance technician, and then coordinate them.\n\n\n\nFAQs about Cold Rooms\nWhat is the capacity of InspiraFarms cold rooms?\n\nOur cold rooms range from a minimum of 10 pallets to a maximum of over 1,000 pallets\n\nWhat is the smaller dimension and capacity of an InspiraFarms cold room?\n\nThe smaller dimension of our cold rooms is 15m², with a storage capacity of approx. 8 to 10 pallets (1.0 x 1.2 meter). It is equivalent to a 20’ reefer container, but with pre-cooling capabilities and 40% more efficient. The following standard sizes are 30m² and 60m².\n\nHow are InspiraFarms cold rooms powered?\n\nOur cold rooms are powered by three-phase electric power (for smaller units in the range single-phase is possible, up to 7 kW of cooling capacity). The power can be from grid only or from a mix of grid, solar and diesel back-up\n\nWhich fresh products can InspiraFarms cold rooms store?\n\nOur cooling solutions can be designed and delivered for any use case, fresh fruit and vegetables, animal products (meat, poultry, fish, dairy), bakery, and non-food products such as pharmaceuticals. Inspirafarms cooling solutions can pre-cool, cold store, and frozen.\n\nCan I use reefers as cold rooms or precoolers?\n\nReefer containers are designed to hold a specific temperature while in trucks or ships but they are not meant to precool. They miss the airflow control needed to treat fruit and vegetables. It is possible, but with a small fraction of the maximum allowed volume. Reefers available in most African countries have low coefficient performance compared to our equipment When they have been used for years, that coefficient performance lowers, bringing up the energy bill substantially. Read more in this article \n\nAre InspiraFarms cold rooms suitable for storing meat, fish or any animal product?\n\nYes, both chilled (above 0°C) and frozen (-18°C to -24°C).\n\nDoes InspiraFarms cold room have freezing/frozen capabilities?\n\nInspiraFarms Cooling also delivers frozen projects from 0°C to -24°C. Our cooling solutions can be designed and delivered for any use case, such as fresh fruit and vegetables, animal products (meat, poultry, fish, dairy), bakery, and non-food products such as pharmaceuticals.\n\nWhat do I need to have on site for having installed an InspiraFarms cold room?\n\nA three-phase grid connection, a concrete slab and an access road for a truck with a container trailer. The specifics about foundations, concrete work, slab insulation and finishing are operation and site specific. The concrete slab is part of the civil works and we therefore ask our clients to prepare before the deployment and assembly of our units. InspiraFarms provides guidance to customers on how to approach these civil works.\n\nHow InspiraFarms cold rooms are delivered?\n\nOur cold rooms are delivered containerized in a kit. Everything is delivered as part of the same consignment. From the structural part to the finishing and fittings. Following the site survey, a local engineer and contractor will be required to fit the cold room.\n\nWhat is the best temperature of a cold room?\n\nThe ideal temperature of a cold room depends on the product, the stage of the supply chain and the target market. It is important to understand that temperature is not a key indicator of what is needed to treat fruit and vegetables. You can have a room with air temperature at 2°C and still have the pulp temperature of your fruit at 20°C for days.\n\nWhat is the energy consumption of an InspiraFarms cold room?\n\nIt will depend on the size and capability of the cooling machine, for which we offer ranges from 8 to 100+kW of thermal power according to the type of crop and the cycle time. For example, cooling down one kg of a climacteric fruit might require as much as 10 times the energy it is required to keep it cool. Cold rooms for avocados for example require a lot of cooling power and a specific airflow. To cool down 10,000 kg of avocados, a minimum of 25 kW of cooling power is required. Enquire from us for more detailed answers for specific crops.\n\nDoes a cold room need ventilation?\n\nYes, it does. All cold rooms need ventilation. Most of the ventilation is provided by daily door openings. InspiraFarms can provide air refreshment systems (with 80-85% heat recovery) if needed to avoid build up of specific gases.\n\nHow do you insulate a cold room?\n\nCold rooms are insulated by using sandwich panels. Our cold room panels are made of high density PUR (Polyurethane) to maximize the thermal insulation and grant our clients lower energy bills. Most companies in Africa are still using EPS (Styrofoam), but for the same thickness you get half the insulation from EPS. In addition, EPS is increasingly rejected by higher quality and value chains for the health and safety hazards they bring. Sub-optimal insulation can result in high energy bills, supply chain issues such as rejections and microbiological issues caused by condensation.\n\nCan the cold room be moved once installed?\n\nYes, our modular cold rooms can be moved, although it’s a good idea to get the experts to do it. Trying to move the unit yourself would usually invalidate any warranty. The units are not mobile. For re-assembling you will need to have the civil works ready in the new site.\n\nWhat is the price of a cold room?\n\nIt depends on the size of the cold room, the range (out-door or in-door), and the cooling capacity. For a price estimation please fill out this form.\n\nWhich countries you deliver to?\n\nWe are mostly focused on African markets. All our cold rooms can be delivered to any country in the following regions: East Africa, West Africa & Southern Africa. We have cold rooms delivered in Kenya, Rwanda, Ethiopia, Zimbabwe, Zambia, Mozambique, Ghana, Benin, Morocco & South Africa. Also, we have delivered in Central & South America.\n\nClients\nSharon Cheboi2023-04-19T10:00:02+00:00\n\n\n\n\nLauetta Phase 2, Zimbabwe\n\n\n\n\nLauetta Phase 2, ZimbabweSharon Cheboi2023-07-31T07:54:07+00:00\n\n\n\n\nKakuzi Plc, Kenya\n\n\n\n\nKakuzi Plc, KenyaSharon Cheboi2023-04-18T09:05:17+00:00\n\n\n\n\nWiserow Enterprises, Zimbabwe.\n\n\n\n\nWiserow Enterprises, Zimbabwe.Do you have questions or interested in starting a project?\nGet in touch with our local team today!\nGet a quote\n\n\n\n \n \n\n\n\n\n\nFollow Us\n\n\n\n\n\n\n \n\n Company Info\nTel:+44 (0) 20 3893 2420\ninfo@inspirafarms.com\n\n Get the latest InspiraFarms news & updates\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n  Subscribe \n\n\n\n\n\nInspiraFarms may use your contact information to contact you about our products and services. You may unsubscribe from these communications at anytime.\n\n \n\n Links\n\nAbout us\nProducts\nOur clients\nBlog\n\n\nPrivacy notice\nCookie policy\nSpeak Up\n\n\n \n\n \n\n \n \n \n\n\n\n\n\n\t\t© Copyright  InspiraFarms | All rights reserved. | Registration No: 08098061 | VAT No. GB164196985\r\nInspiraFarms Cooling is the trading name of Enterprise Projects Ventures Limited.\t\n\n\n\n \n \n \n \n\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis site uses cookies:  Find out more.Okay, thanks\n\n\n \n\n\nGo to Top\n\n\n\n\n"}, {"https://www.inspirafarms.com/products/small-cold-rooms/": "\n\n\n\n\n\n\n\nSmall Standard Cold Rooms for Agribusiness | InspiraFarms©\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to content\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nSearch for:\n\n\n\n\n\n\n\n\nHomeProductsCold RoomsCold RoomsSmall Standard Cold RoomsPre-cooling solutionsPackhousesLong-term storageFreezer storageSlaughterhousesIndustriesFruitsVegetablesAnimal ProteinsFlowersPotato & OnionsTemperature-controlled warehousingFinanceLease-to-OwnServicesDataClientsCompanyAbout usOur TeamBlogImpactContact\n\n\n\n \n\n\n\n\n\n\n\n\n\nSmall Cold Roomsgludesign2023-03-02T11:24:11+00:00 \nSmall Cold Rooms\nSmall standard cold rooms\n\nfruit\n\n\nvegetables\n\n\nflowers\n\nonions - potatoes\nanimals\ncoldrooms\nBack to Products\nEasy to install, self-standing, and affordable cooling solutions for farms and cold chain operations up to 8,000 kg/day of cooling or 20,000 kg/day of storage.\nThe small standard cold rooms range is suitable for small farmers and out-growers, with small-medium scale operations and storage needs.\nIt is built with the best materials, components, and cooling technologies to enable the best possible cooling treatment for any perishable product and it comes with a coefficient performance that can be as high as twice as much as a reefer, allowing our customers to greatly reduce their energy bills.\nThey are designed and built to treat any fresh produce, ranging from fresh fruit, vegetables, and herbs.\nDepending on your capacity and expansion needs, they are also designed to be modular, meaning that they can be expanded with your growing business needs. They come in standardized ranges of 15, 30 & 60 m², each with optional add-ons, including real-time data monitoring, humidifiers, solar kit, and more.\nASK FOR A QUOTE NOW\nModels & dimensions\nMaterials & Components\n\nBuilt using high-quality ISOPAN high density polyurethane sandwich panels of 100 mm thick for walls & ceilings, ensuring superior durability and to maximize thermal insulation.\nIt can be outdoor or indoor to better fit our customers’ needs. It only requires concrete flooring and a roof/shed.\nMaterials allow for 15-20 years of useful life when units are provided with proper regular maintenance.\nIt comes with a hinged door manually operated, with dimensions of 1,300 x 2,500 mm (WxH), and made with high density polyurethane foam, with high insulating performance\nDelivered with an electric kit composed of Internal LED lights, and cables and trunking for all sensors.\nReal-time monitoring system with unlimited data on temperature, humidity, energy consumption, voltage, door opening, CO₂, ethylene and more.\n\nCooling Equipment & Add-ons\n\nConfigured and set to maximize specific perishables quality and to minimize energy bills.\nCooling machine is a monoblock, with ranges from 5kW to 18kW of cooling power. Enables the best possible cooling treatment from the pre-cooling of 1,500 kg/cycle of high value crops to 22,000 kg of storage of palletised and already chilled produce. Room temperature +0°C to 5°C.\nForced-air precooling machinery can be added for increasing the rate of cooling and dropping-down pulp temperature as quick as possible.\nGrid-tied solar kits can be added for ensuring up to 80% energy cost savings as well as up to 80% emissions reduction, depending on the grid mix. Four electric loads available.\nHumidifiers can be added to maintain the relative humidity in the cold room, minimizing dehydration & produce shrinkage.\nA single main board can be added for protecting and controlling circuits of all electronic equipment (cooling machinery, photovoltaic etc) with cable & trunking.\nA weather station can be added to monitor solar radiation, external temperature, humidity, rainfall sensor, all fixed on a pole.\n\n\n\n\nBenefits \n\n\nFlexibility\nYou can position a cold room almost anywhere there is space, in-door or out-door, on-farm or close-to-farm. They can be adaptable for pre-cooling and cold storage.\n\n\nVersality\nDesigned and built to treat any fresh produce, with the possibility of setting temperatures, relative humidity, airflows and pressure for specific requirements, enabling increase in quality and safety of our clients.\n\n\nModularity\nThe units can be expanded with the business when needed. \n\n\nEfficiency\nHigh thermal insulation performance, energy efficient design and machinery with remote monitoring which reduces energy bills and OPEX \n\n\n\nFAQs about Cold Rooms\nWhat is the capacity of InspiraFarms cold rooms?\n\nOur small standard cold rooms range offers a capacity  from a minimum of 9 pallets to a maximum of over 32 pallets\n\nWhat is the smaller dimension and capacity of an InspiraFarms cold room?\n\nThe smaller dimension of our cold rooms is 15m², with a storage capacity of approx. 9pallets (1.0 x 1.2 meter). It is equivalent to a 20’ reefer container, but with pre-cooling capabilities and is 40% more efficient. The following standard sizes are 30m² and 60m².\n\nHow are InspiraFarms cold rooms powered?\n\nOur cold rooms are powered by three-phase electric power (for smaller units in the range single-phase is possible, up to 7 kW of cooling capacity). The power can be from grid only or from a mix of grid, solar and diesel back-up\n\nWhich fresh products can InspiraFarms cold rooms store?\n\nOur cooling solutions can be designed and delivered for any use case, fresh fruit and vegetables, animal products (meat, poultry, fish, dairy), bakery, and non-food products such as pharmaceuticals. Inspirafarms cooling solutions can pre-cool, cold store, and frozen.\n\nCan I use reefers as cold rooms or precoolers?\n\nReefer containers are designed to hold a specific temperature while in trucks or ships but they are not meant to precool. They miss the airflow control needed to treat fruit and vegetables. It is possible, but with a small fraction of the maximum allowed volume. Reefers available in most African countries have low coefficient performance compared to our equipment When they have been used for years, that coefficient performance lowers, bringing up the energy bill substantially. Read more in this article.\n\nAre InspiraFarms cold rooms suitable for storing meat, fish or any animal product?\n\nYes, both chilled (above 0°C) and frozen (-18°C to -24°C).\n\nDoes InspiraFarms cold room have freezing/frozen capabilities?\nInspirafarms also delivers frozen projects from 0°C to -24°C. Our cooling solutions can be designed and delivered for any use case, fresh fruit and vegetables, animal products (meat, poultry, fish, dairy), bakery, and non-food products such as pharmaceuticals.\nWhat do I need to have on site for having installed an InspiraFarms cold room?\n\nA three-phase grid connection, a concrete slab and an access road for a truck with a container trailer. The specifics about foundations, concrete work, slab insulation and finishing are operation and site specific. The concrete slab is part of the civil works and we therefore ask our clients to prepare before the deployment and assembly of our units. InspiraFarms provides guidance to customers on how to approach these civil works.\n\nHow InspiraFarms cold rooms are delivered?\n\nOur cold rooms are delivered containerized in a kit. Everything is delivered as part of the same consignment. From the structural part to the finishing and fittings. Following the site survey, a local engineer and contractor will be required to fit the cold room.\n\nWhat is the best temperature of a cold room?\n\nThe ideal temperature of a cold room depends on the product, the stage of the supply chain and the target market. It is important to understand that temperature is not a key indicator of what is needed to treat fruit and vegetables. You can have a room with air temperature at 2°C and still have the pulp temperature of your fruit at 20°C for days.\n\nWhat is the energy consumption of an InspiraFarms cold room?\n\nIt will depend on the size and capability of the cooling machine, for which we offer ranges from 8 to 100+kW of thermal power according to the type of crop and the cycle time. For example, cooling down one kg of a climacteric fruit might require as much as 10 times the energy it is required to keep it cool. Cold rooms for avocados for example require a lot of cooling power and a specific airflow. To cool down 10,000 kg of avocados, a minimum of 25 kW of cooling power is required. Enquire from us for more detailed answers for specific crops.\n\nDoes a cold room need ventilation?\n\nYes, it does. All cold rooms need ventilation. Most of the ventilation is provided by daily door openings. InspiraFarms can provide air refreshment systems (with 80-85% heat recovery) if needed to avoid build up of specific gases.\n\nHow do you insulate a cold room?\n\nCold rooms are insulated by using sandwich panels. Our cold room panels are made of high density PUR (Polyurethane) to maximize the thermal insulation and grant our clients lower energy bills. Most companies in Africa are still using EPS (Styrofoam), but for the same thickness you get half the insulation from EPS. In addition, EPS is increasingly rejected by higher quality and value chains for the health and safety hazards they bring. Sub-optimal insulation can result in high energy bills, supply chain issues such as rejections and microbiological issues caused by condensation.\n\nCan the cold room be moved once installed?\n\nYes, our modular cold rooms can be moved, although it’s a good idea to get the experts to do it. Trying to move the unit yourself would usually invalidate any warranty. The units are not mobile. For re-assembling you will need to have the civil works ready in the new site.\n\nWhat is the price of a cold room?\n\nIt depends on the size of the cold room, the range (out-door or in-door), and the cooling capacity. The small standard range is the most affordable line of cold rooms that InspiraFarms Cooling offers, ideal for small farmers and distributors.\n\nWhich countries you deliver to?\n\nWe are mostly focused on African markets. All our cold rooms can be delivered to any country in the following regions: East Africa, West Africa & Southern Africa. We have cold rooms delivered in Kenya, Rwanda, Ethiopia, Zimbabwe, Zambia, Mozambique, Ghana, Benin, Morocco & South Africa. Also, we have delivered in Central & South America\n\nClients\nSharon Cheboi2023-04-19T10:00:02+00:00\n\n\n\n\nLauetta Phase 2, Zimbabwe\n\n\n\n\nLauetta Phase 2, ZimbabweSharon Cheboi2023-07-31T07:54:07+00:00\n\n\n\n\nKakuzi Plc, Kenya\n\n\n\n\nKakuzi Plc, KenyaSharon Cheboi2023-04-18T09:05:17+00:00\n\n\n\n\nWiserow Enterprises, Zimbabwe.\n\n\n\n\nWiserow Enterprises, Zimbabwe.Do you have questions or interested in starting a project?\nGet in touch with our local team today!\nGet a quote\n\n\n\n \n \n\n\n\n\n\nFollow Us\n\n\n\n\n\n\n \n\n Company Info\nTel:+44 (0) 20 3893 2420\ninfo@inspirafarms.com\n\n Get the latest InspiraFarms news & updates\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n  Subscribe \n\n\n\n\n\nInspiraFarms may use your contact information to contact you about our products and services. You may unsubscribe from these communications at anytime.\n\n \n\n Links\n\nAbout us\nProducts\nOur clients\nBlog\n\n\nPrivacy notice\nCookie policy\nSpeak Up\n\n\n \n\n \n\n \n \n \n\n\n\n\n\n\t\t© Copyright  InspiraFarms | All rights reserved. | Registration No: 08098061 | VAT No. GB164196985\r\nInspiraFarms Cooling is the trading name of Enterprise Projects Ventures Limited.\t\n\n\n\n \n \n \n \n\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis site uses cookies:  Find out more.Okay, thanks\n\n\n \n\n\nGo to Top\n\n\n\n\n"}, {"https://www.inspirafarms.com/products/precooling-solutions/": "\n\n\n\n\n\n\n\nPre-cooling solutions for fruit & vegetables | InspiraFarms©\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to content\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\nSearch for:\n\n\n\n\n\n\n\n\nHomeProductsCold RoomsCold RoomsSmall Standard Cold RoomsPre-cooling solutionsPackhousesLong-term storageFreezer storageSlaughterhousesIndustriesFruitsVegetablesAnimal ProteinsFlowersPotato & OnionsTemperature-controlled warehousingFinanceLease-to-OwnServicesDataClientsCompanyAbout usOur TeamBlogImpactContact\n\n\n\n \n\n\n\n\n\n\n\n\n\nPre-cooling solutionsgludesign22023-03-06T14:07:26+00:00 \nPre-cooling\nAbout our pre-cooling solutions\n\nfruit\n\n\nvegetables\n\n\nflowers\n\nonions - potatoes\nanimals\ncoldrooms\nBack to Products\nOptimize cooling performance by reducing cooling times by half or more, and removing field heat faster than other conventional cooling methods.\nWe offer the most advanced and affordable range of pre-coolers and blast chillers in Africa. Whether you are a flower exporter or a fruit wholesaler, stabilizing product temperature as quickly as possible is fundamental for your performance.\nForced-air pre-cooling or blast chilling is the process of quickly removing heat to decrease the temperature rapidly to the expected core temperature of the fresh produce. Pre-cooling speeds up the cooling to make it reach every package on a pallet, crate or bin.\nOur blast chillers and forced air pre-coolers are portable machines that can be placed in any cold room, enabling our customers to drop down the temperature of cut flowers or the pulp temperature of crops as quickly as possible, while minimising shrinkage, damages, and claims.\nPre-cooling is regarded as an indispensable first step by many regions like Europe, and it is a key step for products such as Blueberries, Avocados, Green Beans, Brussels Sprouts, Cherries, Cucumbers, Grapes, Honeydews, Kiwi, Nectarines, Okra, Bell Peppers, Plums, Summer Squash, Strawberries, Tomatoes, flowers and more.\nAlthough certain crops can be stored without pre-cooling, many farmers and exporters, aiming towards the best results, practice pre-cooling as an integral part of their post-harvest management.\nASK FOR A QUOTE NOW\nPre-cooling Technology\nOur pre-coolers or blast chillers use a forced-air system, that offers a range of pressures up to 300pa and adjustable airflows, matching with a range of cooling machines and, to treat up to 10 pallets of product (depending on the crop and other conditions).\nThe forced-air system consists of a fan, that when turned on, pulls or forces the airflow on the center section between the pallets, removing the heat through convection. The airflow is optimised and the time span for the temperature drop of the produce is significantly shortened.\nA tarp included in the system is laid across the top and back of the stockage, allowing sealing and keeping the flow of cold air through the product, rather than around it.\nSuction box\nFeatures\n\nThe best solution for flowers and berries.\nModular, start from one and expand out.\nProvides the flexibility to cool down each pallet independently.\n 3,000m3/h – 150Pa.\nElectronic Fans NO STARTING CURRENT.\nMotorized roll-up tarp.\nEasy to move.\nEasy to connect to any AC power socket.\n Single phase.\nSmart controller integrated.\n\nFAP 6\nFeatures\n\nCovers a wide range of fresh products\nEasy to place and move\nCool down up to 6 pallets at a time\nProvided with inverter-driven engine and pressure sensors to optimise treatment and minimise power use\n20,000m3/h – 150Pa\nElectronic Fans NO STARTING CURRENT\nEasy to connect\nSmart controller integrated\nAdjustable speed\nManual tarping system\nPillows designed to minimise pressure drops\nEasy to install and maintain\nBest performance when matched with InspiraFarms cooling machines, humidifiers, and data system\n\nFAP 12\nFeatures\n\nCovers a wide range of fresh products\nEasy to place and move while extremely powerful\nProvided with inverter-driven engine and pressure sensors to optimise treatment and minimise power use, cool down half a reefer at a time\nCool down up to 12 pallets at a time\n30,000m3/h – 150Pa\nAdjustable speed\nThree phase\nSmart controller integrated\nEasy to move\nManual tarping system\nPillows designed to minimise pressure drops\nEasy to install and maintain\nBest performance when matched with InspiraFarms Cooling machines, humidifiers, and data system\n\n\n\nBenefits \n\n\nPortable & flexible\nSolutions to pre-cool from 1 to 20 pallets. Machinery easy to place and move, with simple installation and energy-efficient operation. Multiple units can be placed in the same room. Suitable for existing cold rooms as well.\n\n\nIncreases cooling performance\nForced air-cooling can reduce cooling times in half or more, compared to air room cooling.\n\n\nReduces costs\nForced-air pre-cooling effectively increases shelf life by removing field heat faster than other conventional cooling methods. Rapid on-farm pre-cooling allows lower shrinkage of the produce and therefore higher and quick product turnaround. Longer shelf-life allows cheaper logistics alternatives such as sea-freight.. \n\n\nPrevent loss & improve quality\nPre-cooling not only slows down fruit respiration, water loss, and metabolism but also inhibits nutrition loss and pathogen development during subsequent storage.\n\n\n\nFAQs about Cold Rooms\nWhat is the capacity of InspiraFarms pre-cooling solutions?\n\nAll our cold rooms range from a minimum of 9 pallets to a maximum of over 1,000 pallets. Our pre-cooling machines can be integrated to any cold room for which we offer capacities from 3,000m3/h – 150Pa – to cool down a single pallet independently up to 30,000m3/h – 150Pa – to cool down 12 pallets at the same time.\n\nWhat is the smaller dimension and capacity of an InspiraFarms cold room?\n\nThe smaller dimension of our cold rooms is 15m², with a storage capacity of approx. 8 to 10 pallets (1.0 x 1.2 meter). It is equivalent to a 20’ reefer container, but with pre-cooling capabilities to cool down fast up to 12 pallets and 40% more efficient. The following standard sizes are 30m² and 60m².\n\nHow are InspiraFarms cold rooms and pre-cooling solutions powered?\n\nOur cold rooms and pre-cooling solutons are powered by three-phase electric power (for smaller units in the range single-phase is possible, up to 7 kW of cooling capacity). The power can be from grid only or from a mix of grid, solar and diesel back-up\n\nWhich fresh products can pre-cooled?\n\nPre-cooling is regarded as an indispensable first step by many regions like Europe, and it is a key step for products such as Blueberries, Avocados, Green Beans, Brussels Sprouts, Cherries, Cucumbers, Grapes, Honeydews, Kiwi, Nectarines, Okra, Bell Peppers, Plums, Summer Squash, Strawberries, Tomatoes, flowers and more.\nAlthough certain crops can be stored without pre-cooling, many farmers and exporters, aiming towards the best results, practice pre-cooling as an integral part of their post-harvest management.\n\nCan I use reefers as cold rooms or precoolers?\n\nReefer containers are designed to hold a specific temperature while in trucks or ships but they are not meant to precool. They miss the airflow control needed to treat fruit and vegetables. It is possible, but with a small fraction of the maximum allowed volume. Reefers available in most African countries have low coefficient performance compared to our equipment When they have been used for years, that coefficient performance lowers, bringing up the energy bill substantially. Read more in this article .\n\nAre InspiraFarms cold rooms suitable for storing meat, fish or any animal product?\n\nYes, both chilled (above 0°C) and frozen (-18°C to -24°C).\n\nWhat do I need to have on site for having installed an InspiraFarms cold room with pre-cooling capabilities?\n\nOur pre-cooling solutions are portable machines that can be placed in any cold room, even existing ones. In case you are looking for a complete solution for a cold room with pre-cooling capabilities, you will need a three-phase grid connection, a concrete slab, and an access road for a truck with a container trailer. The concrete slab is part of the civil works and we, therefore, ask our clients to prepare before the deployment and assembly of our units. InspiraFarms provides guidance to customers on how to approach these civil works.\n\nHow InspiraFarms cold rooms and pre-coolers are delivered?\n\nOur cold rooms are delivered containerized in a kit. Everything is delivered as part of the same consignment. From the structural part to the finishing and fittings. Following the site survey, a local engineer and contractor will be required to fit the cold room. In case you will requiring just the pre-cooling machine for an existing cold room then we can deliver it using conventional shipping methods.\n\nWhat is the best temperature of a cold room?\n\nThe ideal temperature of a cold room depends on the product, the stage of the supply chain, and the target market. It is important to understand that temperature is not a key indicator of what is needed to treat fruit and vegetables. You can have a room with an air temperature of 2°C and still have the pulp temperature of your fruit at 20°C for days. Our pre-cooling solutions, which use forced-air system, to be added in any cold room assures your product reaches the right pulp temperature in a reduced time.\n\nWhat is the energy consumption of an InspiraFarms cold room and pre-cooling machine??\n\nIt will depend on the size and capability of the cooling machine, for which we offer ranges from 8 to 100+kW of thermal power according to the type of crop and the cycle time. For example, cooling down one kg of a climacteric fruit might require as much as 10 times the energy it is required to keep it cool. Cold rooms for avocados for example require a lot of cooling power and a specific airflow. To cool down 10,000 kg of avocados, a minimum of 25 kW of cooling power is required. Enquire from us for more detailed answers for specific crops.\n\nHow do you insulate a cold room?\n\nCold rooms are insulated by using sandwich panels. Our cold room panels are made of high density PUR (Polyurethane) to maximize the thermal insulation and grant our clients lower energy bills. Most companies in Africa are still using EPS (Styrofoam), but for the same thickness you get half the insulation from EPS. In addition, EPS is increasingly rejected by higher quality and value chains for the health and safety hazards they bring. Sub-optimal insulation can result in high energy bills, supply chain issues such as rejections and microbiological issues caused by condensation.\n\nCan the pre-cooling solution can be moved once installed?\n\nYes, our modular cold rooms and our pre-cooling machines can be moved, although it’s a good idea to get the experts to do it. Trying to move the unit yourself would usually invalidate any warranty. The units are not mobile. For re-assembling, you will need to have the civil works ready in the new site. The pre-cooling machine can be placed by you in any cold room as required.\n\nWhat is the price of a pre-cooling solution?\n\nIt depends on the size and capacity of the cold room and the capabilities of the pre-cooling solution selected. For a price estimation please fill out this form.\n\nWhich countries you deliver to?\n\nWe are mostly focused on African markets. All our cold rooms and pre-cooling solutions can be delivered to any country in the following regions: East Africa, West Africa & Southern Africa. We have cold rooms with pre-cooling delivered in Kenya, Rwanda, Zimbabwe, Zambia, Mozambique, Ghana & Morocco.\n\nClients\nSharon Cheboi2023-04-19T10:00:02+00:00\n\n\n\n\nLauetta Phase 2, Zimbabwe\n\n\n\n\nLauetta Phase 2, ZimbabweSharon Cheboi2023-07-31T07:54:07+00:00\n\n\n\n\nKakuzi Plc, Kenya\n\n\n\n\nKakuzi Plc, KenyaSharon Cheboi2023-04-18T09:05:17+00:00\n\n\n\n\nWiserow Enterprises, Zimbabwe.\n\n\n\n\nWiserow Enterprises, Zimbabwe.Do you have questions or interested in starting a project?\nGet in touch with our local team today!\nGet a quote\n\n\n\n \n \n\n\n\n\n\nFollow Us\n\n\n\n\n\n\n \n\n Company Info\nTel:+44 (0) 20 3893 2420\ninfo@inspirafarms.com\n\n Get the latest InspiraFarms news & updates\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t\tEmail Address\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n  Subscribe \n\n\n\n\n\nInspiraFarms may use your contact information to contact you about our products and services. You may unsubscribe from these communications at anytime.\n\n \n\n Links\n\nAbout us\nProducts\nOur clients\nBlog\n\n\nPrivacy notice\nCookie policy\nSpeak Up\n\n\n \n\n \n\n \n \n \n\n\n\n\n\n\t\t© Copyright  InspiraFarms | All rights reserved. | Registration No: 08098061 | VAT No. GB164196985\r\nInspiraFarms Cooling is the trading name of Enterprise Projects Ventures Limited.\t\n\n\n\n \n \n \n \n\n\n \n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThis site uses cookies:  Find out more.Okay, thanks\n\n\n \n\n\nGo to Top\n\n\n\n\n"}]}