{"text": [{"https://jooules.com": "Jooules | Creating Ethical Protein Ingredients from CO2 EmissionsHomeProcessOur proteinImpactAbout us NewsroomContactWe create ethical protein ingredients from CO2 emissionsDiscoverUnlocking protein potential to enable a future where food production is our climate's solutionOur planet cannot sustainably service the growing demand for nutritionally rich protein ingredients, so we’re pioneering the way the world produces food by converting carbon emissions into protein ingredients that are highly nutritious, scalable, and ethical.Where innovation meets nutritionProtein and food production can be ethical and sustainable. By harnessing the power of ancient microbes and using innovative techniques in gaseous fermentation, we can produce functional protein ingredients from CO2 emission streams generated by others.Our processA protein for the futureJooules’ protein ingredient is designed specifically for food manufacturers around the world seeking a more sustainable, nutritionally rich, and versatile protein source to suit any diet.Our proteinFood production can be our climate's solutionBy capturing carbon dioxide, embracing renewable energy, and reducing resource intensity with 600 times less water and 99% less land than beef production, we are one of the very few food production systems that are truly able to mitigate the effects of climate change on the environment. Our impactThe quest to find and develop the best solution Jooules was born in 2021 from a conversation around how to solve the problem of sustainability in the food and agriculture sector while also feeding the growing population.More about our journeyIn the mediaNBRJuly 16, 2024GMO: Raising people's ambitions on synthetic biologyFood TickerJune 6, 2024Jooules' big future food energyFuture AlternativeJune 4, 2024Q&A with CO2-based protein start-up JooulesFuture AlternativeMay 15, 2024NZ start-up Jooules raises $1m to create protein from CO2See all mediaWould you like to get in touch?Feel free to contact us with any questions.Contact usSubscribe to our newsletterBe first to know what we've been up to!Thank you! Your submission has been received!Oops! Something went wrong while submitting the form.©2024 Jooules Limited Privacy Statement"}]}