{"text": [{"https://klarna.com": "Klarna International | Safe & easy-to-use payment solutionsInvestor relationsCorporate governanceSustainabilityPressAbout usInvestor relationsCorporate governanceSustainabilityPressAbout usPrivate loginContinue in appContinue in browserLog in to get an overview of your purchases, upcoming payments and settle them easily with one click.Business loginGo to portalLog in to manage your orders, payout reports, store statistics, and general settings.Log inKlarna internationalKlarna markets   Australia | English   Österreich | Deutsch   België | Nederlands   Belgique | Français   Canada | English   Canada | Français   中国 | 中文(简体)   Česká republika | Čeština   Danmark | Dansk   Suomi | suomi   France | Français   Deutschland | Deutsch   Ελλάδα | Ελληνικά   Ireland | English   Italia | Italiano   日本 | 日本語   Magyarország | Magyar   México | Español   Nederland | Nederlands   New Zealand | English   Norge | Norsk   Polska | Polski   Portugal | Português   România | Română   España | Español   Slovensko | Slovenčin   Sverige | Svenska   Schweiz | Deutsch   Switzerland | English   Suisse | Français   Svizzera | Italiano   United Kingdom | English   United States | EnglishShow morePriceRunner   PriceRunner United Kingdom   PriceRunner Danmark   PriceRunner SverigeMore from KlarnaOpen Banking, with added Klarna Klarna open bankingExplore deep dives and trend reports Klarna InsightsKlarnaAbout usCareersPressWikipinkHomeCustomer serviceTerms & conditionsPrivacy policyTracking technology noticeSecurity tipsDigital Services ActBusinessSell with KlarnaContact usDeveloper documentationKlarna open bankingGlobalChoose your language and regionKlarna is available around the world with a variable offering, choose one that suits you best.AustraliaEnglishÖsterreichDeutschBelgiëNederlandsBelgiqueFrançaisCanadaEnglishCanadaFrançais中国中文(简体Česká republikaČeštinaDanmarkDanskSuomiSuomiFranceFrançaisDeutschlandDeutschΕλλάδαΕλληνικάMagyarországMagyarIrelandEnglishItaliaItaliano日本日本語MéxicoEspañolNederlandNederlandsNew ZealandEnglishNorgeNorskPolskaPolskiPortugalPortuguêsEspañaEspañolSlovenskoSlovenčinSverigeSvenskaSchweizDeutschSwitzerlandEnglishSuisseFrançaisSvizzeraItalianoUnited KingdomEnglishUnited StatesEnglishRomâniaRomânăKlarnaAbout usCareersPressWikipinkHomeCustomer serviceTerms & conditionsPrivacy policyTracking technology noticeSecurity tipsDigital Services ActBusinessSell with KlarnaContact usDeveloper documentationKlarna open bankingCopyright © 2005-2024 Klarna Bank AB (publ). Headquarters: Stockholm, Sweden. All rights reserved. Klarna Bank AB (publ). Sveavägen 46, 111 34 Stockholm. Organization number: 556737-0431CookiesSitemapKlarna.com"}, {"https://www.klarna.com/international/about-us/corporate-governance/investor-relations/": "Investor relations | Klarna InternationalInvestor relationsCorporate governanceSustainabilityPressAbout usInvestor relationsCorporate governanceSustainabilityPressAbout usPrivate loginContinue in appContinue in browserLog in to get an overview of your purchases, upcoming payments and settle them easily with one click.Business loginGo to portalLog in to manage your orders, payout reports, store statistics, and general settings.Log inInvestor relationsHere you will find Klarna’s latest and previous interim reports, annual reports and presentations. You will also find information about our debt instruments, as well as relevant contact persons.Latest ReportsKlarna Bank AB (publ) – Q1 2024 Financial UpdateKlarna Holding AB – Annual Report 2023 (EN)Klarna Holding ABHere you can find financial and regulatory information relating to Klarna Holding AB, Klarna’s parent company. Read moreKlarna Bank ABHere you can find financial and regulatory information relating to Klarna Bank AB, a subsidiary of Klarna Holding. Read more  How to transfer your shares in Klarna Group plcIf you're an existing shareholder, transferring your shares is now easier than ever.Learn more Klarna in SocietyAt Klarna, our mission is to smooth commerce and make it easier and safer for people to shop and pay for their purchases. With our focus on customer obsession and commitment to transparency and accountability at the heart of everything we do, we are proud to be a trusted partner to 150 million consumers and over 550,000 retailers across 45 markets.Our amazing talented people and innovative technologies enable us to deliver this mission and we believe that we are making a positive impact on society and helping to drive the global economy forward.For more information see here.InvestorsSequoia (since 2010)HeartlandSoftbankCommonwealth Bank of AustraliaKlarna foundersPermiraDragoneerFunds and accounts managed by BlackrockKlarna employeesChrysalis InvestmentsSilver LakeGICShow moreBBB-/A-3stable outlookS&P Global assigns Klarna Bank AB an investment grade credit rating.Read more here981BGross Merchandise Volume - SEK150MActive consumers45Countries550k+Global retail partnersDebt investorsHere you will find information on our debt issuance and contact details.Read moreRegulatory reportsHere you will find our capital adequacy and risk management reports.Read moreContact usPress: press@klarna.comEquity investors and debt investors: investorrelations@klarna.comCompany informationKlarna Holding ABArticles of associationRegistration certificateKlarna Bank ABArticles of AssociationRegistration CertificateKlarnaAbout usCareersPressWikipinkHomeCustomer serviceTerms & conditionsPrivacy policyTracking technology noticeSecurity tipsDigital Services ActBusinessSell with KlarnaContact usDeveloper documentationKlarna open bankingGlobalChoose your language and regionKlarna is available around the world with a variable offering, choose one that suits you best.AustraliaEnglishÖsterreichDeutschBelgiëNederlandsBelgiqueFrançaisCanadaEnglishCanadaFrançais中国中文(简体Česká republikaČeštinaDanmarkDanskSuomiSuomiFranceFrançaisDeutschlandDeutschΕλλάδαΕλληνικάMagyarországMagyarIrelandEnglishItaliaItaliano日本日本語MéxicoEspañolNederlandNederlandsNew ZealandEnglishNorgeNorskPolskaPolskiPortugalPortuguêsEspañaEspañolSlovenskoSlovenčinSverigeSvenskaSchweizDeutschSwitzerlandEnglishSuisseFrançaisSvizzeraItalianoUnited KingdomEnglishUnited StatesEnglishRomâniaRomânăKlarnaAbout usCareersPressWikipinkHomeCustomer serviceTerms & conditionsPrivacy policyTracking technology noticeSecurity tipsDigital Services ActBusinessSell with KlarnaContact usDeveloper documentationKlarna open bankingCopyright © 2005-2024 Klarna Bank AB (publ). Headquarters: Stockholm, Sweden. All rights reserved. Klarna Bank AB (publ). Sveavägen 46, 111 34 Stockholm. Organization number: 556737-0431CookiesSitemapKlarna.com"}, {"https://www.klarna.com/international/about-us/corporate-governance/": "Corporate governance | Klarna InternationalInvestor relationsCorporate governanceSustainabilityPressAbout usInvestor relationsCorporate governanceSustainabilityPressAbout usPrivate loginContinue in appContinue in browserLog in to get an overview of your purchases, upcoming payments and settle them easily with one click.Business loginGo to portalLog in to manage your orders, payout reports, store statistics, and general settings.Log inCorporate governanceMaintaining the confidence and trust of all our stakeholders.About usKlarna Bank AB (corporate registration no. 556737-0431) (“Klarna”) is a Swedish public limited liability company licensed to carry out banking activities under the supervision of the Swedish Financial Supervisory Authority (SFSA). Klarna is categorized by the SFSA as a category 2 institution. Klarna Bank AB provides its financial services in other EEA countries through passporting its license in accordance with EU directive 2013/36/EU and by establishing local branches. Klarna also offers its financial services outside the EEA through the establishment of local subsidiaries in certain jurisdictions. Klarna’s corporate governance framework and approach apply to Klarna Holding AB, Klarna Bank AB and all branches and subsidiaries.GovernanceThe BoardThe Chief Executive OfficerRemunerationRisk management, risk reporting and control functionsWhistleblowingCorporate governance reportsCorporate governanceCorporate governance structureKlarna’s corporate governance structure distributes rights and responsibilities between the shareholders, the Board and the CEO according to the relevant laws, rules and internal processes. We believe well-defined reporting lines and distribution of distinct responsibilities are essential to good corporate governance. Our high ethical and professional standards and a sound risk culture are also vital in ensuring good governance. The image provides a summary of how governance and control are organized at Klarna.Framework for corporate governanceExternal FrameworkIn addition to general laws, rules and industry practices, Klarna must also comply with the detailed regulations specific to banks and payment service providers. These include the Swedish Banking and Financing Business Act (SFS 2004:297) and rules and recommendations issued by the SFSA with regard to, among other things, capital and liquidity requirements as well as rules on internal governance and control. Internal FrameworkIn order to ensure compliance with external regulations Klarna has developed an internal framework which incorporates the external requirements on corporate governance. Of primary importance are the Rules of Procedure for the Board (which include how to address conflicts of interest for Board members and instructions for the Board’s committees), the Instructions for the CEO, the Policy for Suitability, Training and Diversity of the Board, Management and Key Function Holders, and the Policy for Klarna Board Committees. These documents have been adopted by Klarna’s Board. Additionally, Klarna’s Code of Business Conduct provides an ethical framework for the company. Klarna has established a framework of approved policies and instructions. These are important tools for the Board and the CEO in their governing and controlling roles, as well as defining the roles, requirements and expectations of the second and third lines of defense within risk ownership and all employees in the fulfillment of their roles. These policies include, for example, the Risk Policy, Compliance Policy, Credit Policy, Insider and Disclosure Policy, Conflicts of Interest Policy, Anti-Money Laundering and Counter Terrorist Financing Policy, Remuneration Policy, and the Global Work Environment Policy. Together with the Articles of Association, these constitute the internal framework that regulates corporate governance at Klarna. Klarna's organizationKlarna's organization is divided into domains that are led by a domain lead who reports to a CXO. Each CXO reports to the CEO and the CEO reports to the Board. There are also three independent control functions outside of the domains: Risk Control, Compliance and Internal Audit. Risk Control and Compliance are both directly subordinated to the CEO and the Board. Internal Audit, which reports directly to the Board, has been outsourced to an external party.General meetingThe General Meeting is Klarna’s highest decision-making body where shareholders exercise their voting rights. At the General Meeting decisions are taken regarding matters including the annual report, the income statement and balance sheet, dividend, election of the Board of Directors and auditors, and remuneration for Board members and auditors. Find the documentation for the general meetings here.The BoardThe Board is the highest decision-making body in Klarna’s structure for management and control. The Board is responsible for the company’s strategy, organization and for the management of the company’s operations. The Board also holds the ultimate responsibility for ensuring that Klarna’s corporate governance arrangements meet expectations, and are implemented effectively throughout the organization. The Board members are elected by the shareholders at the Annual General Meeting (AGM) for a one-year term of office extending through to the next AGM. Klarna is not required to have a nomination committee and as such the Board has not adopted a nomination policy. In practice, the Board members are proposed and appointed by the shareholders holding a majority of the votes as well as the capital of the company. The Board has adopted Rules of Procedure that regulate the Board’s role and ways of working as well as policies for the Board’s committees. The Board has overall responsibility for the activities carried out within Klarna and has the following duties, among others: deciding on the nature, direction and strategy of the business as well as the framework and objectives of the activities.evaluating the effectiveness of operations in relation to the agreed strategy, framework and objectives on a regular basis.ensuring that the business is organized in such a way that the accounting, treasury management and financial conditions in all other respects are controlled in a satisfactory manner and that the risks inherent in the business are identified, defined, measured, monitored and controlled in accordance with external and internal framework, including the Articles of Association. The board is also responsible for setting Klarna’s risk appetite and policies establishing the principles for risk management.deciding on major acquisitions and divestments as well as other major investments, selecting, monitoring and planning the succession of the Board members, appointment or dismissal of the CEO, the Chief Risk Officer, the Chief Compliance Officer and the Chief Information Security Officer.deciding on appointment and dismissal of the Internal Auditor (outsourcing partner and/or individual).deciding on remuneration of the CEO, members of the CXO team and the heads of the control functions, Risk Control and Compliance.Board membersChairman of the BoardMichael MoritzMichael is a senior adviser and Board Member of Sequoia Heritage and was a Partner at Sequoia Capital between 1986 and 2023. Michael has served on the Boards of companies such as Google, Yahoo, PayPal, and Stripe. He has served on the Board of Klarna since 2010.Curriculum VitaeCEOSebastian SiemiatkowskiSebastian holds a degree from the Stockholm School of Economics and has eight years of experience in sales, including being former Head of Sales at Djuice Uppsala. However, the most noted of Sebastian’s accomplishments is that he, along with our two other founders, revolutionized Swedish e-commerce and created the success story we know today as Klarna.Curriculum VitaeBoard memberMikael WaltherMikael is the managing director at Rosfelt Holding AB. He previously led investment company Navos Capital and has broad experience within investment banking and other financial companies. He has previously worked for Cevian Capital and Goldman Sachs.Curriculum VitaeBoard memberLise KaaeLise most recently comes from Svenska Handelsbanken AB where she was a Board member from 2015-2020. She has also been a member of that Board's committee for credit, auditing, and risk. In addition to this, Lise has been a member of the Danish Financial Supervisory Authority's board (Finanstilsynet). Lise also joined the BoD in Pleo Financial Services A/S in Nov. 2022.Curriculum VitaeBoard memberSarah SmithSarah has over 20 years of experience in banking. She worked at Goldman Sachs from 1996 to 2021, having served as Chief Compliance Officer, Controller and Chief Accounting Officer. She serves on the boards of Via Transportation, 98point6 and PCAP. Curriculum VitaeBoard memberOmid KordestaniOmid was Senior Vice President of Worldwide Sales and Business Development at Google from 1999-2009. He held several other positions within the company, including Chief Business Officer and Senior Advisor for Google. He has also been a board member of Spotify and Vodafone, as well as chairman of the board of Twitter Inc., where he has been a board member from 2020-22.Curriculum VitaeBoard memberRoger W. Ferguson JrRoger is the Steven A. Tananbaum Distinguished Fellow for International Economics at the Council on Foreign Relations. He was the president and CEO of TIAA and the former Vice Chairman of the Board of Governors of the U.S. Federal Reserve System. He serves on the boards of Alphabet, Corning, and International Flavors & Fragrances.\rCurriculum VitaeBoard memberAndrew ReedAndrew Reed is a Partner at Sequoia Capital. He works with internet and software companies around the world. Andrew represents Sequoia on the boards of Bolt, Figma, Klarna, Sourcegraph, Strava, Vanta, Warp, among others. Andrew was previously involved with Sequoia's investments in GitHub (Microsoft), Loom (Atlassian), and Robinhood. Curriculum VitaeThe ChairmanThe Chairman of the Board organizes and leads the work of the Board. According to the Rules of Procedure, the Chairman will maintain regular contact with the CEO, ensuring that the Board receives sufficient information and documentation to effectively assess Klarna’s current position, financial plans, risks and risk management and future development, and deliberate with the CEO on strategic issues. The reputation, experience and assignments of the Board and the CEOBoard members bring a wealth of relevant professional experience to Klarna, including expertise in banking and finance, e-commerce, technology, payment cards, risk management, governance, accounting, international sales, venture capital, entrepreneurship, and leadership. Additionally, their diverse backgrounds provide valuable knowledge and insight into the conditions and requirements for conducting business in the different markets where Klarna operates.Suitability assessmentTo ensure Klarna’s Board members and CEO have the right skills, knowledge and experience, the Board has adopted the Suitability, Training and Diversity Policy. This policy looks at the person’s experience and reputation and makes sure they’re a good fit for the company. It also evaluates their ability to commit the time and effort needed to do their job well. The Chief Operating Officer is responsible for the assessment at appointment and then subsequently at least every two years or sooner if events observed through the ongoing monitoring process suggest a review would be prudent. When a new Board member or a new CEO assumes their duties, they are also externally assessed by the SFSA. The CEO’s performance and qualifications will be evaluated the same way as Board members. According to the Rules of Procedure of the Board, the Board ensures that the CEO fulfills his duties. The Board is responsible for appointing and retains the authority to dismiss the CEO of Klarna.DiversityKlarna understands that having a diverse Board is crucial to ensure the Board can do its job well and has the knowledge and experience needed to navigate the various social, business and cultural conditions of the markets Klarna operates in and the activities the company is involved in.The Suitability, Training and Diversity Policy adopted by the Board lays out the diversity requirements Klarna’s Board is expected to meet. This policy emphasizes that all Board assignments should be made based on merit and with the goal of maintaining and enhancing the Board’s overall effectiveness. In order to achieve this, the company looks for a wide range of qualifications and competencies, and places a strong emphasis on diversity in terms of age, gender, geographical background, and educational and professional experience. Number of assignmentsKlarna must evaluate the number of positions held by the Board members and CEO to ensure that it is reasonable and appropriate. The evaluation takes into account the specific circumstances and the nature, scale, and complexity of Klarna’s business operations. The company has determined that all Board members’ assignments comply with regulatory requirements.TrainingThe Board sets a training plan every year, and it is the responsibility of the Compliance function to implement the plan for the Board. The training plan includes an orientation program for new Board members and ongoing training on important topics for individual members and the Board as a whole in matters that have been considered important by the Board itself. This is to ensure that the Board is continuously informed and updated on the relevant matters that affect the company.Board committeesRemuneration CommitteeThe Remuneration Committee (Rem Co) is responsible for preparing and presenting proposals to the Board on remuneration issues. This duty includes proposals regarding the Group’s Remuneration Policy and on remuneration to members of the CXO-team and employees who head any of the control functions. Klarna’s Board has adopted a Remuneration Policy which creates sound and standardized remuneration structures throughout the organization. This is revised when necessary and at least annually. The Rem Co makes a competent and independent evaluation of the Remuneration Policy and Klarna’s remuneration system, and presents to the Board on at least an annual basis, together with the suitable control function(s). The Rem Co handles matters within its responsibility on an ongoing basis through correspondence between the committee members. Any formal decisions not covered by its delegation authority are reported to and documented by the Board at the closest following Board meeting. Under the oversight of Rem Co, Klarna has established a Remuneration Policy and processes, securing sound and standardized remuneration structures throughout the organization. Members:Omid Kordestani (Chair)Michael MoritzSarah SmithAudit, Compliance & Risk Committee (ACRC)The Audit, Compliance & Risk Committee (ACRC) is responsible for oversight and preparation of all matters related to audit (both internal and external), compliance, risk and financial reporting and related internal control arrangements. ACRC held 9 meetings in 2022 and provided regular updates to the Board on matters pertaining to its responsibilities. More information about the number of meetings and attendance can be found below. ACRC has had nine meetings in 2022.Members:Sarah Smith (chair)Mikael WaltherLise KaaeThe Chief Executive OfficerKlarna’s Chief Executive Officer (CEO) is responsible for the day-to-day management of the Group’s activities in accordance with the external and internal frameworks. The CEO reports to the Board and at each board meeting they submit a report on the performance of the business including updates on strategic priorities set by the Board.Klarna’s CEO is also a Board member and participates in all board meetings, except on matters in which the CEO has an interest that may be in conflict with the interests of Klarna, such as when the CEO’s work is evaluated. Other members of the Group Management Team participate as required by invitation from the Board or CEO.The Board has adopted an instruction for the CEO’s work and duties which also regulates the division of responsibilities and the interaction between the CEO and the Board. The CEO appoints the CXOs and the heads of the control functions. The Chief Risk Officer and the Chief Compliance Officer appointment and replacement is also approved by the Board. The CEO is Sebastian Siemiatkowski.The Group Management TeamChief Executive OfficerSebastian SiemiatkowskiChief Financial OfficerNiclas NeglénChief Product and Design OfficerDavid FockChief Technical OfficerYaron ShaerChief Marketing OfficerDavid SandströmChief Commercial OfficerDavid SykesChief Operating OfficerCamilla GieseckeChief Risk OfficerJoachim ReussChief Compliance OfficerJoaquín CalderónChief Information Security OfficerYaron ShaerChief Credit Risk OfficerArvind VaradhanChief Legal OfficerBoudien MoermanShow moreManagement committeesThe CEO has, along with the Group Management Team, three separate committees at his disposal for the purpose of managing the operations: Executive Credit and Fraud CommitteeThe Executive Credit and Fraud Committee is responsible for reviewing credit risk results and trends as well as steering the company’s overall generation of credit risk. Capital and Liquidity CommitteeThe Capital and Liquidity Committee is responsible for assessment and decision within the internal capital assessment process. Audit Compliance and Operational Risk CommitteeThe Audit Compliance and Operational Risk Committee is responsible for providing oversight and retaining executive responsibility for all Audit, Compliance and Operational Risk related matters. RemunerationKlarna's remuneration structureKlarna has clear remuneration policies, instructions, and processes, securing sound remuneration structures throughout the organization. Our remuneration structure recognizes the importance of well-balanced but differentiated remuneration structures, based on business and local market needs, as well as the importance of being consistent with and promoting sound and efficient risk management not encouraging excessive risk-taking and short-term profits or counteracting Klarna’s long term interests.The aim of the remuneration structure is to both support the ability to attract and retain talent in every position and to support equal and fair treatment, but also to ensure that remuneration in Klarna is aligned with efficient risk management and compliant with existing regulations.Klarna’s Board has confirmed this in the adopted Remuneration Policy, which is revised as necessary, and at least annually.Statement of remuneration in Klarna in accordance with the Swedish Financial Supervisory Authority’s regulatory frameworkHere you find Klarna’s annual statements for the Klarna Group according to the Swedish Financial Supervisory Authority’s regulatory framework. Since 2020, this information is found in the Annual Report. Ersättningssystem 2019 (SV) Ersättningssystem 2018 (SV)Remuneration system 2018 (EN) Ersättningssystem 2017 (SV)Remuneration system 2017 (EN)   Ersättningssystem 2016 (SV)Remuneration system 2016 (EN) Ersättningssystem 2015 (SV)  Ersättningssystem 2014 (SV)  Ersättningssystem 2013 (SV)  Ersättningssystem 2012 (SV)   Ersättningssystem 2011 (SV)Remuneration to the Board of Directors, the CEO and the CXO teamThe Annual General Meeting decides on the Board members' fees in accordance with Swedish law. It is Klarna’s Remuneration Committee that prepares proposals for the Annual General Meeting regarding these remunerations.Klarna’s Board of Directors decides on remuneration for the CEO and other members of the CXO team, following proposals from the Remuneration Committee.Risk management, risk reporting and control functionsRisk at KlarnaRisk management is central to Klarna’s operating model and underpins all activities conducted throughout the organization. The purpose of risk management is to safeguard Klarna’s long-term viability, mitigate volatility in financial performance, enhance operational resilience and performance, and facilitate informed decision-making. Klarna’s risk management governance model encourages a risk-aware culture combined with control structures which are monitored and enforced by independent control functions. Key controls are documented and assessed on a regular basis, with assessments considering both effectiveness of design and operation. The risk strategy is a natural extension of the business model that focuses on identification, assessment, management and monitoring of the material risks that Klarna is exposed to.Risk governanceKlarna operates a financial services industry standard three lines of defense model for risk management and control. The ultimate responsibility for risk management rests with the Board, which sets Klarna’s risk appetite and policies establishing the principles for risk management. It also oversees and promotes a sound risk culture of risk awareness and understanding across the organization to encourage informed decision making. The Board is supported by the Audit, Compliance, and Risk Committee (ACRC), Executive Credit and Fraud Committee (ECFC) and the Capital and Liquidity Committee (CLC) in performing their duties regarding risk management, including risk identification, measurement, monitoring and ensuring appropriate controls are in place. The Group Management Team is responsible for implementing the risk strategy. They are also accountable for the management of risks and within each of their areas of responsibility, and to promote a sound and effective risk culture across their teams and the Klarna as a whole. Business Line Management, in the first line of defense, are responsible for the risks, and the management of these, within their respective area of responsibility. They are responsible for ensuring that the appropriate organization, procedures and support systems are implemented to ensure a sufficient system of internal controls.The second line of defense, consisting of the functions Risk Control and Compliance oversee risk. These functions set the principles and framework for risk management, facilitate and challenge risk assessments, perform independent control testing, and report on adherence to risk appetites, limits and frameworks.  The control functions are independent of business line management. They attend and report to the Audit, Compliance and Risk Committee (ACRC) and the Board.Internal Audit, in the third line of defense, provides risk assurance through independent periodic reviews of governance structures and control systems. This includes regular evaluation of Klarna’s framework for risk management and a yearly review of the control functions in the second line of defense. Internal audit reports directly to the Board of directors. Risk strategy and appetiteKlarna’s risk strategy is set by the Board and outlines the nature of risks that the business is exposed to, its willingness to take these risks and how they are managed. It is formed through Klarna’s business plan, established by the Group Management Team and approved by the Board; the Risk Policy, which forms the basis of Klarna’s risk management framework; the Credit Policy which sets out Klarna’s credit strategy; and the Internal Capital and Liquidity Adequacy Assessment Process.The risk appetite framework outlined in the Risk Policy reflects Klarna’s willingness to take and limit risk. The appetite is set by the Board and reviewed and updated regularly, at least on an annual basis. This annual review is an integral part of the annual business planning process, ensuring alignment of the business strategy, planned business activities and Klarna’s risk exposures. Klarna’s risk appetite approach commences with an assessment of Klarna’s risk capacity, the maximum level of risk Klarna is able to assume, and continues with the level of aggregate risk appetite that the Board is willing to accept. Limits are set on risk appetite metrics and reported on a monthly basis. Any limit breaches are escalated to the Board.The Board and the Group Management Team also issue specific written policies and instructions for managing risks, which are complemented by detailed routine descriptions within the organization. The second line functions provide an independent assessment of Klarna’s risk profile to the Group Management Team and the Board on at least a quarterly basis. Risk reportingIn the Risk Policy the Board has established how and when it shall receive information about Klarna’s risks and risk management. The periodic, recurring risk reporting in Klarna provides reliable, current, complete, and timely information, reflecting the nature of different risk types as well as market developments. The Board, the ACRC, the CEO, and the Group Management Team, as well as other functions that require such information, receive regular reports on the status of risks and risk management to ensure they are aware of material risks and control weaknesses. Internal control and financial reportingKlarna maintains risk management processes and internal controls relating to financial reporting which are designed to ensure accuracy of financial records, appropriate application of accounting policies and compliance with relevant regulations and provide management with accurate and timely financial reporting in order to accurately view the Group’s performance and make informed decisions.Internal auditKlarna’s Internal Audit Function is independent of the business, directly reporting to the Board. The Board has adopted a Policy on Internal Audit.The responsibility of Internal Audit is to provide reliable and objective assurance to the Board and the CEO regarding the effectiveness of controls, risk management, and governance processes by performing independent periodic reviews of the governance structure and the system of internal controls.The Board has decided to outsource Klarna’s Internal Audit Function to an external party and has appointed Deloitte as Internal Auditor. The Risk Control Function is the internal coordinator for the internal audit activities.The Internal Audit Function reports regularly to the Board and ACRC the results of its audits, including identified risks and suggestions for improvements. Internal Audit also informs the CEO, the Group Management Team and the relevant departments on internal audit matters. The Board annually establishes a plan for the internal audit work. External auditKlarna’s external auditors are formally elected at the General Meeting on an annual basis in line with Swedish Company law. Ernst & Young AB was re-elected at the 2022 AGM as external auditor for the period up to the 2023 AGM. The ACRC receives reports from the auditor, which include details of significant internal control matters that they have identified, and meets with the auditor on a regular basis.The ACRC oversees appropriate procedures to maintain the independence of the external auditor, this includes Klarna’s non-audit services policy which sets out those services that the auditor is permitted to provide and the requirements for pre-approval by ACRC in advance of provision of non-audit services. WhistleblowingReporting unethical or illegal misconductEmployees, consultants, and other partners may report observations relating to unethical or illegal misconduct through Klarna's external whistleblowing tool.The identity of the person filing a report will be kept secret in any potential follow-up, inquiries, and discussions unless Klarna is obliged by law to disclose the identity. Should this be the case, the person reporting will be informed. The whistleblower will not be subject to any negative consequences when filing the report, or any time thereafter.External whistleblowing toolReporting of observations can be done completely anonymously via the digital service WhistleB. The service is completely outside Klarna and meets the highest security requirements regarding encryption, data security, and protection of whistleblower anonymity.WhistleBCorporate governance reports2023From and including 2023, the Corporate Governance report is included in the Annual Reports which are linked below. 2023 Klarna Holding Annual Report 2023 Klarna Bank AB Annual Report2022Corporate Governance Report 2022 (EN/SW) 2021Corporate Governance Report 20212020Corporate Governance Report 20202019Corporate Governance Report 20192018Corporate Governance Report 20182017Corporate Governance Report 2017KlarnaAbout usCareersPressWikipinkHomeCustomer serviceTerms & conditionsPrivacy policyTracking technology noticeSecurity tipsDigital Services ActBusinessSell with KlarnaContact usDeveloper documentationKlarna open bankingGlobalChoose your language and regionKlarna is available around the world with a variable offering, choose one that suits you best.AustraliaEnglishÖsterreichDeutschBelgiëNederlandsBelgiqueFrançaisCanadaEnglishCanadaFrançais中国中文(简体Česká republikaČeštinaDanmarkDanskSuomiSuomiFranceFrançaisDeutschlandDeutschΕλλάδαΕλληνικάMagyarországMagyarIrelandEnglishItaliaItaliano日本日本語MéxicoEspañolNederlandNederlandsNew ZealandEnglishNorgeNorskPolskaPolskiPortugalPortuguêsEspañaEspañolSlovenskoSlovenčinSverigeSvenskaSchweizDeutschSwitzerlandEnglishSuisseFrançaisSvizzeraItalianoUnited KingdomEnglishUnited StatesEnglishRomâniaRomânăKlarnaAbout usCareersPressWikipinkHomeCustomer serviceTerms & conditionsPrivacy policyTracking technology noticeSecurity tipsDigital Services ActBusinessSell with KlarnaContact usDeveloper documentationKlarna open bankingCopyright © 2005-2024 Klarna Bank AB (publ). Headquarters: Stockholm, Sweden. All rights reserved. Klarna Bank AB (publ). Sveavägen 46, 111 34 Stockholm. Organization number: 556737-0431CookiesSitemapKlarna.com"}, {"https://www.klarna.com/international/sustainability/": "Sustainability | Klarna InternationalInvestor relationsCorporate governanceSustainabilityPressAbout usInvestor relationsCorporate governanceSustainabilityPressAbout usPrivate loginContinue in appContinue in browserLog in to get an overview of your purchases, upcoming payments and settle them easily with one click.Business loginGo to portalLog in to manage your orders, payout reports, store statistics, and general settings.Log inDoing our part so you can do yoursAt Klarna, we believe that conscious shopping should be effortless, helping you make better choices.Sustainability at KlarnaLimiting our carbon footprintTake control of your financesDiverse and inclusiveConscious shopping made easyOur pledge to the planetSustainability at KlarnaSupporting you in making conscious everyday decisions while conducting our business responsibly and sustainably.Read moreLimiting our carbon footprintWe want to be part of the solution. That means operating at net-zero and helping the planet reach the same goal.Read moreTake control of your financesWe want to help you save time and money, empowering you to make informed decisions and take control of your finances.Read moreDiverse and inclusiveWe believe that diversity and inclusion are key factors in our continued success and aim to become an even more diverse and inclusive company.Read moreConscious shopping made easyYou don’t have to be an expert to be a more conscious shopper. Let us do the heavy lifting.Read moreOur pledge to the planetWe’ve committed 1% of all future funding rounds to planet health initiatives, and have already pledged $16.5 million.Read moreAre you looking for relevant documents like the ESG report, our Modern Slavery and Human Trafficking Statements, or our Supplier Code of Conduct? You can find it all here.Sustainability at KlarnaLimiting our carbon footprintTake control of your financesDiverse and inclusiveConscious shopping made easyOur pledge to the planetDownloadsSustainability at KlarnaSupporting you in making conscious everyday decisions while conducting our business responsibly and sustainably.Our materiality assessmentTo find out how our business impacts global sustainability issues and to consider the impact of these issues, e.g. climate change, on Klarna, we conducted our first materiality assessment in 2021.Read more about the assessment and our material topics here.Our approach to sustainabilityClimate change poses one of the most significant challenges for humanity. And as our collective impact on the planet becomes more evident, so do the calls for action. At Klarna, we acknowledge that we’re part of the problem, and that’s why we want to be part of the solution.We play our part in addressing pressing global issues within our own operations in line with the results from the materiality assessment. But our impact goes beyond our own operations - there is so much more we can do. We aim to play an essential role in providing you with quality unbiased information so you can make informed and responsible purchasing decisions and work collaboratively with our retail partners on ensuring responsible business practices. Read more here. Limiting our carbon footprintWe want to be part of the solution. That means operating at net-zero and helping the planet reach the same goal.Part of the solutionClimate change poses one of the most significant challenges for humanity. And as our collective impact on the planet becomes more evident, so do the calls for action. At Klarna, we acknowledge that we’re part of the problem, and that’s why we want to be part of the solution.Our approach to climate actionKlarna has opted to follow the WWF and BCG blueprint for corporate climate action. It guides how companies measure and display their emissions, set targets to reduce them, price what is remaining, and contribute financially to effective climate projects.Read more here.Our commitment has three broad components2025By 2025, we will ensure that all of our locations use 100% green electricity.2030By 2030, we will reduce 50% of our carbon-intensity-based emissions in line with the Paris Agreement.2040By 2040, we will operate at net-zero.Climate PledgeRace to ZeroLeaders for Climate ActionCarbon Disclosure ProjectClimate PledgeCommitted to the Climate Pledge. Building momentum around the shift to a decarbonized economy.Learn moreRace to ZeroJoined Race to Zero. Cementing our dedication to making meaningful contributions in this space.Learn moreLeaders for Climate ActionMember of Leaders for Climate Action. Driving climate action to facilitate and scale best practice CO₂ reduction solutions in tech.Learn moreCarbon Disclosure ProjectRegularly (yearly) submitting to the CDP (Carbon Disclosure Project) project. Gaining valuable insights into where we can improve our carbon reduction efforts.Learn morePutting a price on our emissionsWe have introduced an internal carbon tax, where we tax ourselves for our own carbon emissions and invest that money in high-impact climate projects.Read moreInvesting in high-impact projectsThe funds generated by the internal carbon tax are invested into permanent carbon removal projects, reforestation and forest protection, and decarbonization projects among others, through our Climate Transformation Portfolio.Read moreTake control of your financesWe want to help you save time and money, empowering you to make informed decisions and take control of your finances.Actions speak louder than wordsWe believe you should first and foremost pay with the money you have. Period. But in some situations, credit makes sense, like shopping online where you can’t see or touch the product before purchase.We want to help you save time and money, empowering you to make informed decisions and take control of your finances. From spending overviews to in-app budgeting tools, Klarna products offer flexibility with a choice of ways to pay, including delaying payment or spreading the cost with no fees or interest over a short period of time - but never revolving credit. Read more here or check out our Wikipink site in Swedish.Time for serious changeWe continue to expand our immediate settlement option Pay Now across global markets, because we believe you should first and foremost pay with the money you have. We have also made a number of changes to make our product offering more sustainable and rolled out our Pink Standards for you in Sweden and Germany. We are planning to set this standard for our products across all markets - up next is the UK and USA.Pink StandardsNo revolving credit.We don’t want you to be stuck in a credit trap with high-interest payments and low installments, so we’ve removed our revolving credit-based product. Now, you’re only able to pay for your Klarna purchases in installments based on a predetermined time period.No extra fees.We want the total cost of credit to be reasonable and clear and have eliminated upfront and administration fees, so you only have to pay a straightforward, predetermined interest rate on the amount borrowed. We have also removed interest on late payments.More time to pay.The 14-day payment time on our invoice wasn’t good enough, so we changed it to 30 days to reduce hassle and unnecessary reminder fees. This means a payment period of 30 days for all free invoice purchases and an extension of the payment period over a normal payroll cycle.More friendly reminders.To help you pay for your purchases on time, we introduced an extra friendly reminder the day after the due date, free of charge.Diverse and inclusiveWe believe that diversity and inclusion are key factors in our continued success and aim to become an even more diverse and inclusive company.When differences make the differenceWe respect and value differences, and we strive to provide everyone with an equal opportunity workplace that promotes diversity. With employees of more than 100 nationalities, we are proud of our strong cultural diversity.nationalities working at Klarnawomen in our overall workforce in 2021Read more hereConscious shopping made easyYou don’t have to be an expert to be a more conscious shopper. Let us do the heavy lifting.The power’s in your handsAt Klarna, we provide the tools you need to shop smarter. From offering CO₂ insights for all purchases to promoting conscious brands and more sustainable products, we give you the power to shop more consciously than ever before.Personalized CO₂ insightsIn 2021, we launched the CO₂ Emissions Tracker based on Doconomy’s Åland Index, providing insights into the carbon emissions of all purchases made via the Klarna app. By displaying the kg-CO₂ rating of each transaction, we make it easier for consumers to track their individual footprint–and then take action. The new feature makes CO₂ data accessible on a global scale, making it one of the biggest awareness-raising efforts ever.Learn moreVote with your walletWant to support more sustainable brands but don’t know where to start? We got you. Wherever you are on your journey to sustainable living, our goal is to provide you with greater transparency about conscious brands and actionable insights to help you make informed shopping decisions.We’ve already started working towards this goal by curating content in the Klarna app to recognize and promote brands’ efforts towards sustainability.Read more here.Discover our list of brands taking steps to limit their carbon emissionsWe’ve teamed up with an independent sustainability technology platform, Clarity AI. They use machine learning, publicly disclosed information and big data to deliver environmental insights. With this, you can explore electronic brands’ environmental efforts in one place, get reliable data about the brands you buy from and see the top performers and who to consider next time you shop.Learn moreEncouraging circular shoppingRather shop pre-owned? We can help with that, too. We’ve also launched curated Collections content dedicated to pre-owned shopping. With us, you’ve got options. To incentivize participation in the circular economy, we will add pre-owned products throughout the shopping journey and make it convenient for you to maximize the lifespan of your items.Klarna ResellAn easier way to sell pre-loved pieces. Give new life to items, create listings in a tap, and sell your things via selected partners.Learn moreOur pledge to the planetWe’ve committed 1% of all future funding rounds to planet health initiatives. We’ve already pledged $16.5 million.Creating real change, togetherThere's a significant funding gap in addressing the planet's health crisis. To help bridge this, we committed 1% of our funding rounds in 2021 to vetted, high-impact projects through our Nature Transformation Fund. This was done in collaboration with our strategic sustainability partner, Milkywire. Now, three years into our journey, we've taken stock and are ready to embark on a new chapter.Learn moreDownloads2024Klarna Circularity Insights Report 2024Give One Final Progress Report2023Give One Progress Report 2022/2023Climate Transformation Fund Report 2023ESG Report 2023ESG datasheet 2023 (Excel/PDF)Gender Pay Gap Report UK 2023 2022ESG Report 2022ESG datasheet 2022 (Excel/PDF)Klarna’s Climate CommitmentClimate Transformation Fund Report 20222022 GHG Footprint Verification Statement2021ESG Report 2021ESG Datasheet 2021Climate Report 2020/21Sustainability Update Jan-Jun 2021Supplier Code of ConductModern Slavery and Human Trafficking Statement 2021-22Give One Progress Report 2021/20222020ESG Report 2020Modern Slavery and Human Trafficking Statement 2020-212019ESG Report 2019Climate Report 2019Modern Slavery and Human Trafficking Statement 2019-202018ESG Report 2018Modern Slavery and Human Trafficking Statement 2018-192017ESG Report 2017KlarnaAbout usCareersPressWikipinkHomeCustomer serviceTerms & conditionsPrivacy policyTracking technology noticeSecurity tipsDigital Services ActBusinessSell with KlarnaContact usDeveloper documentationKlarna open bankingGlobalChoose your language and regionKlarna is available around the world with a variable offering, choose one that suits you best.AustraliaEnglishÖsterreichDeutschBelgiëNederlandsBelgiqueFrançaisCanadaEnglishCanadaFrançais中国中文(简体Česká republikaČeštinaDanmarkDanskSuomiSuomiFranceFrançaisDeutschlandDeutschΕλλάδαΕλληνικάMagyarországMagyarIrelandEnglishItaliaItaliano日本日本語MéxicoEspañolNederlandNederlandsNew ZealandEnglishNorgeNorskPolskaPolskiPortugalPortuguêsEspañaEspañolSlovenskoSlovenčinSverigeSvenskaSchweizDeutschSwitzerlandEnglishSuisseFrançaisSvizzeraItalianoUnited KingdomEnglishUnited StatesEnglishRomâniaRomânăKlarnaAbout usCareersPressWikipinkHomeCustomer serviceTerms & conditionsPrivacy policyTracking technology noticeSecurity tipsDigital Services ActBusinessSell with KlarnaContact usDeveloper documentationKlarna open bankingCopyright © 2005-2024 Klarna Bank AB (publ). Headquarters: Stockholm, Sweden. All rights reserved. Klarna Bank AB (publ). Sveavägen 46, 111 34 Stockholm. Organization number: 556737-0431CookiesSitemapKlarna.com"}, {"https://www.klarna.com/international/press/": "Klarna press page | Klarna InternationalInvestor relationsCorporate governanceSustainabilityPressAbout usInvestor relationsCorporate governanceSustainabilityPressAbout usPrivate loginContinue in appContinue in browserLog in to get an overview of your purchases, upcoming payments and settle them easily with one click.Business loginGo to portalLog in to manage your orders, payout reports, store statistics, and general settings.Log inKlarna press page.Here, you will find the latest press releases from Klarna, along with related materials such as a press kit, company information, and an image library.For any media inquiries, please reach out to press@klarna.com.If you have questions related to a purchase, please visit our Customer Service pages.For regulatory news, click here.CategoriesGeneral NewsDACHSwedenUSUKFinlandBE-NLGermanyNorwayFranceEurope NewsAustriaOther MarketsAustraliaSpainProductDenmarkItalySwitzerlandPolandKlarna combines Sofortüberweisung with Klarna Payments to bring customers and merchants the best of both worldsJuly 18, 2024 General NewsKlarna Partners with Adobe Commerce to Extend Flexible Payment Options to MerchantsJuly 2, 2024 General NewsBritons are struggling with financial language fluency, and it’s costing the nation over £6B per annumJune 27, 2024 General NewsKlarna announces Rep Her initiative addressing gender-based disparities in women's sports merchandise accessibilityJune 26, 2024 General NewsKlarna Plus soars to 100,000 subscribers in the USJune 25, 2024 General NewsNew owners to take Klarna Checkout to the next levelJune 24, 2024 General NewsAI helps Klarna cut marketing agency spend by 25% and run more campaignsMay 28, 2024 General NewsThe CFPB should recognise key differences between BNPL and credit cards.May 22, 2024 General News90% of Klarna staff are using AI daily - game changer for productivityMay 14, 2024 General NewsWhy Klarna does not report BNPL payments to US credit bureausMay 13, 2024 General NewsKlarna boosts climate fund with $2m as it unveils new CO2 removal innovators to receive funding and doubles its internal carbon taxMay 1, 2024 General NewsKlarna and Uber announce global partnershipApril 24, 2024 General NewsKlarna expands global partnership with Expedia Group, offering flexible payments to US consumersApril 22, 2024 General NewsKlarna and Milkywire open global biodiversity fund to other companiesApril 18, 2024 General NewsNew and improved Klarna Card announced in the US, empowering smarter spending and greater financial controlApril 17, 2024 General NewsAndrew Reed appointed to Klarna Holding AB and Klarna Bank AB BoardsApril 5, 2024 General NewsKlarna ‘Wikipink’ challenges broken US credit system with transparent dataApril 3, 2024 General NewsKlarna and Angel City Football Club to reserve seats in BMO Stadium for youth soccer players throughout the 2024 NWSL season, making the fan experience more accessibleMarch 15, 2024 General NewsKlarna reveals 2023 sustainability progress: 25% GHG emissions reduction, $24.5M for planet health, and a surge in conscious shoppingMarch 7, 2024 General NewsKlarna AI assistant handles two-thirds of customer service chats in its first monthFebruary 27, 2024 General NewsKlarna teams up with Chicago cross-stitch designer Emma “Stitch Gawd” McKee on third-annual special edition sneaker for Benny The BullFebruary 27, 2024 General NewsBuy Now, Pay Early: 97.4% of Klarna Black Friday purchases paid off on time or earlyFebruary 22, 2024 General NewsNew Klarna service takes on the US tech giants after awesome success with Swedish merchantsFebruary 14, 2024 General News2023 Spending decoded: Klarna's Money Story guides smarter budgetingJanuary 30, 2024 General NewsKlarna enters booming subscription market with the launch of Klarna Plus in the USJanuary 24, 2024 General NewsMajority of consumers see circularity as a money saver, says new report from KlarnaJanuary 18, 2024 General NewsKlarna’s annual trend report reveals ‘Fandom Fashion’ as a key shopping theme for 2023 as consumers celebrated the year of Beyoncé, Taylor Swift and Barbie, among othersNovember 30, 2023 General NewsKlarna targets $1 trillion travel sector with Cathay Pacific tie-upNovember 28, 2023 General NewsKlarna and Zalando join forces to enhance fashion retail experience in France, Italy and SpainNovember 21, 2023 General NewsUS shoppers opt for budget-savvy shopping during 2023 holidays, leveraging AI as credit debt concerns loom largeNovember 16, 2023 General NewsKlarna expands growth tools for retailers and creators through global rollout of Creator Shops and Ads ManagerNovember 13, 2023 General NewsKlarna’s US Growth Soars with GMV Up Nearly 50% YOY in Q3November 6, 2023 General NewsWalmart Canada introduces flexible Buy Now, Pay Later payment option for Canadians shopping onlineOctober 30, 2023 General NewsShaping a circular future: Klarna debuts several new conscious shopping toolsSeptember 19, 2023 General NewsKlarna is the only bank among ChatGPT Enterprise launch customersAugust 30, 2023 General NewsEurope turns pink: Klarna announces huge growth in key European marketsAugust 23, 2023 General NewsKlarna fashions a bigger partnership with MandM to take legendary brands internationalAugust 16, 2023 General NewsKlarna achieves monumental growth in Canada, with 640k active consumers and 2M orders processedAugust 1, 2023 General NewsKlarna unveils new tools enabling consumers to shop more consciously and take climate actionJune 14, 2023 General NewsKlarna says „Bună” to Romania with its interest-free “Pay in 3” service and shopping appJune 7, 2023 General NewsKlarna Reports First Quarter Results: New global partnership with Airbnb and accelerating with AIMay 26, 2023 General NewsKlarna announces multi-million contribution from internal carbon tax for game-changing climate impact solutions; shares progress on emissions reductionMay 24, 2023 General NewsKlarna and Airbnb offer flexible payments for guestsMay 18, 2023 General NewsRetail revolution: new data reveals next generation of shoppers ready for AI, AR and Robots!May 16, 2023 General NewsKlarna Assigned Investment Grade Credit Rating by S&P Global.April 27, 2023 General NewsKlarna Spotlight, Spring ‘23: New AI-powered, personalized shopping feed and innovations for consumers and retailersApril 25, 2023 General NewsKlarna and Reddit unveil the most popular ‘Buy It For Life’ items of 2023April 17, 2023 General NewsKlarna unveils progress of its Give One planet health initiative in new 2022-23 reportApril 13, 2023 General NewsKlarna brings smoooth shopping to ChatGPTMarch 23, 2023 General NewsKlarna unveils conscious badges powered by Clarity AI, the world’s first assessment of electronics brands' environmental achievementsMarch 16, 2023 General NewsKlarna Reports Fourth Quarter Results and 2022 Annual ReportFebruary 28, 2023 General NewsKlarna US growth surges with GMV up 71% YoYFebruary 22, 2023 General NewsKlarna introduces Money Story: A personal overview of your spending in 2022January 25, 2023 General NewsDutch money saving start-up iBilly’s user rates soar after partnering with Klarna KosmaJanuary 16, 2023 General NewsIntroducing Klarna Spotlight: a collection of product innovations for a new era of shoppingOctober 19, 2022 General NewsKlarna and Wix expand global partnership into Canada, bringing flexible payment options to e-commerce businesses of all sizesSeptember 29, 2022 General NewsKlarna says “Ahoj” to Czechia with its interest-free “Pay in 3” service and shopping appSeptember 27, 2022 General Newsre—inc, Klarna, and Angel City Football Club Release Limited-Edition CollabSeptember 22, 2022 General NewsKlarna says “Γεια σας” to Greece with its interest-free “Pay in 3” service and shopping appSeptember 20, 2022 General NewsKlarna manifests their position as a universal growth engine for merchants - instituting Klarna Growth AwardsSeptember 5, 2022 General NewsKlarna and StyleSeat team up to offer consumers flexible paymentsAugust 22, 2022 General NewsAirbank chooses Klarna Kosma’s open banking platform for international expansionJuly 27, 2022 General NewsKlarna partners with MEC to offer Canadians payment flexibility when shopping for outdoor gearJuly 21, 2022 General NewsPlay by new rules, and pay like a pro. Klarna and Visa change the game with new campaign promoting the Klarna card ahead of the UEFA Women’s EURO 2022™July 6, 2022 General NewsKlarna invests USD 1.7 million from its internal carbon tax in sustainability projects for maximum long-term climate impact.July 6, 2022 General NewsKlarna App is enhanced with digital wallet for easy access to loyalty cardsJune 22, 2022 General NewsKlarna Card launches in the US alongside new money management tools, empowering consumers to take control of their financesJune 1, 2022 General NewsKlarna launches Dream Deal Days to celebrate reaching 150 million consumersMay 19, 2022 General NewsKlarna partners with URBN to offer US consumers greater payment flexibilityMay 16, 2022 General NewsKlarna launches Virtual Shopping, bringing the in-store experience to online shoppersMay 12, 2022 General NewsKlarna unveils global Flexible Work Policy, meeting strong demand for hybrid workMay 11, 2022 General NewsEarly redemption of Additional Tier 1 Capital NotesApril 29, 2022 General NewsKlarna and Global-e expand global partnership to CanadaApril 27, 2022 General NewsKlarna matches consumer donations towards planet health causes this Earth WeekApril 19, 2022 General NewsStocard joins Klarna and gets “Smoooth” with an all-new brand identityApril 6, 2022 General NewsKlarna completes acquisition of PriceRunnerApril 4, 2022 General NewsKlarna partners with Chicago artist Chuck Anderson on custom sneakers for Chicago Bulls’ iconic mascot Benny the BullMarch 31, 2022 General NewsKlarna launches ‘Klarna Kosma’ sub-brand and business unit to harness rapid growth of Open Banking platformMarch 31, 2022 General NewsKlarna and Brookfield Properties enhance the in-store shopping experience for millions of US customersFebruary 25, 2022 General NewsKlarna expands to Canada with flexible “Pay in 4” service and shopping app, while announcing major investment in local economyFebruary 22, 2022 General NewsKlarna fuels global expansion with the launch of rewards program and Pay Now in nine new marketsFebruary 22, 2022 General NewsKlarna launches first-ever immersive sports activation, bringing basketball fans worldwide closer to the gameFebruary 15, 2022 General NewsKlarna launches browser extension allowing consumers to pay later across all online storesDecember 9, 2021 General NewsKlarna supercharges US offering with launch of ‘Pay Now’ option and Klarna CardNovember 23, 2021 General NewsKlarna says ‘Olá’ to Portugal and launches ‘Pay in 3’November 17, 2021 General NewsKlarna says ‘Dia dhuit’ to Ireland and launches pay in 3November 9, 2021 General NewsNext generation shopping: Klarna reveals the only shopping app consumers needNovember 3, 2021 General NewsKlarna acquires PriceRunner to strengthen banking offer for its 90m global consumersNovember 2, 2021 General NewsKlarna and Stripe enter strategic partnership to fuel growth for retailers worldwideOctober 26, 2021 General NewsKlarna acquires Inspirock, bringing smooth travel planning to its 90M global consumersOctober 22, 2021 General NewsKlarna partners with Wix, bringing flexible payment solutions to merchants worldwideOctober 21, 2021 General NewsKlarna publishes Climate report 2020/2021 and commits over 1 million USD to climate transformation projectsOctober 20, 2021 General NewsBillie and Klarna launch a global partnershipOctober 11, 2021 General NewsKlarna and Simon Announce National Strategic AllianceOctober 6, 2021 General NewsUS shoppers get a jump on the holidays, with 40% shopping earlier than last year and 22% already startedSeptember 30, 2021 General NewsKlarna reaches 1 million downloads of its ‘all-in-one’ shopping app in AustraliaSeptember 14, 2021 General NewsKlarna and Beautycounter launch ‘Better Beauty’ livestream shopping seriesSeptember 7, 2021 General NewsKlarna and Global-e expand international partnership across US, UK, France, Spain, Italy and AustraliaAugust 31, 2021 General NewsKlarna hits record 20 million US customers as demand for flexible payment options soarsAugust 23, 2021 General NewsKlarna says “Cześć!” to Poland with “Pay in 30 days”August 18, 2021 General NewsYOOX NET-A-PORTER Group and Klarna announce global partnershipAugust 9, 2021 General NewsKlarna acquires APPRL, connecting retailers and content creators as global consumers embrace social shoppingJuly 27, 2021 General NewsKlarna acquires HERO to bring best of in-store experience to social shopping for its 90m consumersJuly 9, 2021 General NewsKlarna becomes first Fintech to join The Climate Pledge and Race to Zero campaignJune 30, 2021 General NewsKlarna Launches Klarna Comparison Shopping Service across EuropeJune 15, 2021 General NewsKlarna secures additional funding as consumers demand smarter alternatives to shop, bank, & payJune 10, 2021 General NewsA$AP Rocky and Klarna team up for global campaignJune 8, 2021 General NewsKlarna says “Salut!” to France with unique shopping experienceJune 8, 2021 General NewsA$AP Rocky joins Klarna as investor and CEO for a dayJune 1, 2021 General NewsKlarna uses increasing global scale to support emerging tech centresMay 26, 2021 General NewsAnnouncement of the appointment of Roger W. Ferguson Jr to Klarna BoardMay 25, 2021 General NewsEarly redemption of subordinated Tier 2 notesMay 24, 2021 General NewsAuthentic Brands Group and SPARC Group announce exclusive partnership with Klarna to introduce ‘Pay in Four’ across their portfolio of brandsMay 20, 2021 General NewsKia ora New Zealand! Klarna brings “smoooth” shopping to Kiwis.May 4, 2021 General NewsMacy's, Inc. exclusively partners with Klarna to offer Pay in Four services in 750+ stores nationwideMay 3, 2021 General NewsKlarna launches carbon footprint insights for 90 million consumersApril 20, 2021 General NewsBluemercury and Klarna partner to offer contactless payment solution in 183 physical stores nationwideApril 7, 2021 General NewsNew Klarna survey finds nearly 80% of shoppers want fitting rooms to reopen this year, while many remain skeptical about product testingMarch 18, 2021 General NewsConsumers turn to BNPL for flexibility and security as retail readies for recoveryMarch 10, 2021 General NewsKlarna takes merchant marketing support to new heights with enhanced demand-generation servicesMarch 9, 2021 General NewsKlarna expands Open Banking solution to 8 more European marketsMarch 3, 2021 General NewsKlarna CEO challenges tech to focus on global sustainability in $1 bn funding roundMarch 1, 2021 General NewsCosmopolitan and Klarna host second virtual shopping event for Gen Z and millennials, “Hauliday by Cosmo x Klarna”February 18, 2021 General NewsWorldline and Klarna expand payment offering across EuropeFebruary 12, 2021 General NewsKlarna launches bank account in GermanyFebruary 10, 2021 General NewsKlarna partners with TELFAR to offer shoppers flexible payment solutionsFebruary 8, 2021 General NewsKlarna Continues Strong US Growth, Reaching Record Highs In Customers, Retail Partners, and Consumer App DownloadsFebruary 3, 2021 General NewsKlarna Makes Its Big Game Debut With “The Four Quarter-Sized Cowboys” Campaign Starring Four Singing Maya RudolphsFebruary 3, 2021 General NewsKlarna partners with Verifone to enable superior shopping experiences in physical stores globallyDecember 15, 2020 General NewsOnline sales spiked by 2000% during final hours of Black Friday, while shoppers prioritized electronics and marketplace purchasesDecember 2, 2020 General NewsKlarna appoints Michael Moritz as Chairman of the Klarna Board and welcomes three new global leaders to the BoardDecember 1, 2020 General NewsShoppers shift e-commerce spending towards leisure and home goods in the run-up to Black FridayNovember 25, 2020 General NewsExpress partners with Klarna in time for holiday shopping seasonNovember 25, 2020 General NewsKlarna announces partnership with Saks OFF 5TH ahead of the holidaysNovember 24, 2020 General NewsKlarna reaches a record 11 million customers in the USNovember 19, 2020 General NewsUrban Outfitters and Anthropologie partners with Klarna ahead of peakNovember 18, 2020 General NewsKlarna launches research lab to explore the future of shoppingNovember 17, 2020 General NewsKlarna launches widget to track prices during peak holiday shopping seasonNovember 12, 2020 General NewsGameStop partners with Klarna to offer gaming community a more innovative and flexible shopping experience online and in storeOctober 26, 2020 General NewsKlarna acquires Swedish post-purchase experience startup WoilàOctober 23, 2020 General NewsKlarna makes shopping more rewardingOctober 22, 2020 General NewsEtsy enables millions of US shoppers to ‘Buy Now, Pay Later’ with KlarnaOctober 20, 2020 General NewsKlarna says “Buongiorno” in Italy and launches “Pay in 3”October 20, 2020 General NewsKlarna announces partnership with Backcountry.comOctober 19, 2020 General NewsKlarna unveils new campaign with Tan France championing inclusivity and demonstrating that fashion is for everyoneOctober 12, 2020 General NewsAnnouncement of change to the Board of Directors at KlarnaOctober 8, 2020 General NewsMacy’s and Klarna announce new five-year partnership to provide more payment optionsOctober 6, 2020 General NewsKlarna partners with Missguided US to empower the brand's millennial customers with more flexible paymentsOctober 5, 2020 General NewsKlarna announces $650M funding round to further accelerate global growthSeptember 15, 2020 General NewsKlarna introduces social shopping to UK ConsumersSeptember 7, 2020 General NewsKlarna adds more than 1 million new US consumers during the summer monthsAugust 27, 2020 General NewsKlarna and Beautycounter partner to offer clean beauty to more shoppersAugust 20, 2020 General NewsKlarna partners with influencers to create live, in-game shopping experience in Animal crossingAugust 14, 2020 General NewsKlarna introduces Google Pay for in-store paymentsAugust 11, 2020 General NewsKlarna creates new ways to make shopping social with the launch of followable Wish listsAugust 4, 2020 General NewsNew Klarna data reveal that 79% of consumers would rather be healthy than wealthy this holiday seasonJuly 28, 2020 General NewsCosmopolitan and Klarna partner to launch first-ever virtual shopping event for Gen Z and Millennials: “Hauliday by Cosmo x Klarna”July 13, 2020 General NewsKlarna unveils ‘KlarnaSense’ - A new initiative to encourage smarter shoppingJuly 10, 2020 General NewsStop the bots! Klarna & Highsnobiety wants passion to win for sneakerheadsJuly 2, 2020 General NewsKlarna says “Hola” in SpainJune 30, 2020 General NewsKlarna introduces new shopping experience and app features to the USJune 29, 2020 General NewsKlarna ranks #5 on 2020 CNBC Disruptor 50 listJune 16, 2020 General NewsKlarna launches Vibe: The first buy now, pay later shopper loyalty programJune 9, 2020 General NewsKlarna reaches a record 7.85 million US customers, driven by apparel, beauty and footwear retail partnersJune 2, 2020 General NewsDune London and Klarna announce international partnershipJune 1, 2020 General NewsKlarna partners with Sephora for a more flexible shopping experienceMay 7, 2020 General NewsKlarna pledges to support the frontline response to COVID-19 with ASOS Giveback DayApril 28, 2020 General NewsA note to the Klarna community.March 19, 2020 General NewsROMWE’s Fashion and Lifestyle Essentials Are More Affordable with Klarna.March 10, 2020 General NewsMillennials value transparency, technology and talking when it comes to managing their financesMarch 5, 2020 General NewsAnt Financial Services Group & Klarna announce investment to fuel global cooperationMarch 4, 2020 General NewsSHEIN and Klarna Partner to Give Shoppers the Fashions They Want and Flexibility They NeedMarch 2, 2020 General NewsBreaking the leap day tradition: see Kirstin propose to her flabbergasted boyfriend on hidden camera.February 28, 2020 General NewsKlarna UK hits 7 million customers and 1.6 million app downloadsFebruary 26, 2020 General NewsKlarna is the ring-bearer as Lady Gaga says yes… to herselfFebruary 14, 2020 General NewsKlarna gives the finger to tradition, empowering everyone to get what or who they loveFebruary 12, 2020 General NewsKlarna acquires the Italian ‘buy now, pay later’ startup MoneymourFebruary 12, 2020 General NewsAustralia Post supports Klarna’s ‘buy now, pay later’ solution.February 11, 2020 General NewsKlarna launches global ‘Consumer Council’February 11, 2020 General NewsAppliances Online and Klarna to bring flexible payments home for Australian shoppersFebruary 10, 2020 General NewsKlarna launches in Australia - Smoooth shopping available at any online retailerJanuary 30, 2020 General NewsKlarna STYLE360 presents see and shop presentations for fall/winter NYFWJanuary 29, 2020 General NewsH&M Launches Pay Later in U.S. Market with Klarna.January 14, 2020 General NewsBuy Now, Pay Later Now Available In-Store at Major US Retailers.January 14, 2020 General NewsIt’s The Perfect ‘Time’ To Shop On Your Own TermsJanuary 13, 2020 General NewsKlarna appoints Francine Ereira as General Manager for ANZJanuary 7, 2020 General Newsschuh enhances international Klarna partnership and adds a smoooth footprint across the UK with omnichannel experience.December 19, 2019 General NewsGood American Partners with Klarna to Offer New Payment Method.December 18, 2019 General NewsKlarna opens Tech Hub in BerlinDecember 12, 2019 General NewsKlarna partners with a new merchant every 8 minutes in 2019November 26, 2019 General NewsNach Rekordinvestment im Sommer: Klarna wächst weltweit und gewinnt alle 8 Minuten einen neuen HändlerNovember 26, 2019 General NewsFunniest woman on the internet, Celeste Barber, shines a comical spotlight on smarter shopping for Klarna’s new global campaignSeptember 4, 2019 General NewsKlarna announces $460M equity raise to further support massive US growthAugust 6, 2019 General NewsKlarna verkündet Finanzierungsrunde in Höhe von 460 Millionen US-Dollar, um starkes Wachstum in den USA voranzutreibenAugust 6, 2019 General NewsSuperdry lets shoppers “Klarna it” with latest payments partnership in the US & UKJuly 18, 2019 General NewsKlarna wird bis Ende des Jahres klimaneutralJuly 16, 2019 General Newsrue21 is totally on trend with the addition of KlarnaJuly 10, 2019 General NewsKlarna announces support for new UK festival - We Out HereJuly 8, 2019 General NewsKlarna and BigCommerce expand partnership globallyJuly 3, 2019 General NewsKlarna and Abercrombie & Fitch Co. Announce Expanded PartnershipJuly 1, 2019 General NewsiSmash calls on Klarna to upgrade in-store paymentsJune 27, 2019 General NewsH&M and Klarna grow partnership to USJune 27, 2019 General NewsKlarna grows again with second UK office in central ManchesterJune 12, 2019 General NewsVet visits, veneers and varifocals: Klarna enters three new markets with Finance 4 Group partnershipJune 10, 2019 General NewsKlarna kicks off a week of immersive retailing with VIP launch and celebrity DJsJune 5, 2019 General NewsKlarna enhances eCommerce experience for QUIZ shoppers with payments makeoverMay 31, 2019 General NewsKlarna launches tickets for a week of experiential retail in London’s Covent GardenMay 31, 2019 General News‘Shop like a Queen’ everywhere with the new Klarna AppMay 28, 2019 General NewsKlarna ‘pop-up’ sets new benchmark for experiential retailingMay 22, 2019 General NewsAlipay and Klarna enable consumers to ‘buy now, pay later’ at AliExpressMay 10, 2019 General NewsKlarna and Stripe crowd-surf into events market with Kaboodle and Hideout Festival partnershipMay 8, 2019 General NewsExpedia Group and Klarna are jointly enabling travelers to “Travel now, pay later”April 9, 2019 General NewsKlarna launches global customer authentication platformApril 4, 2019 General NewsKlarna startet weltweite AuthentifizierungsplattformApril 4, 2019 General NewsKlarna launches Open Banking PlatformMarch 28, 2019 General NewsKlarna startet Open-Banking-PlattformMarch 28, 2019 General NewsGoogle Pay now live for Klarna usersMarch 13, 2019 General NewsAlternative Airlines and Klarna enable flexible payment alternatives for travellers across EuropeMarch 11, 2019 General NewsSmoooth Dogg and Klarna release unique collectionMarch 5, 2019 General NewsVon goldener Erdnussbutter bis zum Kaschmir-ToilettenpapierMarch 5, 2019 General NewsKlarna and PayBright partner to give more shoppers the ability to pay over timeMarch 1, 2019 General NewsCFDA/VOGUE FASHION FUND ANNOUNCES MARCH 2019 AMERICANS IN PARIS DESIGNERSFebruary 19, 2019 General NewsMaking Gains? Klarna’s Pay later service now available to Gymshark customers in the UK & NordicsFebruary 7, 2019 General NewsSynsam Group and Klarna launch innovative contact lens subscription in the NordicsJanuary 29, 2019 General NewsSnoop Dogg becomes a shareholder in Klarna and transforms into Smoooth DoggJanuary 17, 2019 General NewsSnoop Dogg wird Gesellschafter bei Klarna und verwandelt sich in Smoooth DoggJanuary 17, 2019 General NewsSnoop Dogg wird smoooth in neuer Klarna-KampagneJanuary 17, 2019 General NewsKlarna links up with Daniel Wellington to allow shoppers to slice their purchase and pay over timeJanuary 10, 2019 General NewsApple Pay Coming to Klarna’s usersDecember 11, 2018 General NewsUS: Financial limitations are the top cause of holiday shopping stress say consumersDecember 10, 2018 General NewsKlarna appoints Wilko Klaassen as new General Manager for Belgium and the NetherlandsDecember 7, 2018 General NewsKlarna joins Shopify Plus Partner Program to power high-growth merchantsDecember 6, 2018 General NewsFintech Disruptor 2019: Digital relevance, open architectures, automation, and data – the new frontline in the battle for the customerDecember 6, 2018 General NewsKlarna als Integration beim Shopify Plus Partner-Programm für wachstumsstarke HändlerDecember 6, 2018 General NewsKlarna launches ‘Boost’ to supercharge SME growthNovember 19, 2018 General NewsKlarna and Shopify further strengthen global partnershipOctober 30, 2018 General NewsMollie and Klarna partner: where simplicity meets flexibilityOctober 9, 2018 General NewsH&M and Klarna partner to elevate the modern shopping experience for consumersOctober 8, 2018 General NewsNO: Netthandelsgruppen selects Klarna as payments providerOctober 3, 2018 General NewsOXID integrates Klarna as core payment solutionSeptember 27, 2018 General NewsOXID integriert Klarna als zentrale ZahlungslösungSeptember 27, 2018 General NewsMYBESTBRANDS launches Universal Checkout in collaboration with payment provider KlarnaSeptember 25, 2018 General NewsKlarna grows again, acquiring Close Brothers Retail Finance to strengthen position in UK marketSeptember 14, 2018 General NewsUK: The Fragrance Shop joins forces with Klarna to bring customers pay after delivery optionAugust 29, 2018 General NewsFI: Klarna strengthens leadership team in FinlandAugust 22, 2018 General NewsEtsy cooperates with Klarna: New payment options for shops in Germany from June 2018 onwardsJune 20, 2018 General NewsKlarna opens for team applications – part of large recruitment offensiveJune 15, 2018 General NewsKlarna Honored with Magento Marketplace Innovator Award at Imagine 2018May 22, 2018 General NewsKlarna puts customers in charge over personal finances with new appMay 4, 2018 General NewsKlarna Announces Integration with Magento Commerce to Streamline the Checkout Process and Improve ConversionsApril 26, 2018 General NewsMan hit by sound waves in new ad by KlarnaApril 16, 2018 General NewsKlarna initiates advanced space program to offer payment solutions on MarsApril 1, 2018 General NewsSE: Redgert och Dietz ska bli smoooth med KlarnaMarch 28, 2018 General NewsNL: Klarna and MyOnlineStore partner up to offer all-in-one online commerce solutionMarch 27, 2018 General NewsU.S. Online Merchants Believe Instant Financing Will Drive Increased SalesMarch 19, 2018 General NewsRecord year for Klarna as the company continues to grow rapidlyFebruary 28, 2018 General NewsAnnouncement of change to the Board of Directors at Klarna Bank ABFebruary 22, 2018 General NewsKlarna to close its Tel Aviv office siteFebruary 13, 2018 General NewsKlarna appoints new General Manager for DACH RegionFebruary 12, 2018 General NewsKlarna partners with London College of Fashion, UALJanuary 31, 2018 General NewsTis’ the season to be frazzled: 1 in 6 want to go on holiday to escape the festive frenzy – and almost a third of Brits are exhausted by Boxing DayDecember 11, 2017 General NewsGlobal: Worldpay partners with Klarna to launch invoice and credit based payments in 6 key European marketsDecember 6, 2017 General NewsPPRO Group and Klarna partner to offer risk-free credit payment methods across EuropeNovember 15, 2017 General NewsKlarna Announces Completion of Acquisition of BillPaySeptember 13, 2017 General NewsSwedish Tech Bank Klarna Launches “Smoooth” BrandAugust 29, 2017 General NewsKlarna Launches “Smoooth” BrandAugust 29, 2017 General NewsKlarna launches “Wavy” Peer-to-Peer Payment ServiceAugust 1, 2017 General NewsKlarna and Permira Announce Strategic Equity InvestmentJuly 21, 2017 General NewsGlobal: Klarna and Permira Announce Strategic Equity InvestmentJuly 21, 2017 General NewsVisa Commits to Strategic Investment in Klarna; Companies Plan Partnership DealJune 27, 2017 General NewsKlarna – Europe’s Newest Bank is bornJune 19, 2017 General NewsKlarna Announces Strategic Equity Investment by Brightfolk A/SJune 7, 2017 General NewsGlobal: Klarna Announces Strategic Equity Investment by Brightfolk A/SJune 7, 2017 General NewsKlarna Brings Instant Financing Options to Shopify’s Online Merchants in Nine MarketsMarch 21, 2017 General NewsGlobal: Klarna Brings Instant Financing Options to Shopify’s Online Merchants in Nine MarketsMarch 21, 2017 General NewsKlarna announces acquisition of BillPayFebruary 6, 2017 General NewsKlarna hires talent behind Cookies payment appNovember 22, 2016 General NewsGlobal: Klarna partners with global technology company WacomNovember 3, 2016 General NewsKlarna Checkout now supports American ExpressSeptember 12, 2015 General NewsMichael Rouse Joins Klarna as Chief Commercial OfficerJuly 15, 2015 General NewsShow morePress kit.Company information and images library.Download press kitAbout Klarna.Since 2005 Klarna has been on a mission to accelerate commerce with consumer needs at the heart of it. With over 150 million global active users and 2 million transactions per day, Klarna’s fair, sustainable and AI-powered payment and shopping solutions are revolutionizing the way people shop and pay online, empowering consumers to shop smarter with greater confidence and convenience. More than 500,000 global retailers integrate Klarna’s innovative technology and marketing solutions to drive growth and loyalty, including H&M, Saks, Sephora, Macy’s, Ikea, Expedia Group, Nike and Airbnb.Klarna is a founder-led company backed by Sequoia Capital and a broad base of internationally distinguished investors and institutions including Bestseller, Commonwealth Bank of Australia, Mubadala Investment Company, Silver Lake, Dragoneer, GIC, BlackRock, Wellcome Trust, CPP Investments and Atomico. For more information, visit Klarna.com.Total active consumers150 million+Total number of merchants500,000+Purchases/Day2 million+Markets45Number of employees5,000Number of different citizenship's100+ Show moreKlarnaAbout usCareersPressWikipinkHomeCustomer serviceTerms & conditionsPrivacy policyTracking technology noticeSecurity tipsDigital Services ActBusinessSell with KlarnaContact usDeveloper documentationKlarna open bankingGlobalChoose your language and regionKlarna is available around the world with a variable offering, choose one that suits you best.AustraliaEnglishÖsterreichDeutschBelgiëNederlandsBelgiqueFrançaisCanadaEnglishCanadaFrançais中国中文(简体Česká republikaČeštinaDanmarkDanskSuomiSuomiFranceFrançaisDeutschlandDeutschΕλλάδαΕλληνικάMagyarországMagyarIrelandEnglishItaliaItaliano日本日本語MéxicoEspañolNederlandNederlandsNew ZealandEnglishNorgeNorskPolskaPolskiPortugalPortuguêsEspañaEspañolSlovenskoSlovenčinSverigeSvenskaSchweizDeutschSwitzerlandEnglishSuisseFrançaisSvizzeraItalianoUnited KingdomEnglishUnited StatesEnglishRomâniaRomânăKlarnaAbout usCareersPressWikipinkHomeCustomer serviceTerms & conditionsPrivacy policyTracking technology noticeSecurity tipsDigital Services ActBusinessSell with KlarnaContact usDeveloper documentationKlarna open bankingCopyright © 2005-2024 Klarna Bank AB (publ). Headquarters: Stockholm, Sweden. All rights reserved. Klarna Bank AB (publ). Sveavägen 46, 111 34 Stockholm. Organization number: 556737-0431CookiesSitemapKlarna.com"}]}