{"text": [{"https://koloma.com/": "\n\n\n\n\n\n\n\n\nHome - Koloma\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbout\n\nAbout\nBoard of Directors\nTeam\n\n\nGeologic Hydrogen\n\nGeologic Hydrogen\nResources\n\n\nResponsibility\nContact\n\nContact\nCareers\n\n\n✚\n\nHome A\nHome\nHome B\nHome C\nOlivine Nav\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nThe low-cost, low-carbon solution for the energy transition is just below the surface.\n\nVast stores of hydrogen are present beneath the earth’s surface. Koloma has developed the technology to identify, access, and produce geologic hydrogen, resulting in clean, cost-effective energy worldwide.\n\nLearn More\n\n\n\n\n\n\n\n© 2023 Koloma\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\nFacebook\n\n\n\n\nX\n\n\n© \n\n\n\n\n\n  \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://koloma.com/board-of-directors/": "\n\n\n\n\n\n\n\n\nBoard of Directors - Koloma\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbout\n\nAbout\nBoard of Directors\nTeam\n\n\nGeologic Hydrogen\n\nGeologic Hydrogen\nResources\n\n\nResponsibility\nContact\n\nContact\nCareers\n\n\n✚\n\nHome A\nHome\nHome B\nHome C\nOlivine Nav\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nBoard of Directors\n\n\n\n\n\n\n\n\n\n\nPete JohnsonCEOCharles GriffieBoard of DirectorsChristian GarciaBoard of DirectorsDuane DicksonBoard of DirectorsJim FarnsworthBoard of DirectorsLisa StewartBoard of DirectorsShayle KannBoard of Directors\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n© 2023 Koloma\n\n\n\n\n\n \n\n\n\n\n  \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://koloma.com/team/": "\n\n\n\n\n\n\n\n\nTeam - Koloma\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbout\n\nAbout\nBoard of Directors\nTeam\n\n\nGeologic Hydrogen\n\nGeologic Hydrogen\nResources\n\n\nResponsibility\nContact\n\nContact\nCareers\n\n\n✚\n\nHome A\nHome\nHome B\nHome C\nOlivine Nav\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nTeam\n\n\n\n\n\n\n\n\nExecutives\n\n\nPete JohnsonCEOJeff KnuppCFOTom Darrah, PhDCTOErik Scher, PhDCCOTim ChisholmCXOPaul HarrakaCBO\n\n\n\n\n\n\nTeam\n\n\nAlex DreherProject ManagerBrent LoukField Laboratory TechnicianBrice CallahanField Laboratory TechnicianChris DavinDirector, GeophysicsChristopher Gardner, PhDPrincipal Research Scientist & Lab ManagerCody RobinsonDirector, EngineeringColin Whyte, PhDManager, Geologic ResearchDave GuroVP, Product ManagementEmily Yedinak, PhDSr. Technical AnalystErin BauerEngineering TechnicianGabe MullerSr. Production EngineerGus WulsinResearch GeologistJake HarringtonDirector, New VenturesJeff BrownEnvironmental, Health, and Safety ManagerJoe NicoletteGeologistKasi SteeleSr. Exploration GeologistKaty ArreolaOffice ManagerKristen DelanoPublic Affairs LeadLa’Teese HallSr. Lab TechnicianMilton SestitoSr. Reservoir EngineerMinko NikolovControllerNevine NagjiDirector, PeoplePeter KrasResearch AssociateSam MortonDirector, Commercial StrategySam SorberSr. PetrophysicistTera DillonGeoscience TechnicianTeresa AvilaSr. Research AssociateTrevor AitkenDirector, GeoscienceValeria MatternLab TechnicianWesley SellnerSr. Facilities Engineer William Eymold, PhDSr. Data Scientist\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n© 2023 Koloma\n\n\n\n\n\n \n\n\n\n\n  \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://koloma.com/geologic-hydrogen/": "\n\n\n\n\n\n\n\n\nGeologic Hydrogen - Koloma\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbout\n\nAbout\nBoard of Directors\nTeam\n\n\nGeologic Hydrogen\n\nGeologic Hydrogen\nResources\n\n\nResponsibility\nContact\n\nContact\nCareers\n\n\n✚\n\nHome A\nHome\nHome B\nHome C\nOlivine Nav\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nGeologic Hydrogen\n\n\n\n\n\n\n\n\n\nOf the occurrences that naturally take place in the earth’s subsurface, one is an oxidation-reduction reaction known as serpentinization. Through this water-rock reaction, considerable quantities of hydrogen are continuously produced and stored in geological formations. Studies have suggested that the earth naturally replenishes up to 23 Mt/year (or 30% of today’s annual hydrogen demand) through these processes. This naturally occurring and regenerative gas is known as  geologic hydrogen.\n\n\n\n\n\n\nGeologic hydrogen’s unique attributes make it clean and environmentally friendly.\n\nGeologic hydrogen originates from iron-rich source rocks, which sharply contrasts with the mature, organic (carbon-rich) source rocks that generate oil and gas. As a result, geologic hydrogen can be produced with:\n\n\n\n\n\n\n\n\nLow Carbon Intensity\nResulting in a low carbon footprint, on par with electrolysis.\n\n\n\n\nMethodology\n\nQReferences for Carbon Intensity\n1 Carbon intensity of hydrogen production values for Central PEM (renewable), Central PEM (grid), SMR, and SMR + CCS were obtained from the 2022 GREET model.\n2 The carbon intensity of hydrogen production for geologic hydrogen was calculated based on the production weighted-mean of the baseline geologic hydrogen case study reported in “Brandt, A. Greenhouse Gas Intensity of Geologic Hydrogen Produced from Subsurface Deposits. 2023. EarthArXiv preprint. https://doi.org/10.31223/X5HM1N”, excluding the global warming impact of fugitive hydrogen emissions and embodied emissions of the well casing, consistent with carbon intensity methodology calculated by GREET.\n\n\n\n\n\n\n\n\n\nNo External Water Inputs\nAs a primary energy source, it requires no water to support electrolysis.\n\n\n\n\nMethodology\n\nQReferences for Water Consumption\n1 Water consumption factors/water intensity values for Central PEM (renewable), SMR, and SMR with CCS were obtained from the 2022 GREET model under the “WCF” tab. The water consumption factor for the central PEM using grid electricity was calculated based on summing the feedstock and fuel water consumption values in the “Hydrogen” tab (see 4.1) setting the electricity source for hydrogen production to the US average electricity mix. This value is similar to the value 27 gal/kg calculated by Webber, M. Environ. Res. Lett. 2 (2007).\n2 Geologic hydrogen water consumption factor was estimated based on the production-weighted mean for the baseline scenario reported in “Brandt, A. Greenhouse Gas Intensity of Geologic Hydrogen Produced from Subsurface Deposits. 2023, preprint. EarthArXiv. https://doi.org/10.31223/X5HM1N” which represents the total produced water value.\n\n\n\n\n\n\n\n\n\n\n\nNo External Energy Inputs\nAs a primary energy source, it requires no electricity or heat.\n\n\n\n\nMethodology\n\nQReferences for Energy Intensity\n1 Energy Intensity refers to energy supplied to produce hydrogen and does not include embedded energy for the facility.\n2 Energy intensities for electrolysis, steam methane reforming, and steam methane reforming with carbon capture were obtained from GREET 2022.\n3 The energy intensity of geologic hydrogen production was calculated based on the baseline scenario reported in “Brandt, A. Greenhouse Gas Intensity of Geologic Hydrogen Produced from Subsurface Deposits. 2023, preprint. EarthArXiv. https://doi.org/10.31223/X5HM1N”. The main energy inputs considered are for the reinjection compressor and gas dehydration.\n\n\n\n\n\n\n\n\n\nMinimal Surface Disruption\nWhere even a high-volume hydrogen production site is almost unnoticeable.\n\n\n\n\nMethodology\n\nQReferences for Technology Footprint\n1 Yearly hydrogen production based on a commercial, state-of-the-art steam methane reformer modeled in NETL’s recent life cycle report “Comparison of Commercial, State-of-the-Art, Fossil-Based Hydrogen Production Technologies” from April 2022. Annual output from one such SMR was assumed to be 175,791,300 kgH2/year.\n2 Electrolyzer efficiency assumed to be 50 kWh/kg H2. For electrolyzers supplied by 100% solar energy, it was assumed 3.5 acres/GWh/year (the solar generation-weighted average across all solar technologies) as reported in NREL’s 2013 report “Land Use Requirements for Solar Power Plants in the United States”. https://www.nrel.gov/docs/fy13osti/56290.pdf. For electrolyzers supplied by 100% wind energy, it was assumed an average of 26 acres/GWh/year, consistent with data obtained from the EIA https://www.freeingenergy.com/math/wind-land-acres-hectares-miles-m119/. For electrolyzers supplied by 100% nuclear energy, a capacity factor of 92% and 1.3 square miles per GW capacity was assumed https://www.nei.org/news/2015/land-needs-for-wind-solar-dwarf-nuclear-plants.\n3 The footprint of an SMR and SMR with CCS was assumed to be 100 acres, consistent with NETL’s analysis reported in “Comparison of Commercial, State-of-the-Art, Fossil-Based Hydrogen Production Technologies” from April 2022. The footprint of the natural gas wells to produce NG for the SMR facility was calculated assuming that a natural gas well produces on average 181,647 ft3/day (https://www.eia.gov/petroleum/wells/pdf/full_report.pdf) and that 5 wells could occupy a 10-acre well pad site (https://www.e-education.psu.edu/earth109/node/941).\n4 For geologic hydrogen, the footprint of a PSA unit to purify the hydrogen was assumed to be 0.3 acres (https://www.osti.gov/biblio/1090707), and a production weighted mean for the baseline scenario reported in “Brandt, A. Greenhouse Gas Intensity of Geologic Hydrogen Produced from Subsurface Deposits. 2023, preprint. EarthArXiv. https://doi.org/10.31223/X5HM1N”.\n\n\n\n\n\n\n\n\nAbbreviations: SMR – Steam methane reforming, CCS – Carbon capture and sequestration\n\n\n\n \n\n\n\n\n\n\n\n\n\n© 2023 Koloma\n\n\n\n\n\n \n\n\n\n\n  \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://koloma.com/resources/": "\n\n\n\n\n\n\n\n\nResources - Koloma\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbout\n\nAbout\nBoard of Directors\nTeam\n\n\nGeologic Hydrogen\n\nGeologic Hydrogen\nResources\n\n\nResponsibility\nContact\n\nContact\nCareers\n\n\n✚\n\nHome A\nHome\nHome B\nHome C\nOlivine Nav\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nResources\n\n\n\n\n\n\n\n\nAcademic & Technical Papers\n\n\nGreenhouse Gas Intensity of Geologic Hydrogen Produced from Subsurface Deposits.July 27, 2023Natural geologic hydrogen (H2) could supply climate-friendly energy. We perform a prospective life cycle assessment (LCA) of a generic natural H2 production and processing system...Joule\n\n\n\n\nMedia\n\n\nBill Gates Is Backing A Secretive Startup Drilling For Limitless Clean EnergyJuly 19, 2023It's been 37 years since a subterranean coal fire forced Tom Darrah's family to flee their home in Centralia, Pennsylvania. ...ForbesUnderground Hydrogen Could Supercharge Green Energy. First, Scientists Have to Find It.June 5, 2023It has the potential to power electrical grids, run factories, heat homes and propel vehicles when combined with a fuel cellThe Wall Street JournalUncovering hidden reserves of natural hydrogenMarch 6, 2023Recent discoveries have unearthed a bonanza of natural hydrogen in significantly larger quantities than was previously ...Advanced Science NewsA Gold Mine of Clean Energy May Be Hiding Under Our FeetFebruary 27, 2023Sometimes we miss things in front of our faces. We don’t see what we aren’t looking for. “We can be blind to the obvious, ...New York TimesHidden HydrogenFebruary 16, 2023IN THE SHADE of a mango tree, Mamadou Ngulo Konaré recounted the legendary event of his childhood. In 1987, well diggers had ...ScienceNatural Hydrogen: The New FrontierMay 1, 2022Geological hydrogen could revolutionise our low-carbon future. Philip J. Ball and Krystian Czado report on discussions of ...GeoscientistAustralian Island Draws Gas Prospectors Seeking Pot of Gold HydrogenMarch 1, 2022On Kangaroo Island off the coast of Adelaide, a band of former gas explorers believe they are on the verge of discovering ...Financial Times\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n© 2023 Koloma\n\n\n\n\n\n \n\n\n\n\n  \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}]}