{"text": [{"https://www.li-ind.com": "Li Industries | A New Age of Battery Recycling\n\n\nSolutionsSmart Battery SortingDirect E2E™ Li-ion Battery RecyclingAbout UsCareersTeamPressOrderGet IN touchA new age of battery recyclingAt Li Industries, we are building battery recycling technologies that enable greater automation, competitiveness, and sustainability.Our work has been Supported byGet in touchOur SolutionsWe work with LIB manufacturers, cathode producers, battery recyclers, battery collectors, and more to build advanced technologies that help our partners find greater efficiencies in their supply chains.Smart Battery SortingOur Smart Battery Sorting solutions automate battery identification and separation using artificial intelligence and a suite of robust measurement techniques. These systems are capable of separating batteries by specific chemistry with greater accuracy, higher speeds, and lower cost than traditional methods.Direct Li-ion Battery RecyclingOur innovative direct recycling process isolates the various components from spent lithium-ion batteries and regenerates them into commercial-grade battery materials for reuse. This novel recycling method is more cost effective and sustainable than others.Learn moreLearn MoreCreating a truly circular economyOur technology solutions focus on finding greater efficiencies in the current battery recycling supply chain. We are able to drive meaningful cost savings while also ushering in a new era of environmental sustainability. A tech-first, automated approach to battery recyclingWe embrace the newest technologies to automate traditionally manual processes, resulting in lower costs, greater accuracy, and increased predictability over the supply chain.Our mission is to make recycling available to all.We believe in a world where efficient recycling processes aren't a nice-to-have but are rather the standard.Talk to usInterested in partnering? Get in touch.First name:Last name:Company Name: Title: Email:Message:Thank you! Your submission has been received!Oops! Something went wrong while submitting the formLi Industries: 10021 Rodney St., Pineville, NC 28134Li Industries-Engineering Center: 5130 Hovis Road, Suite H, Charlotte, NC 28208 Li Industries-R&D Center: 1872 Pratt Drive, Suite 1500, Blacksburg, VA 24060© 2023 Li Industries. All rights reserved."}]}