{"text": [{"https://www.linovaenergy.com/": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLinova Energy | Home\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageCOMPANYTECHNOLOGYTEAMCONTACTBLOGRevolutionary Polymer Cathode BatteryLiNova Energy is developing ultra-high-energy batteries utilizing a Polymer Cathode for the EV, Aerospace, and Energy Storage industries. Unleashing the potential of metal-free cathodes, our batteries require no Nickel or Cobalt, ensuring a sustainable and cost-effective power solution.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nA Sustainable Future Powered By LiNova Energy© 2024 LiNova Energy\n\n\n\n\n\n\n\n\n\n\n\n\nEmail\n\n\n\n\nLinkedIn\n\n\n\n\nAddressbottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.linovaenergy.com/about-5": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTECHNOLOGY | LIN\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageCOMPANYTECHNOLOGYTEAMCONTACTBLOGThe Power of Metal Free CathodesEnergy DenseMost energy dense cathode in the world.1/10th the cost of NMCLow CostSustainableNo Nickle or cobalt. North American supply chain.SafeNo thermal runway.LiNova Energy Designed ProductsAerospace CellEnergy and Cost AdvantagesLiNova’s polymer cathode is a platform technology that offers a significant cost advantage over the LFP and Li-Ion NMC cathode competitors, while offering a higher energy density. The Company’s polymers are abundant and readily available throughout North America.© 2024 LiNova Energy\n\n\n\n\n\n\n\n\n\n\n\n\nEmail\n\n\n\n\nLinkedIn\n\n\n\n\nAddressbottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.linovaenergy.com/about": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLinova Energy | Team\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageCOMPANYTECHNOLOGYTEAMCONTACTBLOGMeet the TeamPowering a better tomorrow LiNova Energy has assembled a team of globally renowned battery experts, to propel groundbreaking advancements in energy storage.EXECUTIVE TEAMMICHAEL NAGUSChief Executive OfficerOver the past 12 years, Mike has held upper-level management positions in the commercial battery manufacturing space, including President of Charger Industries, and Power Products at HPC. Mike has a Bachelor's of Science in Mechanical Engineering from the University of Saskatchewan.LIN-FENG LIChief Technical OfficerLin-Feng has two decades of energy technology and management experience. His experience includes scaling up a battery manufacturing facility and bringing the venture to full production. Lin-Feng has over 20 issued and pending US patents and has been PI for over $30 million of DOD, ARPA-E, DOE, NSF, NASA and NYSERDA SBIR and non-SBIR programs. Lin-Feng has B.S. degrees in both Chemistry and Applied Physics from Tsinghua University and a Ph.D. in Chemistry from Case Western Reserve University.ZEIAD MUNTASSERChief Operations OfficerZeiad has over 20 years of technology and leadership experience in the battery field, with expertise in new product development, battery design, and electrode coating and processing. Prior to LiNova, Zeiad was the president of Alionyx Energy Systems. He had previously been Director of Product Development at Engineered Power, and worked at Enevate and EnerSys. Zeiad has managed over $50 million of private and government projects and has more than ten issued and pending patents.  Zeiad has an M.S. in Corrosion,  from Dalhousie University and an B.S. in Mechanical Engineering.GUY LONGOBARDODirector of Legal AFGuy has business and legal experience in a broad range of industries. Prior to LiNova, he was the Managing Director and Head of Corporate Finance with HSBC Securities and Chairman and CEO of ETS Payphones Inc. Guy holds a B.A. in Economics from Williams College and a J.D. from the Columbia University School of Law.BOB GAYLENDirector and Technical AdvisorBob is recognized as one of the top executives in the battery energy storage world and science/engineering-based communities. His positions as CTO of CATL (the world’s largest battery manufacturer), Chairman of SAE International Battery Standards Steering Committee, SAE Fellow, Chairman Emeritus and CTO of NAATB International, provide him a unique leadership perspective in the global battery industry.DR. SIMON JONESTechnical AdvisorSimon has 18 years of chemical technology and leadership experience focused on the commercialization of technologies developed at Caltech and MIT. Currently the CEO of Fluid Efficiency, as Caltech-originated. Past relevant experience includes Senior member of the Technical Staff, NASA-JPL; Vice-President Technology, Countour Energy Systems, a battery technology company based in CA; and Research Chemist, Materia Inc. working with Dr. Robert Grubs (the 2005 winner of the Nobel Prize in Chemistry).Technical TEAMJASIM UDDINMOHAMED EL KUMBARIDirector of Cathode DevelopmentMechanical EngineerDEMETRIO BATACMechanical EngineerMAGGIE LIUR&D ManagerANIX CASIMIRChemical\nEngineerMUFENG WEIResearch\nEngineerWILSON NGSenior Process\nEngineerSHUO FENGResearch\nScientistJOHN PAUL RUIZDirector of EngineeringLEI YAOProcess\nEngineer© 2024 LiNova Energy\n\n\n\n\n\n\n\n\n\n\n\n\nEmail\n\n\n\n\nLinkedIn\n\n\n\n\nAddressbottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.linovaenergy.com/contact": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLinova Energy | Contact\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageCOMPANYTECHNOLOGYTEAMCONTACTBLOGGet in Touch602 E Huntington Drive\nMonrovia, California, 91016info@linovaenergy.comFirst NameLast NameEmailMessageSendThanks for submitting!© 2024 LiNova Energy\n\n\n\n\n\n\n\n\n\n\n\n\nEmail\n\n\n\n\nLinkedIn\n\n\n\n\nAddressbottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.linovaenergy.com/blog": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLiNova Energy | Blog\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageCOMPANYTECHNOLOGYTEAMCONTACTBLOGNEWS & UPDATESBLOGAdminJul 22 minLiNova Energy Secures $15.8 Million in Series A Financing to Accelerate High Energy Polymer Cathode Battery Development Mike Nagus - CEO of LiNova Energy Inc. MONROVIA, Calif., April 30, 2024 /PRNewswire/ --  LiNova Energy Inc. (Linova) has raised $15.8...0 comments0Post not marked as liked© 2024 LiNova Energy\n\n\n\n\n\n\n\n\n\n\n\n\nEmail\n\n\n\n\nLinkedIn\n\n\n\n\nAddressbottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}]}