{"text": [{"http://www.loamist.com/": "Loamist\n\nHomeAboutWork with usBook a demoWe make abundant waste biomass accessibleMeasurable, auditable, and performant supply chains.Book a demoFeatures01. Biomass Explorer Get the full picture with instant access to feedstock resources nationwide alongside relevant infrastructure, biomass utilization, and much more.  1M+Data Points200+Data Layers02. Analyses unlock local resourcesExperience a streamlined approach to extracting valuable insights, crafting comprehensive analyses, and presenting impactful findings. Empower your business with our user-friendly analysis tool.03. Unparalled access to suppliersWe give you the tools to build and manage your local supply chain. Track your feedstock contacts and attestations in our integrated system.300k+Contact Data BaseNeed carbon compliance?Qualify and then Track and Trace your supply chain with Biomass Validator. Qualify Feedstock SupplyTrack ShipmentsTrace C02 EmissionsManage FilesJoin the waitlist!\nThird Party Qualifing Supply ChainsWe qualify for third-party certification and compliance requirements, ensuring your carbon project meets the highest standards with confidence.About UsWe find better uses for biomass than burning and landfilling. 18% global CO2From burning agricultural residues11% of methaneFrom landfilling biomassBackgroundPete and Andy's five-year friendship and research led them to focus on waste biomass as key to circular materials. They tackled the challenge of an nascent supply chain by enhancing access to biomass, connecting the Bioeconomy. Pete brings academic and startup experience, while Andy's background includes engineering, product management, and design. Learn moreMisionCatalyze the  bioeconomy by increasing  access to waste biomassVisionBy 2030, facilitate the utilization of 100M tons  of waste biomassValuesListen, Integrity, Human Element, NatureWho is Loamist for?Economic Development OfficesAttract projects to your region with best in class software to highlight resources and connect supply to project developers.Project DevelopersBuild supply chains faster with our tools to find and qualify supply. We connect you to 300,000 suppliers instantly.Biomass SuppliersIncrease diversion rates by qualifying your waste streams for high value end uses. Loamist DirectoryBe a part of our DirectoryHaulersMoving biomass and want to connect with buyers and suppliers? Loamist sends you business. Join Us!SuppliersNeed to find offtake for your biomass? Want help increasing the value and demand of your waste streams. Loamist can help.Join Us!Join our Newsletter\nLoamist 2024 All rights reservedTerms & ConditionsPrivacy"}]}