{"text": [{"https://www.lohum.com/": "\n\n\n\n\n\nGlobal Lithium-Ion Battery Recycling Company | LOHUM\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tSkip to content\n\n\n\n\n \n\n\nProducts\n\nBattery Materials\nLi-ion Batteries\n\n\nOur Solutions\n\nRecycle with Lohum\nBattery Residual Value\nEPR Partnerships\n\n\nAbout Us\n\nCompany Overview\nContact Us\nESG\n\n\nCareers\nMedia\n\nBlog\nNews\nPress\n\n\nEPR Portal\nEnquire Now\n \n\n\n\n\n\n\n\n\n\n\n\nMenu\n\n\n\n\n\n\n\n\n\n×\n\n\n\nProducts\n\nBattery Materials\nLi-ion Batteries\n\n\nOur Solutions\n\nRecycle with Lohum\nBattery Residual Value\nEPR Partnerships\n\n\nAbout Us\n\nCompany Overview\nContact Us\nESG\n\n\nCareers\nMedia\n\nBlog\nNews\nPress\n\n\nEPR Portal\nEnquire Now\n \n\n\nEnquire Now\n\n\n\n\nTwitter\n\n\n\n\n\n\n\nLinkedin\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSafeguarding Earth’s Tomorrow, Today. \n\n\n\nAdvancing climate-tech via low-carbon lithium ion battery recycling, producing sustainable battery metals & chemicals from used batteries. \n\n\n\n\n\n\n\n The LOHUM Impact\nReal-time CO2e savings till date\n\nRecycling :111,812 MT \nReuse    :8,330 MT \nOur target  by 2026  :4,000,000 MT \n \n\n\n\n\n\n\n\n\n\n\n\n\n \n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n\n\n\n\n\n\nLITHIUM ION BATTERY RECYCLING \n\n\n\nTHE CHALLENGE \n\n\n\nThe climate crisis is imminent, and energy security is at risk. \n \n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n Rising temperatures, severe weather conditions, increasing droughts, floods, hurricanes, the list of dangers induced by climate change is alarming. The world is scrambling to shift away from fossil fuels, and towards clean energy powered by Lithium ion battery recycling. In our quest to push the energy industry closer to net zero, we strive to be a key pillar of closed-loop Lithium ion battery recycling and repurposing. We reduce dependency on mining for battery minerals by fostering a 100% circular supply chain with unparalleled transparency. At LOHUM, accelerating the shift towards a circular, responsible, and climate-conscious battery ecosystem is at the core of all decisions! \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLITHIUM ION BATTERY RECYCLING \n\n\n\nTHE SOLUTION \n\n\n\nLOHUM: The largest producer of sustainable energy transition and battery raw materials through recycling, repurposing, and low carbon refining. \n\n\n\n \n\n\n\n\n\n\nLOHUM: the largest producer of sustainable battery raw materials through recycling, repurposing, and low-carbon refining.As a climate-tech company, we host single-point lithium ion battery recycling & reuse solutions to overcome industry-wide obstacles to sustainable energy storage.We’re the charge behind environment-focused battery energy technology, and we’re building a zero-waste battery materials supply chain to power the entire industry.The critical lithium ion battery raw materials we recover and recirculate to the market lower battery costs, reduce reliance on mining, and advance energy security for all. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBattery Lifecycle Management Solutions \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nRecycle with us \n\n\n\nAs an OEM or Dealership, are you looking to recycle your used or scrap batteries?Achieve your battery sustainability goals through our NEETM™ Lithium ion battery recycling and extraction technology. \n\n\n\n\n\n\n\n \nLearn more\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nBattery residual value \n\n\n\nAre you an OEM, or Financier looking to discover the residual value of your Lithium ion battery? Access industry-leading salvage prices in real-time via the DETX™ index, and unlock optimal second life applications.  \n\n\n\n\n\n\n\n \nLearn more\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nEPR partnership \n\n\n\nAre you a battery manufacturer looking to fulfill your Extended Producer Responsibility (EPR)? Ace your EPR targets with our traceability and EPR portal that generates BWMR-compliant lithium ion battery recycling certificates. \n\n\n\n\n\n\n\n \nLearn more\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOur products \n\n\n\n\n\n\n\n\n \n\n\n\n\n\nEnergy storage applications \n\n\n\n\n\n\n\n\n\n\nFor homes, offices, and industry powered by repurposed 2nd life Li-ion batteries. \n\n\n\n\n\n\n\n \nLearn more\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nBatteries for low power e-mobility \n\n\n\nLi-ion 2-wheeler and 3-wheeler applications for tough operating environments. \n\n\n\n\n\n\n\n \nLearn more\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\nBattery Materials \n\n\n\nHigh-purity battery raw materials ready for use in the production of Cathode Active Materials (Li, CO, Ni, Mn) and Anode (Graphite), recovered via our NEETM™ Lithium ion battery recycling technology. \n\n\n\n\n\n\n\n \nLearn more\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBattery materials can be recycled and reused endlessly. What is currently treated as waste can be reclaimed with our patented NEETM™ process, and recirculated infinitely. \n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLOHUM in numbers \n\n\n\n\n\n\n\nFounded \n\n\n\n \n\n\n2018\n\n\n\n\n\n\n\n\n\n\n\nCombined Capacity \n\n\n\n4  GWh \n\n\n\n\n\n\n\nPeople \n\n\n\n\n\n\n600\n\n\n\n\n\n\n\n\n\n\n\nLocations \n\n\n\n\n\n\n0\nIndia, USA, EU\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nOur Impact \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n50\n+\n\n\n\n\n\n\nKgs CO2e saved per KWh of Lithium ion battery recycling capacity vs mining. \n\n\n\n\n\n\n\n\n\n\n100\n+\n\n\n\n\n\n\nKgs CO2e saved per KWh of reused battery capacity vs mining. \n\n\n\n\n\n\n\n\n\n\n500\nX\n\n\n\n\n\n\nLess water consumed per ton of LIBs recycled. Mining consumes 500,000 liters! \n\n\n\n\n\n\n\n\n\n\n30000\n+\n\n\n\n\n\n\nLithium ion battery recycling industry jobs created by 2026 \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nChallenges We AddressThe world’s transition to battery power presents various environmental, humanitarian, and geopolitical challenges.  \n\n\n\n\n\n\n\n\n\n\nAt LOHUM, we’ve set out to holistically address challenges obstructing the battery energy revolution, paving the way for the widespread adoption of circular-economy LIB technologies. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n01Depletion of critical battery metals\n\n        Battery materials critical to meet rising energy storage needs require\n        labor, energy, and carbon-intensive refining, rendering massive\n        environmental and humanitarian costs. We directly impact the mining\n        needs of the industry by recirculating reclaimed critical metals back\n        into the supply chain via Lithium ion battery recycling.\n      \n\n\n\n02Rising battery waste\n\n        Millions of used lithium-ion batteries enter the waste stream, of which\n        the majority currently end up in landfills or worse, toxifying the\n        surrounding land, water, and potentially air if burnt. We make it much\n        simpler and cost effective to safely recycle discarded lithium ion\n        batteries and scrap, with convenient logistics that span Asia, North\n        America and Europe.\n      \n\n\n\n03Geo-disparity of battery raw materials\n\n        Even as newer economies strive to upscale production and tackle battery\n        waste, the core issue remains the concentration of natural reserves and\n        refining capacities in a few resource-rich nations, lending geo-economic\n        advantage to a select few. We help develop self-reliance in energy\n        storage via Lithium ion battery recycling to prove that domestic battery\n        manufacturing can be fostered via a robust circular-economy of raw\n        materials.\n      \n\n\n\n04Lack of a reverse logistics ecosystem\n\n        At the end of its life, a typical Lithium-ion Battery changes many\n        hands, and jumps through logistics hoops that shouldn’t be there. We are\n        here to change that. Pick-up, processing, and drop-off with full\n        traceability and maximum safety is our promise that starts at your\n        doorstep. We work closely with a reliable network of global logistics\n        partners to support you in transporting your batteries safely to our\n        facilities for Lithium ion battery recycling.\n      \n\n\n\n05Lack of transparency in refining & recycling\n\n        The industry is currently opaque, hiding processes that are anything but\n        environmentally and human friendly. Once a battery goes out of the\n        production line, it is usually unclear what happens to it. It is not\n        just the mining activities which are suspect, but processes used in\n        refining, production, as well as Lithium ion battery recycling, leave\n        much to be desired. We address this by championing an end-to-end\n        traceability system for full visibility on every gram of raw material\n        that we buy from and sell to you.\n      \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOur Commitment \n\n\n\nLOHUM is wholly committed to delivering sustainable one-stop solutions for the global closed-loop battery materials supply chain. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHere’s how we do it: \n\n\n\n\n\n\n\n\nPioneering sustainability in battery materials\n\n\n        Our patented NEETM™ Lithium ion battery recycling process and advanced\n        cell analysis techniques with 95% yield are our most directly\n        sustainable & carbon-reducing contribution to support the future of our\n        planet via LIB recycling and reuse.\n      \nLearn More\n          \n\n\nSetting the highest bar across ESG\n\n\n        LOHUM strives to express our commitment to Environment, Social, and\n        Governance by adhering to and surpassing rigorous global standards and\n        ethics across all levels of our organization.\n      \nLearn More\n          \n\n\nRevitalizing finite battery resources\n\n\n        Critical battery raw materials are finite on Earth, yet are a sizable\n        percentage of e-waste that escapes reuse or recycling. We’re committed\n        to making their recirculation the industry-norm via high-yield Lithium\n        ion battery recycling. We make it easy for customers by providing\n        end-to-end traceability and reverse logistics services.\n      \nLearn More\n          \n\n\nFostering receptivity and approachability\n\n\n        We commit to hearing out and interacting with our people, suppliers,\n        customers and other stakeholders for their invaluable feedback and to\n        understand their Lithium ion battery recycling and reuse needs.\n      \nLearn More\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCareer \n\n\n\n \n\n\n\n\n\n\n\nCareers \n\n\n\nJoin us in the quest to build a climate-conscious world free of battery waste! \n\n\n\nWe’re always on the lookout for people with the passion, drive, and determination to make the world a better place!LOHUM is India’s largest producer of sustainable energy transition materials, and the only integrated battery material recycling, reuse, and low-carbon refining company in the world. We are also a green ecosystem employer that revels in building careers that empower ambition, enrich lives, and excite passion! At LOHUM, we build experiences that help uplift both individuals and communities.Our work environment radiates equity, inclusion, and diversity, and every day offers endless possibilities for growth and learning. \n\n\n\nDoes that sound like what you were looking for? \n\n\n\n\n\n\n\n \nGet in touch\n\n\n\n\n\n\n\n\n\n\n\n \nGet in touch\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNews Room \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNovember 23, 2023Lohum\nLohum Cleantech’s green mission, a force to reckon with.\n\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\tNews\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\tLohum is pursuing a mission to become the world’s largest producer of sustainable battery/energy transition raw materials through recycling, repurposing, and low-carbon\t\t\t\t\t\t\t\t\t\n\nRead More\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\nOctober 26, 2023Lohum\nEnergy Revolution India Needs Second Life Lithium Batteries for Sustainable Power Storage\n\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\tNews\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\tIndia Accelerates Clean Energy Transition with Second-Life LithiIndia is pivoting to sustainable energy, emphasizing second-life lithium battery storage. Reusing batteries aligns with India's 4 GWh target by 2030, conserving\t\t\t\t\t\t\t\t\t\n\nRead More\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\nSeptember 14, 2023Lohum\nNot ESG, but ‘EFG’ needs to be fixed for G20 nations to resolve conflicts By Rajat Verma  The Financial Express\n\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\tNews\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\tThe global shift to clean energy is challenged by costs, employment concerns, and entrenched interests. Developing nations face higher expenses, while stability and fairness are paramount. India's G-20 presidency offers a chance\t\t\t\t\t\t\t\t\t\n\nRead More\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\nSeptember 9, 2023Lohum\nEmobility Empowerment: Celebrating World EV Day 2023\n\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\tNews\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\tWorld EV Day, celebrated on the 9th of September, has indeed become a significant event in the modern world as concerns about the environment and sustainability have\t\t\t\t\t\t\t\t\t\n\nRead More\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\nSeptember 9, 2023Lohum\nWorld EV Day 2023: What Industry Leaders Said\n\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\tNews\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\tIn a world confronting increasingly urgent environmental issues and the imperative to curtail carbon emissions, electric vehicles (EVs) have arisen as a shining emblem of optimism and pioneering\t\t\t\t\t\t\t\t\t\n\nRead More\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\nSeptember 9, 2023Lohum\nElectric Dreams Visionaries Leading the Charge on World EV Day 2023\n\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\tNews\t\t\t\t\t\t\t\t\t\n\n\t\t\t\t\t\t\t\t\t\tDiscover the future of battery recycling, trends, tech, and market insights for a greener, more sustainable world. #RecycleBatteries.\t\t\t\t\t\t\t\t\t\n\nRead More\n\t\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSept 19, 2022\n> Mint \n\n\n\nLOHUM Cleantech to supply 10,000 metric tonne specialty chemicals to Glencore \n\n\n\n \n\n\n\nMint \n\n\n\nThe partnership will allow both companies to deepen their recycling expertise and support the advancement of a circular economy by supplying raw materials back into the battery supply chain. \n\n\n\n\n\n\n\n \nRead more\n\n\n\n\n\n\n\n\n\n\n\nJan 5, 2023\n> Bloomberg \n\n\n\nLOHUM Partners With Mercedes-Benz Energy For Second-Use Li-Ion Battery Module Supply \n\n\n\n \n\n\n\nBloomberg \n\n\n\nMercedes-Benz Energy and LOHUM are pleased to announce a strategic partnership through a multi-year supply contract agreement for second-life batteries.  \n\n\n\n\n\n\n\n \nRead more\n\n\n\n\n\n\n\n\n\n\n\nDec, 13, 2022\n> PTI \n\n\n\nThe Confederation of Indian Industry (CII) conferred the ‘The Most Innovative Company of the Year 2022’ award to LOHUM  \n\n\n\n \n\n\n\nPTI \n\n\n\nRecognised for making India a viable alternative to International players in the battery raw materials space and helping India potentially capture at least 10% share of the global battery raw materials market \n\n\n\n\n\n\n\n \nRead more\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nExplore All\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHave Lithium ion battery recycling,  reuse, or EPR requirements? \n\n\n\n\n\n\n\nReceive a rapid response \n\n\n\nPlease enable JavaScript in your browser to complete this form.Name *FirstLastCountry*Company name*Phone *Email *How would you like to be contacted ?PhoneEmailChoose CategoryChoose categoryEPR and logistics partnershipLi-ion battery recyclingSecond life solutions for Li-ion batteriesRecycled battery raw materialsOther (please share below)MessageSubmit Request  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nThe world’s largest producer of sustainable battery raw materials through recycling, repurposing, and low-carbon refining. \n\n\n\n \n\n\n\n \n\n\n\nLinkedin\n \n\n\n\n\n\n\n© 2023 Created by Yali Art Lab in association with Social Angadi \n\n\n\nCopyright © 2022 LOHUM.. All Rights Reserved \n\n\n\n\n\n\n\nCompany \n\n\n\n \n\n\nAbout Us\n\n\n\n\nCareer\n\n\n\n\nContact\n\n\n\n\n\n\n\n\n\n\n\nServices \n\n\n\n\n\n\nRecycle with us\n\n\n\n\nBattery Residual Value\n\n\n\n\nEPR Partnership\n\n\n\n\nLi-Ion Batteries\n\n\n\n\nBattery Metal Salts\n\n\n\n\nESG\n\n\n\n\n\n\n\n\n\n\n\nMedia \n\n\n\n\n\n\nNews\n\n\n\n\nPress\n\n\n\n\nBlog\n\n\n\n\n\n\n\n\n\n\n\n1800 572 8822 \n\n\n\nEmail : enquiry@lohum.com \n\n\n\nIndia Headquarters \n\n\n\nG98, Site, 5, Kasna, Block A, Surajpur Site V, Greater Noida, Uttar Pradesh 201306 \n\n\n\nLOHUM 'Reclaim' Recycling Facility \n\n\n\nLOHUM Cleantech Private Limited, Plot No. D-7 & 8, Site 5th, Kasna Industrial Area, Greater Noida, Gautam Budh Nagar, Uttar Pradesh – 201308 \n\n\n\nLOHUM Dismantling Facility \n\n\n\nLOHUM Cleantech Private Limited, Plot No. O-17, Site 5th, Kasna Industrial Area, Greater Noida, Gautam Budh Nagar, Uttar Pradesh – 201308 \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2022 Lohum.. All Rights Reserved \n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://lohum.com/battery-raw-material/": "\n\n\n\n\n\nHigh Purity Range of Lithium Ion Battery Raw Material | LOHUM\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tSkip to content\n\n\n\n\n \n\n\nProducts\n\nBattery Materials\nLi-ion Batteries\n\n\nOur Solutions\n\nRecycle with Lohum\nBattery Residual Value\nEPR Partnerships\n\n\nAbout Us\n\nCompany Overview\nContact Us\nESG\n\n\nCareers\nMedia\n\nBlog\nNews\nPress\n\n\nEPR Portal\nEnquire Now\n \n\n\n\n\n\n\n\n\n\n\n\nMenu\n\n\n\n\n\n\n\n\n\n×\n\n\n\nProducts\n\nBattery Materials\nLi-ion Batteries\n\n\nOur Solutions\n\nRecycle with Lohum\nBattery Residual Value\nEPR Partnerships\n\n\nAbout Us\n\nCompany Overview\nContact Us\nESG\n\n\nCareers\nMedia\n\nBlog\nNews\nPress\n\n\nEPR Portal\nEnquire Now\n \n\n\nEnquire Now\n\n\n\n\nTwitter\n\n\n\n\n\n\n\nLinkedin\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSustainable Lithium Ion Battery Raw Materials at LOHUM \n\n\n\n\n\n\n\n\n\n\n\n Maximizing sustainability of Li-ion batteries via recycled battery-ready raw materials. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLithium Ion Battery Raw Materials: Our Zero Waste Approach \n\n\n\nAt LOHUM, we recycle Lithium-ion batteries of all cell chemistries and form factors via our hydrometallurgical NEETM™ technology. We safely recover black mass and process it to extract and isolate high-purity metal sulfates and carbonates ready for use in cathode and precursor production. LOHUM creates a circular economy in the Li-ion battery ecosystem by recirculating raw materials back into the supply chain, significantly improving both the environmental and economic sustainability of batteries. NEETM™ enables us to recover 95% of all Li-ion metal salts at 50% lower CO2e than mining. \n\n\n\n\n\n\n\n\n\n\n\n \nEnquire Now\n\n\n\n\n\n\n\n\n\n\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEnergy Transition raw materials produced at THE LOHUM 'RECLAIM' FACILITY \n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nBattery Metals & Salt \n\n\n\n\n\n\n\n \n\n\n\nPrecusor\nMaterials \n\n\n\n\n\n\n\n \n\n\n\nCathode \nActive Material \n\n\n\n\n\n\n\n \n\n\n\nHigher \nValue Alloys \n\n\n\n\n\n\n\n\n\n\n\nLOHUM’s Range Of High-Quality Battery Raw Materials \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRaw materials recycled from end-of-life Li-ion batteries, ready for sustainably manufacturing new Li-ion cells. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nCobalt\nBlack Mass \n\n\n\nContains between 17% to 21% Cobalt. \n\n\n\n\n\n\n\n \n\n\n\nNMC \nBlack Mass \n\n\n\nContains between 16% to 20% Nickel and 3% to 5% Cobalt. \n\n\n\n\n\n\n\n \n\n\n\nLithium \nCarbonate \n\n\n\n99.5% purity Li2CO3, impurities limited to 500 PPM. \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nCobalt Carbonate \n\n\n\n99.5% purity CoCO3, impurities limited to 500 PPM \n\n\n\n\n\n\n\n \n\n\n\nNickel \nCarbonate \n\n\n\n99.5% purity NiCO3, impurities limited to 500 PPM \n\n\n\n\n\n\n\n \n\n\n\nLithium \nPhosphate \n\n\n\n99.5% purity Li3PO4, impurities limited to 500 PPM. \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nCobalt \nMetal Flakes \n\n\n\nContains more than 99.5% Cobalt Metal. \n\n\n\n\n\n\n\n \n\n\n\nCobalt \nSulfate \n\n\n\n99.5% purity CoSO4, impurities limited to 500 PPM. \n\n\n\n\n\n\n\n \n\n\n\nNickel \nSulfate \n\n\n\n99.5% purity NiSO4, impurities limited to 500 PPM. \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nCobalt-Manganese-Nickel Mixed Carbonate \n\n\n\nCo-Mn-Ni Carbonate with impurities limited to 500 PPM.  \n\n\n\n\n\n\n\n \n\n\n\nManganese \ndioxide \n\n\n\n99.5% purity MnO2, impurities limited to 500 PPM. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\nOur Products  \n\n\n\nRaw materials recycled from end-of-life Li-ion batteries, ready for sustainably manufacturing new Li-ion cells. \n\n\n\nWith quality on par with virgin mined metals, batteries made with our range of lithium ion battery raw materials perform equal to batteries with newly mined raw materials in every aspect. Once our safe and scientific battery reverse logistics deliver the feed-stock to us, our proprietary testing and dismantling technologies separate reusable cells to build 2nd life applications, and cells with no Remaining Useful Life (RUL) enter the recycling process at our ‘Reclaim’ facility.  \n\n\n\n\n\n\n\n\n\n\n\n \nEnquire Now\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhat differentiates our Lithium ion battery raw materials: \n\n\n\n\n\n\n\n\n\n\n\nRaw materials recycled from end-of-life Li-ion batteries, ready for sustainably manufacturing new Li-ion cells. \n\n\n\n\n\n\n\n\n\n\n\n\nPioneering sustainability in battery materials\n\n\n        Our patented NEETM™ Lithium ion battery recycling process and advanced\n        cell analysis techniques with 95% yield are our most directly\n        sustainable & carbon-reducing contribution to support the future of our\n        planet via LIB recycling and reuse.\n      \nLearn More\n          \n\n\nSetting the highest bar across ESG\n\n\n        LOHUM strives to express our commitment to Environment, Social, and\n        Governance by adhering to and surpassing rigorous global standards and\n        ethics across all levels of our organization.\n      \nLearn More\n          \n\n\nRevitalizing finite battery resources\n\n\n        Critical battery raw materials are finite on Earth, yet are a sizable\n        percentage of e-waste that escapes reuse or recycling. We’re committed\n        to making their recirculation the industry-norm via high-yield Lithium\n        ion battery recycling. We make it easy for customers by providing\n        end-to-end traceability and reverse logistics services.\n      \nLearn More\n          \n\n\nFostering receptivity and approachability\n\n\n        We commit to hearing out and interacting with our people, suppliers,\n        customers and other stakeholders for their invaluable feedback and to\n        understand their Lithium ion battery recycling and reuse needs.\n      \nLearn More\n          \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nZero waste, low CO2eNothing that goes through us ever reaches a landfill or incineration. We are also highly energy efficient and in the process of transitioning to renewables to power our facilities. LOHUM’s R&D has managed to not only reach high-yield, but achieve it with 50% of CO2e savings via battery recycling and 90% CO2e savings via battery repurposing per ton.\n \n\n\n\n\n\n\n\nHigh yieldVia mechanical, hydro-metallurgical, and electrochemical processes, we recycle all kinds of LIBs, irrespective of their cell chemistry and form. We report full cathode and anode recovery with 95% yield, and significantly lower CapEx & OpEx than our western competitors. Today, LOHUM can recover Cathode Active Materials (CAM), Platinum Metal Group (PMG), Rare Earth Elements (REE) and a wide variety of battery-grade raw materials with maximum purity.\n \n\n\n\n\n\n\n\nFull chemical separationRecycling output is in separated metals, oxides, sulfates, and carbonates. We do produce intermediary products, known as Black Mass (BM) and then convert that into final chemical products. LOHUM has evolved different CAM (NMC & LFP) chemistries of LIBs from recycled battery grade materials. Our process for CAM production unlocks maximum specific capacity and cycling performance as a result.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDirect Recycling & LFPWe are the only company currently to set up a direct recycling line for Lithium Ferro-Phosphate, where we recover the LFP molecules. We plan to develop sustainable low-carbon extraction technologies in the areas of Platinum, Palladium, Rhodium, Neodymium, and other precious rare earth & critical metals \n\n\n\n\n\n\n\nIn-house developmentOur entire equipment, design, and all process flows have all been developed in-house. We do full lithium ion battery raw materials recovery of sulfates, carbonates & metals directly. LOHUM has also developed a proprietary disassembly methodology and Physico-Chemical analysis techniques for LIBs cells of different form factors - Cylindrical, Pouch, Prismatic. This has enabled all our processes to become agnostic of Lithium ion cell chemistry and form factors.\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe have a 20-year timeframe before we run out of natural reserves of lithium ion battery raw materials while incurring significant environmental costs if conventional mining continues at a large scale.  \n\n\n\n\n\n\n\n\n\n\n\n– Rajat Verma, Founder & CEO of LOHUM \n\n\n\n\n\n\n\n\n\n\n\nWhat differentiates our Lithium ion battery raw materials: \n\n\n\nWe receive our feedstock to sustainably produce these minerals from the OEMs, producers, and underwriters of various batteries from the consumer electronics segment as well as electric vehicle batteries. LOHUM recommends the repurposing or reuse of  batteries in second life applications to our partners, before finally recycling them via our NEETM™ technology, slowing down the demand for hazardous conventional mining as well as reducing our energy dependence on imports via a parallel supply chain and saving millions of tons of CO2e as well as water. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\nSwitching to sustainable raw materials for your Lithium-ion batteries? \n\n\n\nLOHUM produces energy transition and lithium ion battery raw materials via battery recycling, repurposing, and battery raw material refining, and is the only integrated battery recycling & reuse company with solutions across the value chain under one roof.Send us your lithium ion battery raw material requirements via the form and we’ll reach out to you at the earliest. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAccurate & Future-Proof Lithium Ion Battery Raw Materials Prices \n\n\n\nTo enable accurate projections for the energy ecosystem, LOHUM has built DETX™, or the ‘Delhi Energy Transition Exchange’™ to provide an unparalleled level of transparency by tracking current and historic prices of critical metals used in Li-ion battery manufacturing, as well as cell prices of various chemistries.DETX™ enables market benchmarking and comparisons of reuse and recycle prices against those available on other exchanges, empowers stakeholders to navigate the disruptive battery mineral supply and asset trading landscape with confidence and clarity. \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nVisit Recycling At LOHUM\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDiscover Battery Residual Value\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExtended Producer Responsibility\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\"Did you know that traditional mining processes can result in significant material loss? Approximately 10-15% of lithium ion battery raw materials are wasted during extraction and refining, and by the time they enter a battery, close to 40% has already been lost due to impurities and inefficiencies, that's not sustainable! \n\n\n\nIn contrast, recycling batteries via NEETM™ minimizes this loss to just 5%, facilitating a significant reduction in our need to dig up the Earth.” \n\n\n\n\n\n\n\n\n\n\n\n– Gazanfar Safvi, Head – Recycling & Chemicals, LOHUM \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSwitching to sustainable raw materials for your Lithium-ion batteries? \n\n\n\n\n\n\n\nSend us your requirements and receive a rapid response \n\n\n\nPlease enable JavaScript in your browser to complete this form.Name *FirstLastCountry*Company name*Phone *Email *How would you like to be contacted ?PhoneEmailChoose CategoryChoose categoryEPR and logistics partnershipLi-ion battery recyclingSecond life solutions for Li-ion batteriesRecycled battery raw materialsOther (please share below)MessageSubmit Request  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nThe world’s largest producer of sustainable battery raw materials through recycling, repurposing, and low-carbon refining. \n\n\n\n \n\n\n\n \n\n\n\nLinkedin\n \n\n\n\n\n\n\n© 2023 Created by Yali Art Lab in association with Social Angadi \n\n\n\nCopyright © 2022 LOHUM.. All Rights Reserved \n\n\n\n\n\n\n\nCompany \n\n\n\n \n\n\nAbout Us\n\n\n\n\nCareer\n\n\n\n\nContact\n\n\n\n\n\n\n\n\n\n\n\nServices \n\n\n\n\n\n\nRecycle with us\n\n\n\n\nBattery Residual Value\n\n\n\n\nEPR Partnership\n\n\n\n\nLi-Ion Batteries\n\n\n\n\nBattery Metal Salts\n\n\n\n\nESG\n\n\n\n\n\n\n\n\n\n\n\nMedia \n\n\n\n\n\n\nNews\n\n\n\n\nPress\n\n\n\n\nBlog\n\n\n\n\n\n\n\n\n\n\n\n1800 572 8822 \n\n\n\nEmail : enquiry@lohum.com \n\n\n\nIndia Headquarters \n\n\n\nG98, Site, 5, Kasna, Block A, Surajpur Site V, Greater Noida, Uttar Pradesh 201306 \n\n\n\nLOHUM 'Reclaim' Recycling Facility \n\n\n\nLOHUM Cleantech Private Limited, Plot No. D-7 & 8, Site 5th, Kasna Industrial Area, Greater Noida, Gautam Budh Nagar, Uttar Pradesh – 201308 \n\n\n\nLOHUM Dismantling Facility \n\n\n\nLOHUM Cleantech Private Limited, Plot No. O-17, Site 5th, Kasna Industrial Area, Greater Noida, Gautam Budh Nagar, Uttar Pradesh – 201308 \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2022 Lohum.. All Rights Reserved \n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nReceive a rapid response \n\n\n\nPlease enable JavaScript in your browser to complete this form.Name *FirstLastCountry*Company name*Phone *Email *How would you like to be contacted ?PhoneEmailChoose CategoryChoose categoryEPR and logistics partnershipLi-ion battery recyclingSecond life solutions for Li-ion batteriesRecycled battery raw materialsOther (please share below)MessageSubmit Request  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://lohum.com/lithium-ion-battery/": "\n\n\n\n\n\nTop Lithium Ion Battery Manufacturers in India\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tSkip to content\n\n\n\n\n \n\n\nProducts\n\nBattery Materials\nLi-ion Batteries\n\n\nOur Solutions\n\nRecycle with Lohum\nBattery Residual Value\nEPR Partnerships\n\n\nAbout Us\n\nCompany Overview\nContact Us\nESG\n\n\nCareers\nMedia\n\nBlog\nNews\nPress\n\n\nEPR Portal\nEnquire Now\n \n\n\n\n\n\n\n\n\n\n\n\nMenu\n\n\n\n\n\n\n\n\n\n×\n\n\n\nProducts\n\nBattery Materials\nLi-ion Batteries\n\n\nOur Solutions\n\nRecycle with Lohum\nBattery Residual Value\nEPR Partnerships\n\n\nAbout Us\n\nCompany Overview\nContact Us\nESG\n\n\nCareers\nMedia\n\nBlog\nNews\nPress\n\n\nEPR Portal\nEnquire Now\n \n\n\nEnquire Now\n\n\n\n\nTwitter\n\n\n\n\n\n\n\nLinkedin\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLithium ion Battery Solutions\n For EV, ESS, Solar, And More. \n\n\n\n\n\n\n\n\n\n\n\n High-performance Lithium ion batteries powering e-mobility and stationary energy storage \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  \n\n\n\nEV Batteries \n\n\n\n\n\n\n\n \nLern More\n\n\n\n\n\n\n\n\n\n\n\n \nLearn More\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nEnergy Storage Solutions \n\n\n\n\n\n\n\n \nLearn More\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLithium Ion Battery Solutions At LOHUM \n\n\n\nAffordable smart batteries for low-power e-mobility in tough environments. \n\n\n\nDesigned for high-temperature and high-vibration operating environments, LOHUM’s Lithium ion battery solutions deliver exceptional longevity, consistently stable performance, and optimal power after every recharge.Key features of our E-mobility batteries: \n\n\n\n \n\n\n \n &nbspMade in India proprietary design & fabrication.\n\n\n\n \n &nbspAIS-156 compliant as per Ministry of Road Transport and Highways.\n\n\n\n \n  Specialized software protocols and chemicals for battery safety and guaranteed thermal runway-proofing.\n\n\n\n \n  BMS designed and manufactured for automotive applications with AEC qualified components.\n\n\n\n \n &nbspVariety of Lithium Ion Battery cell chemistries & form factors.\n\n\n\n \n &nbspICAT, ISO 14001, and ISO 18001 certified.\n\n\n\n\n\n\n\n\n\n\n \nEnquire Now\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLithium Ion Battery Design & Technology \n\n\n\nCharging up a long and sustainable future \n\n\n\nLOHUM’s scalable platform design gives you the freedom to avail custom Lithium ion battery solutions for your specific requirements and stay future-proof.Key battery technology features: \n\n\n\n\n\n\n \n&nbspBattery status SOC & SOH estimation with state-of-the-art Kalman Filter algorithm prepared by HPPC test of cells.\n\n\n\n \nScalable Lithium ion battery modules for a flexible approach to fully custom battery designs with in-house BMS and IP68 waterproofing. \n\n\n\n \nPassive cell balancing and safety controls to detect and intuitively purge over or under voltage, overcharge and short circuit.\n\n\n\n \nThermal management diagnostics to control heat transfer and keep the pack at optimum temperatures.\n\n\n\n \nLive and remote tracking, with 4G IOT data monitoring (optional add-on).\n\n\n\n \nAudio-visual alarm system for any inappropriate temperature rise inside the battery pack.\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOur Range of Electric Vehicle Battery Solutions \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nFor 2-Wheelers \n\n\n\n\n\n\n \nIdeal swappable or portable electric vehicle battery choices for e-bike and e-scooter manufacturers.\n\n\n\n \nCustomized power output between 1 KWh to 3 KWh.\n\n\n\n \n2.2 Kwh swappable battery option with Industry standard dimensional requirement of 2 wheeler industry.\n\n\n\n \nHighly robust electric vehicle battery for Indian roads, high speed or low speed.\n\n\n\n\n\n\n\n\n\n\n \nEnquire now\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nFor 3-Wheelers and L5 \n\n\n\n\n\n\n \nHigh-performing lightweight batteries for cargo and passenger EVs made of automotive-grade cells.\n\n\n\n \nCustomized power output between 2.5 KWh to 10 KWh.\n\n\n\n \nElectric vehicle battery for maximum reliability for Indian roads, with smallest form factor in industry.\n\n\n\n \n51V, 116Ah battery option - “The lightest battery on the market”\n\n\n\n\n\n\n\n\n\n\n \nEnquire now\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLithium Ion Battery Energy Storage Systems at LOHUM \n\n\n\nWe offer a range of customized Lithium Ion Battery Energy Storage Systems products that synergize with renewables, microgrids and behind-the-meter applications.  \n\n\n\nOur Lithium Ion Battery Energy Storage Systems (BESS) enable you to shift off-grid and utilize stored electricity at critical times, unlocking superior flexibility and control over energy usage. \n\n\n\n\n\n\n\nESS Highlights \n\n\n\n\n\n\n \nCustom-built and fully modular ESS applications.\n\n\n\n \nFully customized power capacity for a wide range of requirements.\n\n\n\n \nLink to solar power or other renewables and go 100% off-grid.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGiving Every Electric Vehicle Lithium Ion Battery A 2nd Life For BESS, Grid, Renewables. \n\n\n\nLOHUM is championing second-life solutions and prolonging EV battery life, where end-of-life lithium ion battery cells are reused in stationary energy storage after they cannot be used for their original utility.LOHUM’s energy storage solutions powered by repurposed 2nd-life Lithium ion batteries maximize environmental sustainability. Leverage our turnkey solutions with seamlessly integrated power control, power conversion, and energy management capabilities.We are currently scaling up various second-life solutions for used batteries, the most popular of which are listed below. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUse-Case Scenarios \n\n\n\n\n\n\n\n\n\nESS for Homes\n\nLithium ion battery to power residential homes with 3 hour back-up\nSuitable for rural or remote areas where grid reliability is an issue\nCustom built ESS that can be taken 100% off-grid\n\n Enquire Now \n\n\n\nESS for the grid\n\nIdeal Lithium ion battery for power grid stabilization with Solar and Wind farms       \nFully customizable with variety of charge/discharge rates and voltages       \nHelps reduce carbon footprint and reduces loss of energy       \n\nEnquire Now \n\n\n\nESS for businesses\n\nThe ideal Lithium ion battery for commercial-grade power backup\nCan be 100% off-grid with solar power       \nFully customizable depending on load\n\nEnquire Now \n\n\n\nEV charging stations\n\nCharge all EVs: 2-wheelers, 3-wheelers, and cars, and charge multiple vehicles at once       \nCapable of both fast and slow charging       \nGo 100% off-grid with Solar Panels: best power solution for rural areas\n\nEnquire Now \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWhy LOHUM For Your Lithium Ion Battery Needs? \n\n\n\n\n\n\n\nCommitment to Quality \n\n\n\n \n\n\n\nWe employ an exhaustive Lithium ion battery testing and QA process to create the highest performing batteries. \n\n\n\n\n\n\n\nCustomized\nDesigns \n\n\n\n \n\n\n\nOur technology & integrated processes deliver customized Lithium ion battery packs tailored to specific requirements. \n\n\n\n\n\n\n\n\n\n\n\nService\nNetwork \n\n\n\n \n\n\n\nPresence of over 50+ service centers providing 24/7 support with trained Lithium ion battery service engineers. \n\n\n\n\n\n\n\nBattery\nBuy Back \n\n\n\n \n\n\n\nOur battery buy-back reduces overall battery cost & ensures EPR regulatory compliance. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLooking for sustainable Lithium-ion battery solutions? \n\n\n\n\n\n\n\nSend us your requirements and receive a rapid response.\n \n\n\n\nPlease enable JavaScript in your browser to complete this form.Name *FirstLastCountry*Company name*Phone *Email *Choose CategoryChoose category2 Wheeler3 WheelerEnergy Storage SolutionsMessageSubmit Request  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nThe world’s largest producer of sustainable battery raw materials through recycling, repurposing, and low-carbon refining. \n\n\n\n \n\n\n\n \n\n\n\nLinkedin\n \n\n\n\n\n\n\n© 2023 Created by Yali Art Lab in association with Social Angadi \n\n\n\nCopyright © 2022 LOHUM.. All Rights Reserved \n\n\n\n\n\n\n\nCompany \n\n\n\n\n\n\nAbout Us\n\n\n\n\nCareer\n\n\n\n\nContact\n\n\n\n\n\n\n\n\n\n\n\nServices \n\n\n\n\n\n\nRecycle with us\n\n\n\n\nBattery Residual Value\n\n\n\n\nEPR Partnership\n\n\n\n\nLi-Ion Batteries\n\n\n\n\nBattery Metal Salts\n\n\n\n\nESG\n\n\n\n\n\n\n\n\n\n\n\nMedia \n\n\n\n\n\n\nNews\n\n\n\n\nPress\n\n\n\n\nBlog\n\n\n\n\n\n\n\n\n\n\n\n1800 572 8822 \n\n\n\nEmail : enquiry@lohum.com \n\n\n\nIndia Headquarters \n\n\n\nG98, Site, 5, Kasna, Block A, Surajpur Site V, Greater Noida, Uttar Pradesh 201306 \n\n\n\nLOHUM 'Reclaim' Recycling Facility \n\n\n\nLOHUM Cleantech Private Limited, Plot No. D-7 & 8, Site 5th, Kasna Industrial Area, Greater Noida, Gautam Budh Nagar, Uttar Pradesh – 201308 \n\n\n\nLOHUM Dismantling Facility \n\n\n\nLOHUM Cleantech Private Limited, Plot No. O-17, Site 5th, Kasna Industrial Area, Greater Noida, Gautam Budh Nagar, Uttar Pradesh – 201308 \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2022 Lohum.. All Rights Reserved \n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nReceive a rapid response \n\n\n\nPlease enable JavaScript in your browser to complete this form.Name *FirstLastCountry*Company name*Phone *Email *How would you like to be contacted ?PhoneEmailChoose CategoryChoose categoryEPR and logistics partnershipLi-ion battery recyclingSecond life solutions for Li-ion batteriesRecycled battery raw materialsOther (please share below)MessageSubmit Request  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://lohum.com/battery-recycling/": "\n\n\n\n\n\nLithium Battery Recycling At LOHUM | Go Closed Loop!\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tSkip to content\n\n\n\n\n \n\n\nProducts\n\nBattery Materials\nLi-ion Batteries\n\n\nOur Solutions\n\nRecycle with Lohum\nBattery Residual Value\nEPR Partnerships\n\n\nAbout Us\n\nCompany Overview\nContact Us\nESG\n\n\nCareers\nMedia\n\nBlog\nNews\nPress\n\n\nEPR Portal\nEnquire Now\n \n\n\n\n\n\n\n\n\n\n\n\nMenu\n\n\n\n\n\n\n\n\n\n×\n\n\n\nProducts\n\nBattery Materials\nLi-ion Batteries\n\n\nOur Solutions\n\nRecycle with Lohum\nBattery Residual Value\nEPR Partnerships\n\n\nAbout Us\n\nCompany Overview\nContact Us\nESG\n\n\nCareers\nMedia\n\nBlog\nNews\nPress\n\n\nEPR Portal\nEnquire Now\n \n\n\nEnquire Now\n\n\n\n\nTwitter\n\n\n\n\n\n\n\nLinkedin\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLithium Ion Battery Recycling with LOHUM \n\n\n\n\n\n\n\n\n\n\n\n Leverage technology that yields more, and makes battery materials 100% sustainable. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEnd-to-end Battery Waste Management Solutions \n\n\n\nWe recover critical Li-ion raw materials via our pioneering Metelec™ recycling technology to recirculate them into the battery ecosystem.Our low-CO2e battery recycling and repurposing process ensures high-yield recycling of Li-ion batteries, and builds an environmentally sustainable supply of raw materials. We believe that wherever possible, 2nd life combined with recycling offers the best solution for sustainability and value creation over the long term. \n\n\n\n\n\n\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nEnd-to-end Battery Recycling Solutions \n\n\n\nWe recover critical Li-ion raw materials via our pioneering NEETM™ recycling technology to recirculate them into the battery ecosystem.Our low-CO2e battery recycling and repurposing process ensures high-yield recycling of Li-ion batteries, and builds an environmentally sustainable supply of raw materials. We believe that wherever possible, 2nd life combined with recycling offers the best solution for sustainability and value creation over the long term. \n\n\n\n\n\n\n\n \nEnquire Now\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIntegrated Lithium Ion Battery Recycling & Repurposing \n\n\n\n\n\n\n\nReverse Logistics For Battery Recycling \n\n\n\nOur reverse logistics network spans all of India and beyond, and our responsibility starts at your doorstep. Via proprietary transport technologies we ensure quick & safe transit of your batteries to us. All batteries are bar coded and made traceable throughout the battery recycling & reuse process.Wherever you may be situated in India, we’ll pick up your batteries within: \n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n24 Hrs\nFor Tier 1 Cities\n\n                    \n     \n48 Hrs\nFor Tier 2 Cities\n\n \n\n\n\n \n\n\n\n\n\n\n\nDistance is no bar as we work closely with a reliable network of global logistics partners to support you in transporting your batteries safely to our facilities. \n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTurn Your Batteries Closed-loop,  Enter Recycling Ecosystem \n\n\n\n\n\n\nEnquire Now\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAccurate Battery Recycling & Reuse Salvage Value \n\n\n\nThrough our DETX™ battery price index, we give you ‘future’ purchase prices to help you get into buyback agreements with your customers. The index reflects the live movement of material prices based on global demand and supply, and insulates energy transition ecosystem stakeholders against price fluctuation. As the only company to house such an extensive battery price index driven by data from battery recycling and reuse, we unlock numerous advantages for you: \n\n\n\n \n\n\n \nPrice data available for both NMC & LFP\n\n\n\n \nPricing available for both Battery Recycling and Reuse\n\n\n\n \nCan price over 3 years forward based on demand and supply\n\n\n\n \nRigorous data modeling via econometrics\n\n\n\n \nIn-house software augmented by time series analyses\n\n\n\n \nPrices linked to correlated international indices\n\n\n\n \nError margins between predicted and live prices accounted for\n\n\n\n\n\n\n\n\n\n\n \nEnquire Now\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nExtended Producer Responsibility Via Battery Recycling \n\n\n\nThrough our end-to-end EPR and traceability portal, we enable full visibility on the status of your batteries and help you meet all your battery recycling compliance requirements transparently.Our software gives you real-time access to: \n\n\n\n\n\n\n \nImage archiving for all batteries\n\n\n\n \nDocumented chain of custody\n\n\n\n \nDetailed testing, reuse, and battery recycling reports\n\n\n\n \nCarbon savings statistics\n\n\n\n \nCommunication of material recovery and final destination post-sale\n\n\n\n \nEPR certificates for statutory BWMR compliance\n\n\n\n \nData archives for retrospective access\n\n\n\n\n\n\n\n\n\n\n \nLearn more\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInnovative Technology for Environmentally Responsible Battery Recycling \n\n\n\n\n\n\n\n\n\n\n\nAll the materials present in a battery at the beginning of its life are also present at the end of it.   \n\n\n\nWe rapidly determine if your battery cells can be reused or need to be recycled via state of health testing and remaining useful life analysis. We recycle all kinds of Li-ion batteries, irrespective of their cell chemistry and form. \n\n\n\nFully Integrated Battery Recycling & Repurposing \n\n\n\nHere’s how we close the loop and make Li-ion raw materials last forever. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\nTechnology that creates battery sustainability \n\n\n\nDive deep into recycling and repurposing technology at LOHUM \n\n\n\n\n\n\n\n\n\n\n\nBattery Recycling via NEETM™ technology \n\n\n\nThere are various companies engaged in Lithium ion battery recycling and carrying out material extraction via different technologies. However, our patented NEETM™ Lithium ion battery recycling and extraction technology has been perfected to yield top quality materials, produce zero waste and be highly scalable. All while simultaneously incurring significantly lower financial and environmental expenses.  \n\n\n\n\n\n\n\nUnderstand the pillars of our technology that make Lohum unique & efficient: \n\n\n\n\n\n\n\n\n01. Our Cobalt & Nickel extraction process is agnostic to the percentage of contained cobalt & contained nickel.\n\n\n\n02. We host direct recycling of LFP at industrial scale via a proprietary cathode & anode separation process.\n\n\n\n\n03. Extraction of Lithium Carbonate via proprietary membrane separation technology. \n\n\n\n04. Complete electrolyte recovery via proprietary absorption & release techniques. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nRepurposing Technology \n\n\n\nWe also specialize in reviving end-of-life EV batteries and maximizing their potential before battery recycling, through integrated cell reuse capabilities. Through repurposing we maximize value from cells with remaining useful life. \n\n\n\nRUL Prediction \n\n\n\nMost research on Remaining Useful Life (RUL) prediction is theoretical and limited to specific kinds of batteries, usually the OEM’s own batteries, or batteries in controlled operating conditions (laboratory). \n\n\n\n\n\n\n\nLOHUM differentiates itself by surpassing this problem in a holistic way: \n\n\n\n\n\n\n\n\n01. All our processes are agnostic to battery form factor, chemistry, and cell architecture.\n\n\n\n 02. We provide accurate estimates in both data-constrained and data-rich scenarios.\n\n\n\n\n03. Fast and real-time computational models for easier decision making. \n\n\n\n04. Comprehensive electrical, mechanical, electrochemical evaluation of used batteries through a proprietary testing protocol. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“Battery materials can be recycled endlessly. What is currently treated as waste can be reclaimed with our proprietary NEETM™ process and given multiple lives.” \n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe Save \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n  vs mining via recycling. \n\n\n\n\n\n\n\n \n\n\n\n  vs mining via repurposing. \n\n\n\n\n\n\n\n \n\n\n\n vs mining per ton. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHave Lithium-ion battery recycling, reuse, or EPR requirements? \n\n\n\n\n\n\n\nReceive a rapid response \n\n\n\nPlease enable JavaScript in your browser to complete this form.Name *FirstLastCountry*Company name*Phone *Email *How would you like to be contacted ?PhoneEmailChoose CategoryChoose categoryEPR and logistics partnershipLi-ion battery recyclingSecond life solutions for Li-ion batteriesRecycled battery raw materialsOther (please share below)MessageSubmit Request  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nThe world’s largest producer of sustainable battery raw materials through recycling, repurposing, and low-carbon refining. \n\n\n\n \n\n\n\n \n\n\n\nLinkedin\n \n\n\n\n\n\n\n© 2023 Created by Yali Art Lab in association with Social Angadi \n\n\n\nCopyright © 2022 LOHUM.. All Rights Reserved \n\n\n\n\n\n\n\nCompany \n\n\n\n\n\n\nAbout Us\n\n\n\n\nCareer\n\n\n\n\nContact\n\n\n\n\n\n\n\n\n\n\n\nServices \n\n\n\n\n\n\nRecycle with us\n\n\n\n\nBattery Residual Value\n\n\n\n\nEPR Partnership\n\n\n\n\nLi-Ion Batteries\n\n\n\n\nBattery Metal Salts\n\n\n\n\nESG\n\n\n\n\n\n\n\n\n\n\n\nMedia \n\n\n\n\n\n\nNews\n\n\n\n\nPress\n\n\n\n\nBlog\n\n\n\n\n\n\n\n\n\n\n\n1800 572 8822 \n\n\n\nEmail : enquiry@lohum.com \n\n\n\nIndia Headquarters \n\n\n\nG98, Site, 5, Kasna, Block A, Surajpur Site V, Greater Noida, Uttar Pradesh 201306 \n\n\n\nLOHUM 'Reclaim' Recycling Facility \n\n\n\nLOHUM Cleantech Private Limited, Plot No. D-7 & 8, Site 5th, Kasna Industrial Area, Greater Noida, Gautam Budh Nagar, Uttar Pradesh – 201308 \n\n\n\nLOHUM Dismantling Facility \n\n\n\nLOHUM Cleantech Private Limited, Plot No. O-17, Site 5th, Kasna Industrial Area, Greater Noida, Gautam Budh Nagar, Uttar Pradesh – 201308 \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2022 Lohum.. All Rights Reserved \n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nReceive a rapid response \n\n\n\nPlease enable JavaScript in your browser to complete this form.Name *FirstLastCountry*Company name*Phone *Email *How would you like to be contacted ?PhoneEmailChoose CategoryChoose categoryEPR and logistics partnershipLi-ion battery recyclingSecond life solutions for Li-ion batteriesRecycled battery raw materialsOther (please share below)MessageSubmit Request  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://lohum.com/scrap-battery-price-calculator/": "\n\n\n\n\n\nRefurbished Battery | Scrap Battery Price Calculator | LOHUM\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\tSkip to content\n\n\n\n\n \n\n\nProducts\n\nBattery Materials\nLi-ion Batteries\n\n\nOur Solutions\n\nRecycle with Lohum\nBattery Residual Value\nEPR Partnerships\n\n\nAbout Us\n\nCompany Overview\nContact Us\nESG\n\n\nCareers\nMedia\n\nBlog\nNews\nPress\n\n\nEPR Portal\nEnquire Now\n \n\n\n\n\n\n\n\n\n\n\n\nMenu\n\n\n\n\n\n\n\n\n\n×\n\n\n\nProducts\n\nBattery Materials\nLi-ion Batteries\n\n\nOur Solutions\n\nRecycle with Lohum\nBattery Residual Value\nEPR Partnerships\n\n\nAbout Us\n\nCompany Overview\nContact Us\nESG\n\n\nCareers\nMedia\n\nBlog\nNews\nPress\n\n\nEPR Portal\nEnquire Now\n \n\n\nEnquire Now\n\n\n\n\nTwitter\n\n\n\n\n\n\n\nLinkedin\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMaximizing Scrap Battery Price \n\n\n\n\n\n\n\n\n\n\n\n Batteries at end-of-life contain immense salvage potential and residual value.  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nUpfront Scrap Battery Price for Buyback \n\n\n\nWe enable battery buy-back agreements even before first sales of your new batteries.  \n\n\n\nAvail both fixed and floating scrap battery price thanks to our ability to model battery performance and the ability to determine future purchase prices via our DETX™ battery price index. Access real-time updates that keep you informed about the salvage value of your battery, or fleet of batteries at any point of time.A key consideration is the price that you can get for your scrap battery. LOHUM makes it easy to achieve zero ambiguity through DETX™. We host Basic and Advanced versions of our index to give you best prices irrespective of the amount of data that you can share. \n\n\n\n\n\n\n\n \nEnquire Now\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nReal-time Scrap Battery Price Calculator For Fast & Accurate Value \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAt any point of time, we can give you accurate and instant salvage value based off of battery data discoverable through our BMS-linked APP and software APIs. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSmartphone APP \n\n\n\nView accurate preliminary prices even before physical testing: instantly through our smartphone app.  \n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSoftware APIs \n\n\n\n\t\t\t\t\t\t\tAlternatively, onboard our well-documented and easy-to-integrate software APIs into your systems for seamless value discovery.\nThe software wirelessly reads data from your battery’s BMS via Bluetooth. After that, check the relevant boxes, and receive buyback prices instantly.\t\t\t\t\t\t\n\n\n\n\n\n{\t\t\n\t\t\"current_capacity\" :  108,\n\t\t\"ac_impedance\" : 0,\n\t\t\"cell_imbalance\" : 2,\n\t\t\"max_voltage\" : 0,\n\t\t\"min_voltage\" : 0,\n\t\t\"num_cycles\" : 253,\n\t\t\"age_in_months\" : 0,\n\t\t\"used_energy_thoughput_kwh\" : 0,\n\t\t\"soh\" : 93\n}\n\nGet Price\n\n\n\n\n\n\n\n\nsecond life price       ................... \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHere’s How Lohum MaximizesScrap Battery Price \n\n\n\n\n\n\n\n\n1/4\nTesting\n\nLOHUM tests to determine whether a battery can be reused or needs to be recycled. If the battery is reusable, we determine if they can be reused fully or partially. Often in battery packs that cannot be reused as-is, the majority of cells are still functional, but the battery is bottlenecked by a few deteriorated cells. \n\n\n2/4\nSegregation\n\nOur tests determine scrap battery price, and segregate healthy cells for use in new battery packs, and send unusable cells to our recycling facility. Through our proprietary repurposing technology, healthy cell modules can serve in various 2nd life ESS applications.      \n\n\n3/4\nRepurposing and BMS installation\n\nWe create a variety of battery packs and package them with our versatile BMS platform that is compatible with various kinds and configurations of cell modules, maximizing residual value and scrap battery price.      \n\n\n4/4\nUnlocking battery residual value\n\nOur ability to determine Remaining Useful Life (RUL) of cells helps us determine scrap battery price accurately and provide warranty for 2nd life battery products. Deteriorated cells can be recycled with 95% yield through our NEETM™ battery material recycling and extraction technology.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \nLearn more about Battery Recycling with Lohum\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“We are championing full cathode and anode recovery with 95% yield. Our process incurs low expenditure, has high yield and purity, and has low energy requirements. There is zero waste generation and all the by-products are either utilized or sold.” \n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHave Lithium-ion battery reuse, recycling, or EPR requirements? \n\n\n\n\n\n\n\nReceive a rapid response \n\n\n\nPlease enable JavaScript in your browser to complete this form.Name *FirstLastCountry*Company name*Phone *Email *How would you like to be contacted ?PhoneEmailChoose CategoryChoose categoryEPR and logistics partnershipLi-ion battery recyclingSecond life solutions for Li-ion batteriesRecycled battery raw materialsOther (please share below)MessageSubmit Request  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\nThe world’s largest producer of sustainable battery raw materials through recycling, repurposing, and low-carbon refining. \n\n\n\n \n\n\n\n \n\n\n\nLinkedin\n \n\n\n\n\n\n\n© 2023 Created by Yali Art Lab in association with Social Angadi \n\n\n\nCopyright © 2022 LOHUM.. All Rights Reserved \n\n\n\n\n\n\n\nCompany \n\n\n\n \n\n\nAbout Us\n\n\n\n\nCareer\n\n\n\n\nContact\n\n\n\n\n\n\n\n\n\n\n\nServices \n\n\n\n\n\n\nRecycle with us\n\n\n\n\nBattery Residual Value\n\n\n\n\nEPR Partnership\n\n\n\n\nLi-Ion Batteries\n\n\n\n\nBattery Metal Salts\n\n\n\n\nESG\n\n\n\n\n\n\n\n\n\n\n\nMedia \n\n\n\n\n\n\nNews\n\n\n\n\nPress\n\n\n\n\nBlog\n\n\n\n\n\n\n\n\n\n\n\n1800 572 8822 \n\n\n\nEmail : enquiry@lohum.com \n\n\n\nIndia Headquarters \n\n\n\nG98, Site, 5, Kasna, Block A, Surajpur Site V, Greater Noida, Uttar Pradesh 201306 \n\n\n\nLOHUM 'Reclaim' Recycling Facility \n\n\n\nLOHUM Cleantech Private Limited, Plot No. D-7 & 8, Site 5th, Kasna Industrial Area, Greater Noida, Gautam Budh Nagar, Uttar Pradesh – 201308 \n\n\n\nLOHUM Dismantling Facility \n\n\n\nLOHUM Cleantech Private Limited, Plot No. O-17, Site 5th, Kasna Industrial Area, Greater Noida, Gautam Budh Nagar, Uttar Pradesh – 201308 \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCopyright © 2022 Lohum.. All Rights Reserved \n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nReceive a rapid response \n\n\n\nPlease enable JavaScript in your browser to complete this form.Name *FirstLastCountry*Company name*Phone *Email *How would you like to be contacted ?PhoneEmailChoose CategoryChoose categoryEPR and logistics partnershipLi-ion battery recyclingSecond life solutions for Li-ion batteriesRecycled battery raw materialsOther (please share below)MessageSubmit Request  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}]}