{"text": [{"https://lumo.ag": "\n\n\n\n\n\nSmart Irrigation System | Save Time, Money & Water | Lumo\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nProduct\nAbout\nTeam\nField Journal\nBook a Demo\nContact\nLogin\n\n\n\n\nLoginRequest a Demo\nTimeMoneyWaterLUMO IS Smart Irrigation Technology designed for ambitious Growerswe are a california-based smart irrigation technology company obsessed with helping growers conserve their most precious resources:TIME, money, water.Introducing Lumo OneThe First smart irrigation valve\n\nControl, measure, and monitor your irrigations from your computer or smartphone.see how easy irrigating can beEliminate Costs by automating up to 90% of your current irrigation labor.Monitor Your Irrigations in Real Time with Lumo’s irrigation management software.Deliver the Exact Amount of Water by specifying a target volume by block or zone.Backed by Your Local Lumo Support Team to ensure your irrigations perform flawlessly.“We place a lot of emphasis on innovation, efficiency, and sustainability. that’s why we’re impressed with Lumo and its promise to optimize water usage for commercial growers like us.-RYAN DECKER, Clos du val\n\nTrusted by World Class Operations Proud Members Of based in California’s wine growing region, we know firsthand how precious water is. We’ll sit at the feet of any old timer and listen to their hard earned wisdom, but We’re not your grandpa’s irrigation system. We’re also not a bunch of geeks who sit in front of computers all day, pretending we know better than the grower in the field how to do their job. We created Lumo because we love to get our hands dirty, till soil, plant and grow things on our own land, make mistakes, break things, and wake up every morning wanting to do it better. We know the significance of water—when and how much—when it comes to cultivating the best crops. We’re here to make it easier to put the right amount of water in your field.Lumo is committed to radically reducing the amount of freshwater used in agriculture   today, agriculture consumes 70% of the world’s freshwater   Climate change and population growth are forcing governments and growers to adopt new water management technology. Currently, the systems growers have for managing and tracking irrigation are outdated and wasteful. Lumo’s technology optimizes productivity and profitability, while supporting growers as stewards of the planet.field journalVineyard management, viticulture and irrigation resources for growers   \n\n\n\n\n\n\n\nAre farmers really that slow to adopt technology?\n\n\n\nFarmers have a reputation for being slow to adopt technology. And it’s not just a narrative that gets pushed by agtech companies. Growers themselves sometimes believe it, at least about other growers. I’ve had more than one conversation with a grower who was interested in Lumo but readily cautioned how difficult it would be to […]\n\nKeep Reading\n \n\n\n\n\nHow Smart Valves Resolve the Precision Paradox\n\n\n\nSince I started working at Lumo, I’ve been intrigued by a paradox that lies at the heart of water management in agriculture. On one hand, growers understand that irrigation is one of the most important tools they have at their disposal for increasing crop quality and yield. They know it’s absolutely crucial to put on […]\n\nKeep Reading\n \n\n\n\n\n[JOB POSTING] Director / VP of Customer Success\n\n\n\nLumo Overview Lumo is building the future of agricultural irrigation technology. And there is no better way to ensure food and water security. By 2050, agricultural production will need to increase by 60% to meet our growing population needs. At the same time, annual global water consumption is predicted to exceed sustainable supplies by 40%. […]\n\nKeep Reading\n \n\nSee lumo in actionBook a Demo with Our Team\n427 Mendocino Ave Suite 100 Unit #119 Santa Rosa, CA 95401(302) 208 9374[email protected]Learn MoreProduct\nAbout Us\nTeam\nField Journal\nCareers\nSocializeLinkedIn\nInstagram\nTwitter\nFacebook\nYouTube\nConnectBook a Demo\nContact Us\nHome© Lumo Inc. 2024|Terms of Service|Privacy Policy|Sitemap\n\n\narrow-circle-o-downbarscrossmenu\n\n\n\n\n\n\n \n\n\n"}, {"https://lumo.ag/are-farmers-slow-to-adopt-technology/": "\n\n\n\n\n\nAre farmers really that slow to adopt technology?\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nProduct\nAbout\nTeam\nField Journal\nBook a Demo\nContact\nLogin\n\n\n\n\nLoginRequest a Demo\nContentsIrrigation TechnologyAre farmers really that slow to adopt technology?\n\nby Steele RoddickFarmers have a reputation for being slow to adopt technology.\nAnd it’s not just a narrative that gets pushed by agtech companies.\nGrowers themselves sometimes believe it, at least about other growers. I’ve had more than one conversation with a grower who was interested in Lumo but readily cautioned how difficult it would be to get others interested in trying, trusting and adopting our smart valves.\nBut I guess, the longer I work at Lumo, the more I question whether it’s true.\nI don’t buy it.\nThe part of the narrative that never made sense to me was how hard it conflicted with how my dad farmed.\nI grew up in rural Ontario on a 250-acre farm. We raised beef cattle (Maine-Anjous) and grew cash crops (corn and soybeans mostly).\nAnd my dad was constantly reading and researching new ways to improve yields. He was obsessed with experimenting, trying new sprays or new seed depths or densities, and with benchmarking himself against his neighbors down the road or at the co-op. (He always believed using cow manure as fertilizer gave him an unfair advantage.)\nHe didn’t have his head in the sand. He had his eyes on the horizon, searching for incremental improvements wherever he could find them—year after year after year.\nWas he quick to jump on every new gadget? No. Not at all. He was extremely resourceful and knew how to get by with what he already had. He fixed his own equipment and took great pride in maintaining it.\nWas he skeptical of the claims made by ag companies selling products? 100%. He was always far more interested in his firsthand experience or what the farmers he knew were trying nearby with success. Real world results, not marketing hype.\nAnd was he occasionally too slow to adopt a new way of doing things or a new solution that actually made a difference? Of course. He was fiercely independent in his thinking and always reluctant to follow the herd, even when the herd was headed in the right direction.\nBut he didn’t regret it. He knew that was the cost of being prudent and frugal. He knew he couldn’t afford to take big risks. That wasn’t the game he was playing.\nFarmers aren’t Venture Capitalists.\nFarming isn’t venture capital investing. They’re not looking for or all that interested in asymmetric upside.\nBecause in farming, it’s the downside that matters most. One big risk paying off isn’t going to pay for a bunch of other failures. In fact, from decades of experience, most farmers would tell you that massive 10X style improvements don’t exist in farming.\nInstead, it’s all about marginal, incremental improvement. Small tweaks that lead to increases in yield or improvements in quality over time. Linking those together, year after year. Many small bets, but that all have a high chance of leading to success, and even more importantly, that have a very low risk of outright failure.\nIt’s a low margin business and you grind out improvements, hoping to stay alive for another season and maybe make some money when the weather and markets are good.\nTaking risks on unproven technology isn’t a winning strategy and as a result, it’s not the prevailing mentality.\nBut that doesn’t mean they don’t adopt new tools that produce real returns.\nWorking at Lumo, I get a biased sample of farmers. No doubt. But the growers I talk to for interviews or at events are extremely engaged in what they’re doing. They are actively looking for a better way to irrigate.\nAnd almost all of them have tried the tools available! When you talk about automation in particular, they’ll tell you about all the different systems they’ve tried in the past and how the results have been mixed at best.\nWhen Devon and Bennett, our cofounders, went to the market to talk about irrigation automation, without even a product to sell, growers were eager to share their experiences and talk about what a new product would need to do to actually solve their most pressing irrigation challenges.\nWhen we talk to growers at Central Valley events or at webinars with CAWG and SVVGA, the growers there have heard of Lumo and are super interested in learning more about how the solution we offer differs from the things they’ve seen in the past.\nThese. People. Do. Not. Have. Their. Heads. In. The. Sand.\nNow look, tech companies always want to grow fast. And yes, as a marketer at an agtech company, I sometimes wish growth and expansion would happen even faster than it already is. That would be great!\nBut it also runs counter to how agriculture works. Growers want to try Lumo for a season before they expand across their entire acreage. That’s prudent risk management. Good business. Farming 101.\nAnd when they see the results they want to see, what do they do? They expand! They adopt. Because they’re in the business of repeatable success, continuing to double down on what works and letting go of the experiments that failed to produce a tangible result.\nFarmers are cautious and skeptical by nature. Averse to risk.\nBut they’re also eager to learn, always tinkering and experimenting and looking for ways to make things better.\nIf you give them a tool that works, they will use it.\nIf you're looking to try an irrigation automation system that provides a tangible ROI, there's still time to get started with Lumo this season! Send us an email at [email protected] or request a demo here.\nGo Back to the Lumo Field JournalSee lumo in actionBook a Demo with Our Team\n427 Mendocino Ave Suite 100 Unit #119 Santa Rosa, CA 95401(302) 208 9374[email protected]Learn MoreProduct\nAbout Us\nTeam\nField Journal\nCareers\nSocializeLinkedIn\nInstagram\nTwitter\nFacebook\nYouTube\nConnectBook a Demo\nContact Us\nHome - Irrigation Technology - Are farmers really that slow to adopt technology?© Lumo Inc. 2024|Terms of Service|Privacy Policy|Sitemap\n\n\narrow-circle-o-downbarscrossmenu\n\n\n\n\n\n\n \n\n\n"}, {"https://lumo.ag/how-smart-valves-resolve-the-precision-paradox/": "\n\n\n\n\n\nHow Smart Valves Resolve the Precision Paradox\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nProduct\nAbout\nTeam\nField Journal\nBook a Demo\nContact\nLogin\n\n\n\n\nLoginRequest a Demo\nContentsIrrigation TechnologyHow Smart Valves Resolve the Precision Paradox\n\nby Steele RoddickSince I started working at Lumo, I’ve been intrigued by a paradox that lies at the heart of water management in agriculture.\nOn one hand, growers understand that irrigation is one of the most important tools they have at their disposal for increasing crop quality and yield. They know it’s absolutely crucial to put on the right volumes at the right times.\nAnd yet, many growers don’t actually know exactly how much water they’re applying. They lack real-time visibility and volume-based control.\nHow could that possibly be?\nTwo reasons: operational difficulty and cost.\nMost growers don’t know the precise volumes of water they’re applying to their crops, even though they know just how important it is to get those volumes right, because, at least before smart valves were invented, it was both too hard and too expensive to be exact.\nLet’s take the operational piece first.\nWhen you’re relying on an irrigator to open and close valves by hand, it’s extremely difficult to be precise. An irrigator can only work for so many hours. They can easily get caught in traffic, or get caught up in whatever they’re doing and lose track of time. There are a whole bunch of different reasons why water might run an hour or two longer than intended.\nEven if you know intellectually that precise volumes are important, it simply doesn’t matter if your operations only allow you to deliver rough durations anyway. This has been the reality for so long that many growers have come to believe that being more precise is impossible. There’s no use trying. The juice isn’t worth the squeeze.\nWhich leads us to the second piece–cost.\nBecause of the importance of irrigation, there have been countless attempts to automate the turning of valves and to cobble together solutions for tracking volumes.\nBut in addition to adding operational complexity, these solutions have also been cost prohibitive.\nThe price point matters.\nIf a solution is too expensive, it can easily offset any gains in quality or yield, and your return goes out the window. Add in a bit of downtime at the wrong time, and there’s no wonder why so many growers end up going back to irrigating manually.\nSmart valves deliver precision and operational simplicity at a price that makes sense.\nWith internet-connected smart valves, growers gain a level of operational control that they’ve never had before. They can turn their valves with a tap on their smartphone from wherever they are. They can set up irrigation schedules and completely automate the process.\nThey’re no longer bound by the number of working hours in their irrigator’s day, or by how long the drive takes to get to the ranch. They can avoid peak electricity rates and irrigate at night. And with the flow meter that comes built into each valve, they can finally irrigate based on volume.\nEven better, those volumes automatically get logged and securely stored, so growers know exactly how much water was applied to each block without doing any manual reconciliation work.\nNo clipboards. No spreadsheets. No entering start and stop times anywhere.\nDelivering precise water volumes is simply way, way easier with smart valves. As is verifying those volumes after that fact. So much less time. So much less effort.\nAnd to top it off, smart valves are much less expensive than the alternatives. Piecing together a similar solution with solenoid valves, sensors, telemetry units and software costs 3-5 times more.\nUntil now, growers have simply not been set up for irrigation success.\nTo date, growers have done their best with what they had.\nBut they’ve faced binding operational constraints and been given inadequate tools. Because they haven’t been able to deliver precise volumes, it made little sense to put in the effort to track their water usage more closely.\nSmart valves shift the paradigm.\nThey make delivering precise volumes easy, they make tracking those volumes automatic, and they do both at a price point that allows the potential gains in crop quality and yield to fall directly to the grower’s bottom line.\nSmart valves finally make it possible and profitable to be as precise as growers have long wished they could be.\nTo learn more about how smart valves can help you dial in your irrigation precision, request a demo here or contact us at [email protected]  \nGo Back to the Lumo Field JournalSee lumo in actionBook a Demo with Our Team\n427 Mendocino Ave Suite 100 Unit #119 Santa Rosa, CA 95401(302) 208 9374[email protected]Learn MoreProduct\nAbout Us\nTeam\nField Journal\nCareers\nSocializeLinkedIn\nInstagram\nTwitter\nFacebook\nYouTube\nConnectBook a Demo\nContact Us\nHome - Irrigation Technology - How Smart Valves Resolve the Precision Paradox© Lumo Inc. 2024|Terms of Service|Privacy Policy|Sitemap\n\n\narrow-circle-o-downbarscrossmenu\n\n\n\n\n\n\n \n\n\n"}, {"https://lumo.ag/job-posting-director-of-customer-success/": "\n\n\n\n\n\n[JOB POSTING] Director / VP Customer Success\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nProduct\nAbout\nTeam\nField Journal\nBook a Demo\nContact\nLogin\n\n\n\n\nLoginRequest a Demo\nContentsJob Postings[JOB POSTING] Director / VP of Customer Success\n\nby Bennett FitzgibbonLumo Overview\nLumo is building the future of agricultural irrigation technology. And there is no better way to ensure food and water security.\nBy 2050, agricultural production will need to increase by 60% to meet our growing population needs. At the same time, annual global water consumption is predicted to exceed sustainable supplies by 40%. This is a major challenge for our farmers, who already account for 70% of global water use, and 85% in drought-stricken California.\nLumo offers the world’s first smart irrigation value to massively improve irrigation efficiency. Our patented design lets growers optimize every irrigation, reducing costs, protecting crops and improving yields, all while improving farm sustainability. \nIn less than 2 years, Lumo has already earned the trust of some of the world’s largest growers, including 5 of the top 10 largest wine growers in the US. Our clients are innovators and leaders in water management, agricultural sustainability, and climate action, and we are proud to further their goals with Lumo’s definitive, unreasonably good client support.\nPosition Overview\nGiven how important irrigation is to our customers, our SaaS business model, and our unwavering commitment to our value of being One with Customers, Customer Success is absolutely vital to our long-term growth. We will not be successful unless our customers are receiving massive value from our service and world class support. As such, we need a senior executive to own driving success for our customers. This role will be responsible for Customer Success activities (e.g., on-boarding, support, services, adoption, advocacy, retention, etc.) and outcomes (e.g., renewals, up-sell, etc.) by building up the existing internal team and training our channel partners.\nResponsibilities\n\n\nDrive Customer Success Outcomes\n\nDeliver a fast, easy customer experience\nKeep churn best-in-class for enterprise SaaS\nPartner with Sales and Marketing to drive up net-revenue-retention (NRR)\nInfluence roadmap by capturing customer insights & data to support business case for key features\nInfluence future lifetime value through higher product adoption, customer satisfaction and overall health scores\nDrive new business growth through greater advocacy and reference-ability\n\n\n\nDefine and Optimize Customer Lifecycle\n\nMap customer journey\nDevelop listening points in journey (e.g., usage, satisfaction, etc.)\nStandardize interventions for each point in journey\nIdentify opportunities for continuous improvement\n\n\n\nDesign & Manage Customer Success Activities\n\nManage installation partners & scheduling \nOnboarding to the Lumo Ops Centre (SaaS platform)\nCustomer Support (Field team + remote support)\nQuarterly Irrigation Reviews to prove Lumo value and ensure renewals\nSupport sales in Cross-sell / Up-sell\nHelp marketing drive advocacy & referrals\nCreate standardized training and onboarding materials\n\n\n\nMeasure Effectiveness of Customer Success\n\nDefine operational metrics for team\nEstablish system for tracking metrics\nCreate cadence for review within team\nExpose subset of metrics to executive team, company and board\n\n\n\nLead World-class Customer Success Team\n\nCoach the current CS Team, and all departments to adopt best practices in Customer Success\nRecruit experienced leaders for each functional role\nAttract high potential individual contributors into team\nCreate rapid onboarding process for new team members\nFoster collaboration within team and across customer lifecycle\nEncourage continuous learning within team\n\n\n\nEnhance Effectiveness and Efficiency Through Technology\n\nSupport & ticketing systems\nCapture product feedback & influence roadmap\nBuild and manage CS reporting dashboard for company wide visibility into ticketing and onboarding performance\nSupport Marketing in designing NPS, reference or advocacy solutions\n\n\n\nInspire Customer Success Across Company\n\nCreate company-wide culture of Customer Success\nAlign with Marketing around marketing to existing clients\nAlign with Product around driving product roadmap\nAlign with Sales around cross-sell and up-sell and focus on selling with a retention focus\nAlign with Finance around measurement and forecasting\nAlign with Executive Team around key metrics and objectives\nDrive company-wide definition of ideal customer\nCreate company-wide customer feedback loop\n\n\n\nRequired Experience/Skills\n\n5+ years experience in leading customer-facing organizations\nDemonstrated success in building high functioning customer success organisations in start-up/scale-up environments\nExperience building and leading all-star teams \nAbility to manage influence through persuasion, negotiation, and consensus building\nStrong empathy for customers AND passion for revenue and growth\nDeep understanding of value drivers in recurring revenue business models\nAnalytical and process-oriented mindset\nAbility to draw useable insights and strategies from data\nAdmin experience with managing and customizing CRM and CS platforms (hubspot, salesforce, zendesk, etc.)\nDemonstrated desire for continuous learning and improvement\nEnthusiastic and creative leader with the ability to inspire others\nCollaborative with ability to quickly build relationships across levels and disciplines\nExcellent communication and presentation skills\nRelevant Bachelor’s degree \nSpanish language fluency is a strong plus \nClimate-tech, ag-tech or B2B SaaS experience a strong plus\n\nLocation\n\nLumo is headquartered in Santa Rosa, CA. This position is eligible for hybrid work, but in-person presence in the state of California will be required for this position. \n\nSalary Range\nFlexible - $150 - $200K based on experience + equity\nLearn more by visiting www.lumo.ag and apply with resume to [email protected].\nGo Back to the Lumo Field JournalSee lumo in actionBook a Demo with Our Team\n427 Mendocino Ave Suite 100 Unit #119 Santa Rosa, CA 95401(302) 208 9374[email protected]Learn MoreProduct\nAbout Us\nTeam\nField Journal\nCareers\nSocializeLinkedIn\nInstagram\nTwitter\nFacebook\nYouTube\nConnectBook a Demo\nContact Us\nHome - Job Postings - [JOB POSTING] Director / VP of Customer Success© Lumo Inc. 2024|Terms of Service|Privacy Policy|Sitemap\n\n\narrow-circle-o-downbarscrossmenu\n\n\n\n\n\n\n \n\n\n"}, {"https://lumo.ag/careers/": "\n\n\n\n\n\nCareers | Irrigation Technology | Lumo\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nProduct\nAbout\nTeam\nField Journal\nBook a Demo\nContact\nLogin\n\n\n\n\nLoginRequest a Demo\ncareersDIRECTOR OF Strategy & OperationsWe are seeking a driven Director of Strategy & Operations to partner with the CEO to scale our business’ operations and strategy functions. This pivotal role involves establishing scalable systems and processes that improve operational excellence across our financial, HR, executive operations and board communications. You will also drive strategic projects that accelerate our revenue and professional growth. This position offers a unique opportunity to directly impact our growth trajectory and grow into an operating member of the executive team.APPLYDIRECTOR / VP OF Customer SuccessGiven how important irrigation is to our customers, our SaaS business model, and our unwavering commitment to our value of being One with Customers, Customer Success is absolutely vital to our long-term growth. We will not be successful unless our customers are receiving massive value from our service and world class support. As such, we need a senior executive to own driving success for our customers. This role will be responsible for Customer Success activities (e.g., on-boarding, support, services, adoption, advocacy, retention, etc.) and outcomes (e.g., renewals, up-sell, etc.) by building up the existing internal team and training our channel partners.APPLYSee lumo in actionBook a Demo with Our Team\n427 Mendocino Ave Suite 100 Unit #119 Santa Rosa, CA 95401(302) 208 9374[email protected]Learn MoreProduct\nAbout Us\nTeam\nField Journal\nCareers\nSocializeLinkedIn\nInstagram\nTwitter\nFacebook\nYouTube\nConnectBook a Demo\nContact Us\nHome - Careers© Lumo Inc. 2024|Terms of Service|Privacy Policy|Sitemap\n\n\narrow-circle-o-downbarscrossmenu\n\n\n\n\n\n\n \n\n\n"}]}