{"text": [{"https://www.mintz.com": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMintz | Attorneys | Corporate | Litigation | IP\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content \n\n\n\n\n\n\n\nMenu\n\n\n\n\n\n\n\nWhy MintzMeet Our Managing MemberOur HistoryDiversityPro BonoCommunity ServiceAlumniLeadershipAwards & RecognitionInternational Law Firm NetworkIn MemoriamOur PeopleOur ServicesInsights CenterEventsNews & Press Releases\n\n\nAlumniCareersOfficesNews\n\n\n\n\n\nSearch\n\nSearch\n\n\nOpen Search\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n  Navigating Trade Secrets Strategies in Early-Stage R&D\n\n\n\n\n\n\n  Navigating Trade Secrets Strategies in Early-Stage R&D\n\n\n\nProtecting innovations is crucial as pharmaceutical, medical device, and high-tech industries rapidly evolve with increased collaboration in early stages of research and development. Intellectual Property Chair Michael Renaud, Member Vanessa Yen, Special Counsel Evan Diamond, and Associate Gabriella Flick co-authored an article in Bloomberg Law, providing key insights into trade secret strategies to safeguard advancements.\n\nLearn More\n\n\n\n\n\n\n\n\n\n\n  News\n\n\n\nProtecting Trade Secrets Without Non-Competes\n\n\nAs the FTC imposes limits on non-competes, companies must adopt new strategies to protect trade secrets and confidential information. Member Geri Haight and Associate Danielle Bereznay offer guidance for businesses in their article in Mealey’s Litigation Report as the FTC’s threat of a ban looms. \n\nLearn More\n\n\n\n \n\n\n\n\n\n\n\n\n\nPress\n\nMintz Advises Altamira on Award-Winning Deal\n\n\nA Mintz team led by Corporate Members Jim McKnight and Joe Ronca advised Altamira Technologies Corporation on its acquisition of Virginia Systems & Technology, Inc. This strategic acquisition expanded Altamira’s capabilities and national security customer portfolio, while winning “Deal of the Year” in the “Under $50 Million” category at ACG National Capital’s 22nd Annual Corporate Growth Awards.\n\nLearn More\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n  News\n\n\n\nAdvocating for Written Jury Instructions in New York\n\n\nJuror confusion and differing recollections during criminal trial deliberations can be problematic. Member Jason P.W. Halperin and Associate Erin Galliher discuss with the New York Law Journal the benefits of changing the current practice and allowing written jury instructions in the jury room to prevent such issues.\n\nLearn More\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n  News\n\n\n\nMintz Named Best Place to Work in the Bay Area\n\n\nMintz has been recognized as one of the “Best Places to Work in the Bay Area” by the San Francisco Business Times and Silicon Valley Business Journal. San Francisco Managing Member Steve Osborn attributed the award to Mintz’s collaborative and inclusive culture, highlighting our employees as the secret to the firm’s success. \n\nLearn More\n\n\n\n \n\n\n\n\n\n\n\n\n\nPress\n\nMintz IP Practice Recognized in 2024 IAM Patent 1000\n\n\nOur Intellectual Property Practice earned national recognition in the 2024 edition of IAM Patent 1000 – The World’s Leading Patent Practitioners. The guide recognized Mintz with four firm-wide rankings and 14 individual attorney recommendations, including a gold ranking for Intellectual Property Chair Michael Renaud.\n\nLearn More\n\n\n\n \n\n\n\n\n\n\n\n\n\nPress\n\nMintz Named to US News 2024 Best Companies to Work For\n\n\nMintz has been recognized as one of the “2024 Best Companies to Work For” by the US News & World Report. The recognition is based on six critical factors: quality of pay, work life balance, stability, comfort, belongingness, and professional development. Our ratings reflect Mintz’s dedication to fostering a workplace culture that values professional growth, work-life balance, and overall employee well-being.\n\nLearn More\n\n\n\n \n\n\n\n\n\n\nPrevious\nNext\n\n\n\n\nAwards and Recognition\n\n\n\n\n\n\n\n\n\n  Best Law Firms 2024\n\n\n\n  Ranked by Best Lawyers\n\n\n\n\nThe firm received 69 top-tier national and regional rankings in the 2024 edition.\n\n\n\n\n\n\n\n\n  AmLaw 100 2024\n\n\n\n  American Lawyer\n\n\n\n\nMintz ranks among the top 100 US law firms in terms of gross revenue.\n\n\n\n\n\n\n\n\n  Chambers USA 2024\n\n\n\n  Chambers USA 2024\n\n\n\n\nThe 2024 edition recognized 83 Mintz attorneys and 42 of the firm's practices as leaders in their fields.\n\n\n\n\n\n\n\n\n  Human Rights Campaign Foundation 2023\n\n\n\n  Equality 100 Leader in LGBTQ+ Workplace Inclusion\n\n\n\n\nMintz received its 16th consecutive perfect score on the Human Rights Campaign Foundation's Corporate Equality Index\n\n\n\n\n\n\n\n\n\n\nMore from Mintz\n\n\n\n\n\n\n\nLearn more\n    \n\n\n\n\n\n\nLearn more\n    \n\n\n\n\n\n\n\n\nOur Offices\n\n\n\n\n\nBoston\n      \n\n\nt / 617.542.6000\n\n\n\nLos Angeles\n      \n\n\nt / 310.586.3200\n\n\n\nMiami\n      \n\n\nt / 786.949.6600\n\n\n\nNew York\n      \n\n\nt / 212.935.3000\n\n\n\nSan Diego\n      \n\n\nt / 858.314.1500\n\n\n\nSan Francisco\n      \n\n\nt / 415.432.6000\n\n\n\nToronto\n      \n\n\nt / 647.499.2828\n\n\n\nWashington, DC\n      \n\n\nt / 202.434.7300\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nReady to Get Started?\n\n\n        Our Services\n        \n\n\n\n\n\n\n\n\n\n\n\nSign up for Mintz Insights\nGet our latest thought leadership\n\n\n\n\n\n\n\n\n\n\nFind Solutions\n\nPractices\nIndustries\nWhy Mintz\n\n\n\nGet in Touch\n\nOffices\nFind an Attorney\nCareers\n\n\n\nKeep in Touch\n\nInsights Center\nNews & Press Releases\nEvents\n\n\n\nFollow us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFooter\n\nSitemapDisclaimerPrivacy StatementGDPR Privacy NoticeML StrategiesAlumniMintz Employee AccessAccessibility\n\n\n\nReview Cookie Management Center\n© 2024 Mintz, Levin, Cohn, Ferris, Glovsky and Popeo, P.C. All Rights Reserved.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.mintz.com/gdpr-privacy-notice": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGDPR Privacy Notice | Mintz\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content \n\n\n\n\n\n\n\nMenu\n\n\n\n\n\n\n\nWhy MintzMeet Our Managing MemberOur HistoryDiversityPro BonoCommunity ServiceAlumniLeadershipAwards & RecognitionInternational Law Firm NetworkIn MemoriamOur PeopleOur ServicesInsights CenterEventsNews & Press Releases\n\n\nAlumniCareersOfficesNews\n\n\n\n\n\nSearch\n\nSearch\n\n\nOpen Search\n\n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\nGDPR Privacy Notice\n\n\n\n\nThis Notice is for people who are located in the European Economic Area (“EEA”), Switzerland or the United Kingdom (“UK”) and supplements our general Privacy Notice.  Our processing of personal data of people who are in the EEA is governed by the European Union’s General Data Protection Regulation (the “GDPR”).  Our processing of personal data of people who are in the UK is subject to the Data Protection Act 2018, which incorporates the GDPR as the UK GDPR.  This Notice refers to the GDPR and the UK GDPR collectively as the “GDPR”.  As of the most recent revision date of this Notice, we anticipate that Switzerland’s updated data protection law will go into effect during the second half of 2022.  For the sake of administrative efficiency, this Notice applies to people in Switzerland as well as people in the EEA or UK.  However, this does not limit any additional right that people in Switzerland may have.. \nThe GDPR requires us to provide certain information to you about your personal data, which we refer to in this notice as your personal information.\n\n\nData Controller\nThe data controller for this website is the law firm Mintz, Levin, Cohn, Ferris, Glovsky and Popeo, P.C. (“Mintz” for short).  For our contact information, see the section in our general Privacy Notice headed “How to Contact Us”.\nPurposes of the processing\nOur general Privacy Notice describes the personal information that we collect, use, share, or otherwise process personal information – and the purposes for that processing -- in the course of operating our business (other than in the course of legal representation of a client, which is subject to our client agreements and professional responsibilities).  Personal information gathered through cookies and similar tracking technologies is used for the purposes described in our Privacy Preference Center. \nLawful basis for the processing\nGenerally, we process personal information provided by visitors through our website or other interactions with us on the basis our legitimate interests in conducting our business as a law firm.  Where we ask for your consent, we process personal information on the basis of that consent. \nWe may also process personal information on other bases permitted by the GDPR and applicable laws, such as when the processing is necessary for us to comply with our legal obligations.\nCategories of personal information\nThe categories of personal information that we process are described in our general Privacy Notice.\nRecipients of your personal information\nWe use various service providers to manage our website and provide services such as event registration or managing e-mail communications.  Our service providers change from time to time.  Note that our service providers have entered into contracts with us that restrict what they can do with your personal information. If you would like specific information about our service providers who have received your information, please contact us at [email protected] and we will provide that information to you. We may also disclose your personal information to other categories of third parties as described in Part 3 of our general Privacy Notice.\nInformation regarding the transfers of personal data outside of the European Economic Area (EEA)\nMintz’s main administrative offices are based in the USA and that’s where we process personal information collected through our website.  When you provide personal information to us, we request your consent to transfer that personal information to the USA.  The USA does not have an adequacy decision from the European Commission, which means that the Commission has not determined that the laws of the USA provide adequate protection for personal information.  Although the laws of the USA do not provide legal protection that is equivalent to EU data protection laws, we safeguard your personal information by treating it in accordance with this GDPR Privacy Notice.  We take appropriate steps to protect your privacy and implement reasonable security measures to protect your personal information in storage. We use secure transmission methods to collect personal data through our website.  We also enter into contracts with our data processors that require them to treat personal information in a manner that is consistent with this Notice.\nRetention period for personal information\nHow long we retain personal information varies according to the type of information in question and the purpose for which it is used.  We delete personal information within a reasonable period after we no longer need to use it for the purpose for which it was collected (or for any subsequent purpose that is compatible with the original purpose).  This does not affect your right to request that we delete your personal data before the end of its retention period.  We may archive personal data (which means storing it in inactive files) for a certain period prior to its final deletion, as part of our ordinary business continuity procedures.\nYour data subject access rights\nYou have the right to request access to your personal data, to have your personal data corrected, restricted or deleted, to withdraw any consent that you have given to the processing of your personal data (without affecting the lawfulness of the processing prior to your withdrawal of consent) and to object to our processing of your personal data.  You also have the right of data portability in certain circumstances, which means that you can request that we provide you (or a third party you designate) with a transferable copy of personal information that you have provided to us.  Your rights may be subject to various limitations under the GDPR.  If you wish to exercise any of these rights, or if you have any concerns about our processing of your personal data, please contact us in any of the ways listed in the section “How to Contact Us” in our general Privacy Notice.\nThe right to lodge a complaint with a supervisory authority\nYou have the right to file a complaint concerning our processing of your personal data with your national (or in some countries, regional) data protection authority.   The EU Commission has a list here:  http://ec.europa.eu/justice/article-29/structure/data-protection-authorities/index_en.htm.  The data protection authority for the United Kingdom is the Information Commissioner’s Office (www.ico.org.uk).  The federal data protection authority for Switzerland is the Federal Data Protection and Information Commissioner: https://www.edoeb.admin.ch/edoeb/en/home/the-fdpic/task.html.   \nAbsence of statutory or contractual requirement or other obligation to provide any personal data\nUsers of our website are under no statutory or contractual requirement or other obligation to provide personal information to us, but it will not be possible to receive communications from us or register for our events without doing so.\n\n\n\n\n\n\n\n\n\n\n\nSign up for Mintz Insights\nGet our latest thought leadership\n\n\n\n\n\n\n\n\n\n\nFind Solutions\n\nPractices\nIndustries\nWhy Mintz\n\n\n\nGet in Touch\n\nOffices\nFind an Attorney\nCareers\n\n\n\nKeep in Touch\n\nInsights Center\nNews & Press Releases\nEvents\n\n\n\nFollow us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFooter\n\nSitemapDisclaimerPrivacy StatementGDPR Privacy NoticeML StrategiesAlumniMintz Employee AccessAccessibility\n\n\n\nReview Cookie Management Center\n© 2024 Mintz, Levin, Cohn, Ferris, Glovsky and Popeo, P.C. All Rights Reserved.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.mintz.com/integrated-accessibility-standards-policy-toronto-only": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIntegrated Accessibility Standards Policy | Mintz\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Skip to main content \n\n\n\n\n\n\n\nMenu\n\n\n\n\n\n\n\nWhy MintzMeet Our Managing MemberOur HistoryDiversityPro BonoCommunity ServiceAlumniLeadershipAwards & RecognitionInternational Law Firm NetworkIn MemoriamOur PeopleOur ServicesInsights CenterEventsNews & Press Releases\n\n\nAlumniCareersOfficesNews\n\n\n\n\n\nSearch\n\nSearch\n\n\nOpen Search\n\n\n\n\n\n\n\n\n\nHome\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nIntegrated Accessibility Standards Policy\n\n\n\n\n\n\n\n\n\n\n\nPurpose\nMintz's Toronto office (\"Mintz\" or the \"Firm\") is committed to creating and maintaining an accessible environment for all of the Mintz team, clients and visitors, and will provide accommodation where required, in accordance with the Accessibility for Ontarians with Disabilities Act, 2005 (the \"Act\").\nPolicy\nUnder the AODA, the Integrated Accessibility Standards Regulation (the \"IASR\"), establishes standards to address barriers that people with disabilities face in the areas of information and communications, employment, transportation and the design of public spaces. The purpose of this policy is to outline responsibilities under the AODA and the Integrated Accessibility Standards Regulation. Policy The Integrated Accessibility Standards Policy is designed to ensure that the firm is accessible to all those who work at the firm and clients and visitors in a way that respects dignity, independence, integration, and equal opportunity. Mintz is committed to preventing and removing barriers to accessibility and meeting the requirements under the AODA in a timely manner.\nMulti-Year Accessibility Plan\nMintz has adopted a Multi-Year Accessibility Plan that outlines the steps Mintz has taken and will take to prevent and remove barriers to accessibility. The plan is available on Mintz internal intranet and the external website, and will be provided in an accessible format, upon request. Mintz will review and update the plan every 5 years, or sooner if required by law.\nAccessible Formats and Communication Supports\nThe availability of accessible formats and communication supports is set out on Mintz's public website.\nRequests for accessible formats and communication supports can be made to the Director of Administration, Toronto. Upon receipt of a request, Mintz will provide or arrange for the provision of accessible formats and communication supports for persons with a disability. Such formats and supports will be provided in a timely manner that takes into account the individual's accessibility needs due to disability and at a cost that is no more than the regular cost charged to other persons. Mintz will consult with the individual making the request to determine the suitability of a particular accessible format or communication support.\nIn the event that an accessible format or communication support is found to be not feasible, Mintz will provide written reasons explaining this finding.\nWebsites and Web Content\nMintz is working toward reaching compliance with WCAG 2.0, Level AA protocols per the provisions of the AODA and as is required by the IASR. The firm expects to reach compliance by December 31, 2025.\nEmergency Response\nMintz's emergency response procedures can be found on MintzPort. Mintz will provide, upon request, all existing emergency procedures, plans and public safety information in an accessible format or with appropriate communication supports, in a timely manner, on request.\nTraining\nMintz provides accessibility training in various formats to all Workers, all persons who participate in developing Mintz's policies, and all other persons who provide goods, services, or facilities on behalf of Mintz. Such training is provided prior to a person's commencement of duties for Mintz and on an ongoing basis thereafter, including whenever changes are made to this Policy or any other accessibility-related policies, practices, or procedures of Mintz.\nProcurement or Acquisition of Goods, Services, and Facilities\nMintz incorporates accessibility criteria and features when procuring or acquiring goods, services, and facilities, including self-service kiosks, except where it is not practicable to do so. If Mintz determines that it is not practical to incorporate a particular accessibility criterion or feature when procuring or acquiring goods, Mintz will provide an explanation for this determination upon request.\nDesign of Public Spaces\nWhen building or making major modifications to public spaces, Mintz will commit to meeting the Accessibility Standards for the Design of Public Spaces, including any requirements regarding preventative and emergency maintenance of the accessible elements in public spaces. Employment Mintz is committed to accessibility and inclusivity in its hiring and employment practices. It demonstrates its commitment by:\nAccessibility during Recruitment\nDuring any recruitment process, Mintz will advise applicants of the availability of accommodation for applicants with disabilities. If an applicant requests accommodation during the recruitment process, Mintz will consult with the applicant and arrange for the provision of suitable accommodation in a manner that takes into account the applicant's accessibility needs due to disability.\nAccessibility during Employment\nMintz will inform all Mintz employees and Partners about Mintz's disability-related policies, including policies that provide for job accommodations due to disability. If a Worker with a disability requests for job-related information or information that is generally available in the workplace to be provided in an accessible format or with communication supports, Mintz will consult with the requesting Worker on how to best meet their needs. Where necessary, Mintz will develop individualized emergency response plans for Workers with disabilities, as well as information to assist such Workers during an emergency or evacuation.\nDevelopment of Individual Accommodation Plans for Employees with Disabilities\nIn compliance with the AODA, Mintz has implemented a written process for the development of documented individual accommodation plans for employees with disabilities.\nIf an employee is absent from work due to disability and requires accommodation consideration in order to return to work, Mintz will work with a third party adjudicator, where suitable and necessary, to develop an individual accommodation plan for that employee.\nPlease refer to the Individual Accommodation and Return to Work Policy for more information.\nReview and Modifications to this Policy\nMintz is committed to developing policies that respect and promote the dignity and independence of people with disabilities. All policies and procedures will be developed or updated in such a manner as to respect and promote the dignity and independence of Mintz's clients and other persons with disabilities.\nDocumentation to Be Made Available\nAll Partners and employees of Mintz will be provided with a copy of this Policy. This Policy, or the information contained in this Policy, can be provided in an accessible format or with communication supports upon request.\nRequests for Information and Responding to Feedback\nIf you wish to request information in an accessible format, or if you wish to provide feedback on Mintz's accessibility measures or this feedback process itself, please contact the Director of Administration, Toronto:\n\nChristine Wood, Director of Administration\nPhone: 1.647.499.2466\nEmail: [email protected]\nMail: Attn: Christine Wood, 200 Bay Street, Suite 2800, Toronto, ON, MSJ 2J3\n\nSuch feedback will be addressed according to Mintz's regular complaint management procedures. All feedback will be reviewed and appropriate action will be taken to address any complaints as soon as practicable, generally within 7 days.\nMintz's feedback process can be provided in an accessible format or with communications supports upon request. \n\n\n\n\n\n\n\n\n\n\n\nSign up for Mintz Insights\nGet our latest thought leadership\n\n\n\n\n\n\n\n\n\n\nFind Solutions\n\nPractices\nIndustries\nWhy Mintz\n\n\n\nGet in Touch\n\nOffices\nFind an Attorney\nCareers\n\n\n\nKeep in Touch\n\nInsights Center\nNews & Press Releases\nEvents\n\n\n\nFollow us\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFooter\n\nSitemapDisclaimerPrivacy StatementGDPR Privacy NoticeML StrategiesAlumniMintz Employee AccessAccessibility\n\n\n\nReview Cookie Management Center\n© 2024 Mintz, Levin, Cohn, Ferris, Glovsky and Popeo, P.C. All Rights Reserved.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}]}