{"text": [{"https://mocean.energy": "\n\n\n\n\n\n\n\nMocean Energy | Wave energy technology developer | Scotland\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Navigation\n\n\nHOME\nABOUT\n\nOUR PRINCIPLES\nOUR TEAM\nPARTNERS\nTECHNOLOGY\nAWARDS & ACCREDITATIONS\n\n\nNEWS\n\nLATEST NEWS\nMOCEAN IN THE MEDIA\nDECOMMISSIONING PROGRAMME\n\n\nJOBS\nCONTACT\n\n\nHOME\nABOUT\n\nOUR PRINCIPLES\nOUR TEAM\nPARTNERS\nTECHNOLOGY\nAWARDS & ACCREDITATIONS\n\n\nNEWS\n\nLATEST NEWS\nMOCEAN IN THE MEDIA\nDECOMMISSIONING PROGRAMME\n\n\nJOBS\nCONTACT\n\n\n\n\n\n\n\n\n\nGreen Energy Out of the BlueMocean Energy is committed to designing and delivering wave energy converters to provide ocean equipment and the grid with clean, carbon-free, renewable energy.\nThe ocean remains a tremendous, untapped resource for green energy. Harnessing just one percent of  our global wave power resource would power more than 50 million home and save more than 50 million tonnes of CO2 annually.Our approachAt Mocean Energy, we have an expert team that combines scientific principles and real-world experience to develop new technologies that can harness the power of waves – and accelerate the transition to a zero-carbon world.\nOur approach utilises numerical modelling and optimisation, rapid prototyping and tank testing – allied to hard-won ocean experience – to deliver wave energy machines that produce high levels of power for their size and work in some of the world’s harshest environments.\nAlready we have secured more than £5 million in funding support from the Scottish and UK governments and the EU. With our prototype – the Blue X  – deployed at sea for testing, we gathered rich data for our two core technologies – the Blue Star and the Blue Horizon.Blue Star Mocean is designing the Blue Star device to provide reliable, affordable, and renewable power for a range of subsea applications – from control systems, to ROVs, to autonomous underwater vehicles.Blue Horizon We are also developing a much larger wave energy converter   – the Blue Horizon – based on the same principles as the Blue Star. Deployed in wave farms offshore, the Blue Horizon will deliver grid-scale power. Blue X : prototype testingWith £3.3 million secured from Wave Energy Scotland, we built a prototype model – the  Blue X. Installed off the coast in spring 2021, the Blue X provided tremendous data on machine performance that can be applied to both the Blue Star and the Blue Horizon.\n\n\n\n\n\n\nTerms of Use\nPrivacy Policy\nCookie Policy\n\n\n hello@mocean.energy     \n +44 (0)131 651 7959\n 10 Max Born Crescent, Edinburgh, EH9 3BF\n© Mocean Energy 2019\n    \n\n\n \n\n \n \nThis website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Cookie settingsACCEPTPrivacy & Cookies Policy\n\n\n\n\nClose\n\n\n\n\n\n\nPrivacy Overview \nThis website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are as essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. See our Cookie Policy for more info.\n\n \n\n\n\n\n\nNecessary\t\t\t\t\t\t\t\n\n\nNecessary\n\nAlways Enabled\n\n\n\n\nNecessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information.\t\t\t\t\t\t\t\t\n\n\n\n\n\n\nNon-necessary\t\t\t\t\t\t\t\n\n\nNon-necessary\n\n\n\n\n\nAny cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website.\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\nSAVE & ACCEPT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.mocean.energy/principles/": "\n\n\n\n\n\n\n\nOUR PRINCIPLES - Mocean Energy\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Navigation\n\n\nHOME\nABOUT\n\nOUR PRINCIPLES\nOUR TEAM\nPARTNERS\nTECHNOLOGY\nAWARDS & ACCREDITATIONS\n\n\nNEWS\n\nLATEST NEWS\nMOCEAN IN THE MEDIA\nDECOMMISSIONING PROGRAMME\n\n\nJOBS\nCONTACT\n\n\nHOME\nABOUT\n\nOUR PRINCIPLES\nOUR TEAM\nPARTNERS\nTECHNOLOGY\nAWARDS & ACCREDITATIONS\n\n\nNEWS\n\nLATEST NEWS\nMOCEAN IN THE MEDIA\nDECOMMISSIONING PROGRAMME\n\n\nJOBS\nCONTACT\n\n\n\n\n\n\n\n\n\nOur PrinciplesVision: People living in harmony with the ocean and each other through sustainable technology.\nMission: Mocean pioneers technology for harvesting energy from ocean waves using scientific insights, environmentally-informed engineering, and real-sea testing, to deliver reliable products that increase access to renewable energy for grid-connected and off-grid users, while respecting the natural environment.\nCulture: Mocean Energy is a purpose and values driven organisation with a focus on wellbeing, work life balance, diversity and inclusion. We are an Equal Opportunities and family friendly employer. We are committed to the Fair Work Convention's vision to have a world-leading, fair work driven and successful working life by 2025, built on effective voice, opportunity, security, fulfilment and respect.\nOur Values\nWe are PIONEERS. We forge our own path driven by our curiosity and vision.  We are willing to take bold and innovative steps.​​ \nWe TRUST each other. We build that trust within our team, likewise with our business partners and stakeholders, by our integrity and honest communication, especially when faced with challenges.​ \nWe are INCLUSIVE. We create a work environment where each and every person can bring their whole self, can be accepted, and can flourish.​ \nWe are GROUNDED. We continually and critically assess our progress. We support our goals with robust engineering, realistic roadmaps, sound financials, and successful project delivery. Health, Safety and EnvironmentThe Health and Safety of our staff, contractors and visitors is of paramount importance to us. We ensure that all of our offices, construction and operating sites have suitable health, welfare and wellbeing arrangements in place:\n\nRecognising the importance of good mental health and wellbeing and proactively consider the impact of work on the mental health of our team;\nFocusing on building a healthy working environment by developing a culture of openness and providing effective support when needed;\nUnderstanding the harsh operating environment of our technology and the complex nature of the assembly of our devices;\nDesigning out and managing risk, minimising the exposure to all personnel who may be affected by our projects;\nSelecting our staff and appointing competent contractors who have experience and specialised knowledge in the environments that we work in;\nEncouraging and promoting a safety culture that is continually improving and learning lessons from all areas of our activity;\nMinimising our impact on the environment and working closely with legislators and consenting bodies;\nWorking in an ecosystem that demands respect and aim to lead by example, minimising risk to the environment and setting standards of best practice;\nMinimising and managing all waste that may be generated by our works and consider the reuse and recycling of all materials used in our equipment.\n\nOur Health, Safety and Environment management systems have been developed and audited and are regularly reviewed and updated.\nWe also work with HydroSafe, who provide pragmatic advice and practical solutions to enhance our health and safety practices.Our Quality CommitmentMocean is committed to providing the highest quality products and services when designing, building and testing wave energy devices and we strive to be the best provider of wave energy converters.Based on our strongly defined Quality Policy, our principles include a commitment to quality, cost and schedule, developing our team through empowerment and accountability, and building solid and durable relationships with our stakeholders. We strive for continual improvement based on systematic research, risk management, efficient business processes and best practices, relying on well-defined measures and valuable customer feedback.Our objectives are set, managed and reviewed on a regular basis, maintaining a constant focus on quality with full dedication, commitment and teamwork.\nThrough the use of these guiding principles, everyone in Mocean is accountable for fully satisfying our customers and partners by meeting or exceeding their needs and expectations with best-in-class solutions and services.\n\n\n\n\n\n\nTerms of Use\nPrivacy Policy\nCookie Policy\n\n\n hello@mocean.energy     \n +44 (0)131 651 7959\n 10 Max Born Crescent, Edinburgh, EH9 3BF\n© Mocean Energy 2019\n    \n\n\n \n\n \n \nThis website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Cookie settingsACCEPTPrivacy & Cookies Policy\n\n\n\n\nClose\n\n\n\n\n\n\nPrivacy Overview \nThis website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are as essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. See our Cookie Policy for more info.\n\n \n\n\n\n\n\nNecessary\t\t\t\t\t\t\t\n\n\nNecessary\n\nAlways Enabled\n\n\n\n\nNecessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information.\t\t\t\t\t\t\t\t\n\n\n\n\n\n\nNon-necessary\t\t\t\t\t\t\t\n\n\nNon-necessary\n\n\n\n\n\nAny cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website.\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\nSAVE & ACCEPT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.mocean.energy/our-team/": "\n\n\n\n\n\n\n\nMocean Energy | Green energy Out of the Blue | Our Team\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Navigation\n\n\nHOME\nABOUT\n\nOUR PRINCIPLES\nOUR TEAM\nPARTNERS\nTECHNOLOGY\nAWARDS & ACCREDITATIONS\n\n\nNEWS\n\nLATEST NEWS\nMOCEAN IN THE MEDIA\nDECOMMISSIONING PROGRAMME\n\n\nJOBS\nCONTACT\n\n\nHOME\nABOUT\n\nOUR PRINCIPLES\nOUR TEAM\nPARTNERS\nTECHNOLOGY\nAWARDS & ACCREDITATIONS\n\n\nNEWS\n\nLATEST NEWS\nMOCEAN IN THE MEDIA\nDECOMMISSIONING PROGRAMME\n\n\nJOBS\nCONTACT\n\n\n\n\n\n\n\n\n\nAt Mocean Energy, our expertise, desire to learn, test and improve are central to the company’s ethos and success. We combine real-world experience with an inclusive, common sense business model to ensure the company adapts quickly and evolves to support its mission. Everyone at Mocean Energy brings energy, enthusiasm and ideas, to ensure that clear, logical thinking and pragmatic flexibility extend beyond our smart computational approach and pioneering product development.   Cameron McNatt    Cameron McNatt  Founder and Managing Director  READ MORE   Chris Retzler    Chris Retzler  Founder and Technical Director  READ MORE   Ian Crossland    Ian Crossland  Commercial Director  READ MORE   Catherine Bain    Catherine Bain  Finance Director  READ MORE   Jenny Young    Jenny Young  Head of Business Operations  READ MORE   Jay Parle    Jay Parle  Head of Engineering  READ MORE   Jon Clarke    Jon Clarke  Head of Projects  READ MORE   Yan Gunawardena    Yan Gunawardena  Head of Technical Operations  READ MORE   Gabriel Scarlett    Gabriel Scarlett  Head of Modelling and Testing  READ MORE   Alfred Cotten    Alfred Cotten  Head of Modelling and Testing  READ MORE   Gillian Fowler    Gillian Fowler  Head of Marketing & Communications  READ MORE   Mark Casson    Mark Casson  Financial Manager  READ MORE   Cinthia Medrado    Cinthia Medrado  QHSE Manager  READ MORE   Andrea Caio    Andrea Caio  Business Development Manager  READ MORE   Andrew Douglas    Andrew Douglas  Applications & Sales Engineer  READ MORE   Chris Zealand    Chris Zealand  Design Engineer  READ MORE   Andy Shanks    Andy Shanks  Project Manager  READ MORE   Alexandra Hussey    Alexandra Hussey  Project Manager  READ MORE   Mac Versey    Mac Versey  Research Engineer  READ MORE   Nian Liu    Nian Liu  Research Engineer  READ MORE   Rich Walker    Rich Walker  Test Engineer  READ MORE   Julie Le Négaret    Julie Le Négaret  Design Engineer  READ MORE   Timofei Averkiev    Timofei Averkiev  Numerical Modelling Assistant  READ MORE  \n\n\n\n\n\n\nTerms of Use\nPrivacy Policy\nCookie Policy\n\n\n hello@mocean.energy     \n +44 (0)131 651 7959\n 10 Max Born Crescent, Edinburgh, EH9 3BF\n© Mocean Energy 2019\n    \n\n\n \n\n \n \nThis website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Cookie settingsACCEPTPrivacy & Cookies Policy\n\n\n\n\nClose\n\n\n\n\n\n\nPrivacy Overview \nThis website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are as essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. See our Cookie Policy for more info.\n\n \n\n\n\n\n\nNecessary\t\t\t\t\t\t\t\n\n\nNecessary\n\nAlways Enabled\n\n\n\n\nNecessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information.\t\t\t\t\t\t\t\t\n\n\n\n\n\n\nNon-necessary\t\t\t\t\t\t\t\n\n\nNon-necessary\n\n\n\n\n\nAny cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website.\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\nSAVE & ACCEPT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.mocean.energy/mocean-energy-partners/": "\n\n\n\n\n\n\n\nWork with us | meet Mocean Energy partners\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Navigation\n\n\nHOME\nABOUT\n\nOUR PRINCIPLES\nOUR TEAM\nPARTNERS\nTECHNOLOGY\nAWARDS & ACCREDITATIONS\n\n\nNEWS\n\nLATEST NEWS\nMOCEAN IN THE MEDIA\nDECOMMISSIONING PROGRAMME\n\n\nJOBS\nCONTACT\n\n\nHOME\nABOUT\n\nOUR PRINCIPLES\nOUR TEAM\nPARTNERS\nTECHNOLOGY\nAWARDS & ACCREDITATIONS\n\n\nNEWS\n\nLATEST NEWS\nMOCEAN IN THE MEDIA\nDECOMMISSIONING PROGRAMME\n\n\nJOBS\nCONTACT\n\n\n\n\n\n\n\n\n\nPartnersAt Mocean Energy, we are proud to partner with leading industrial and research organisations in their field. Our business is built around rapid prototyping & testing. We believe a collaborative approach is the best means to accelerate the commercial development of wave energy technologies.Click any of the logos above to find out more about our partners.\n\n\n\n\n\n\nTerms of Use\nPrivacy Policy\nCookie Policy\n\n\n hello@mocean.energy     \n +44 (0)131 651 7959\n 10 Max Born Crescent, Edinburgh, EH9 3BF\n© Mocean Energy 2019\n    \n\n\n \n\n \n \nThis website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Cookie settingsACCEPTPrivacy & Cookies Policy\n\n\n\n\nClose\n\n\n\n\n\n\nPrivacy Overview \nThis website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are as essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. See our Cookie Policy for more info.\n\n \n\n\n\n\n\nNecessary\t\t\t\t\t\t\t\n\n\nNecessary\n\nAlways Enabled\n\n\n\n\nNecessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information.\t\t\t\t\t\t\t\t\n\n\n\n\n\n\nNon-necessary\t\t\t\t\t\t\t\n\n\nNon-necessary\n\n\n\n\n\nAny cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website.\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\nSAVE & ACCEPT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.mocean.energy/our-technology/": "\n\n\n\n\n\n\n\nMocean Energy | Our pioneering wave energy converter technology\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n Navigation\n\n\nHOME\nABOUT\n\nOUR PRINCIPLES\nOUR TEAM\nPARTNERS\nTECHNOLOGY\nAWARDS & ACCREDITATIONS\n\n\nNEWS\n\nLATEST NEWS\nMOCEAN IN THE MEDIA\nDECOMMISSIONING PROGRAMME\n\n\nJOBS\nCONTACT\n\n\nHOME\nABOUT\n\nOUR PRINCIPLES\nOUR TEAM\nPARTNERS\nTECHNOLOGY\nAWARDS & ACCREDITATIONS\n\n\nNEWS\n\nLATEST NEWS\nMOCEAN IN THE MEDIA\nDECOMMISSIONING PROGRAMME\n\n\nJOBS\nCONTACT\n\n\n\n\n\n\n\n\n\nTechnologyAt Mocean Energy our expert team combines scientific principles with real-world experience to deliver new technologies that can harness the power of waves and accelerate the transition to a zero-carbon world.\nWe are developing two wave energy technologies: (1) the Blue Star, a device that will power a range of subsea equipment, inspection and maintenance systems; and (2) the Blue Horizon, a larger machine designed to generate grid-scale electricity.\nBoth technologies are based on the same concept – a hinged raft with a unique geometry that improves performance by up to 300 percent compared to traditional hinged rafts and increases survivability by diving through the largest waves.\nWith funding support from Wave Energy Scotland, Mocean constructed our prototype – the Blue X  – for  testing our hinged-raft design in real sea conditions.Blue StarOur Blue Star wave energy converter will provide reliable, renewable power for a range of subsea applications – from control systems, to ROVs, to fully autonomous underwater vehicles. Its compact design fits in 40 foot shipping containers, and uses magnetic-geared power to charge onboard batteries, providing continual power.\nIn spring 2021, Mocean Energy entered a collaborative initiative to demonstrate how wave energy coupled with underwater energy storage can power subsea equipment. Net Zero Technology Centre provided grant funding, matched by financial and in-kind contributions from other partners, including Harbour Energy, Transmark, Serica Energy, Baker Hughes, and energy storage developers Verlume.Blue HorizonWe are also developing a much larger hinged-raft wave energy converter – the Blue Horizon – based on the same principles as the Blue Star.\nThe Blue Horizon is our utility-scale machine, designed for deployment in wave farms off the coast to deliver reliable, green energy to transmission networks around the world.\nWe didn’t design Blue Horizon simply by making the Blue Star bigger. We captured the requirements and used our optimisation strategies to maximise power generation while minimising cost and keeping within constraints of the commercial application.Blue XIn January 2019, Wave Energy Scotland selected Mocean’s design as one of the industry’s most promising concepts – awarding  Mocean with £3.3 million.\nThe support from Wave Energy Scotland enabled Mocean to develop the Blue X – a prototype model for extensive testing in real sea conditions. In spring 2021, Mocean shipped the Blue X to the European Marine Energy Centre (EMEC) in Orkney, the world’s first and leading open-sea test facility for wave and tidal energy devices. Installed at EMEC’s Scapa Flow test site, the Blue X is generating power – a major Mocean milestone – as well as tremendous data on machine performance and operation seen over the summer months.\n\n\n\n\n\n\n\nTerms of Use\nPrivacy Policy\nCookie Policy\n\n\n hello@mocean.energy     \n +44 (0)131 651 7959\n 10 Max Born Crescent, Edinburgh, EH9 3BF\n© Mocean Energy 2019\n    \n\n\n \n\n \n \nThis website uses cookies to improve your experience. We'll assume you're ok with this, but you can opt-out if you wish. Cookie settingsACCEPTPrivacy & Cookies Policy\n\n\n\n\nClose\n\n\n\n\n\n\nPrivacy Overview \nThis website uses cookies to improve your experience while you navigate through the website. Out of these cookies, the cookies that are categorized as necessary are stored on your browser as they are as essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may have an effect on your browsing experience. See our Cookie Policy for more info.\n\n \n\n\n\n\n\nNecessary\t\t\t\t\t\t\t\n\n\nNecessary\n\nAlways Enabled\n\n\n\n\nNecessary cookies are absolutely essential for the website to function properly. This category only includes cookies that ensures basic functionalities and security features of the website. These cookies do not store any personal information.\t\t\t\t\t\t\t\t\n\n\n\n\n\n\nNon-necessary\t\t\t\t\t\t\t\n\n\nNon-necessary\n\n\n\n\n\nAny cookies that may not be particularly necessary for the website to function and is used specifically to collect user personal data via analytics, ads, other embedded contents are termed as non-necessary cookies. It is mandatory to procure user consent prior to running these cookies on your website.\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\nSAVE & ACCEPT\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}]}