{"text": [{"https://www.northstarcleantech.com": "Northstar Clean Technologies\n\n\n \n\n\n\n\n\nHomeAbout UsAbout NorthstarManagementBoard of DirectorsCorporate GovernanceCorporate DirectoryOur SolutionMarket OverviewOur TechnologyIntellectual PropertyEnvironmentalIndustry referencesOperationsCalgary Scale UpEmpower Pilot FacilityUS ExpansionInvestorsHighlightsFinancialsCapital StructureAGM MaterialsStock ChartInvestor PresentationInvestor PresentationFact SheetFact SheetPhotos + MediaAbout NorthstarLeadership TeamMarket OverviewOur SolutionOur FacilitiesInvestor CentreNewsContact UsSUBSCRIBE Canadian clean technology company focused on the sustainable recovery and reprocessing of asphalt shingles.Environmentally-friendly reprocessing solution for single-use asphalt shingles.Developed a proprietary design process technology to break down the components of asphalt shingles. US$1.35bn market in Canada and US$7bn market in the US with limited proven  alternatives.Fully constructed Empower Pilot Facility in Delta, BC with steady state production initiated in Q1 2022.Current macro and political environment supportive of circular economy options. Phase 1 Expansion Program planned for Calgary, Toronto and Pacific Northwest, USA.Significant  operational, sustainability, commercial and capital markets expertise.Secured 100% Off-Take of Asphalt Production for 5 Years from Calgary FacilityFive Stream Revenue Model: Inputs (Tipping Fees), Outputs (x3), and Carbon Credits.60% CO2e Savings from both Delta and Calgary FacilitiesLow Capex Facility, with Modular Roll-out Business ModellandscapeAbout NorthstarecoClean Technologydesign_servicesProprietary Designauto_graphMarket Opportunitymonetization_onFully Constructed Facilityshare_locationSupportive Environmentshow_chartExpansion OpportunitiesgroupsLeadership Expertise100% Off-Take Partner5-Stream Revenue Model60% CO2e SavingsLow Capex FacilityInvestor PresentationInvestor PresentationFact SheetFact SheetPress ReleasesLatest news from Northstar Clean Technologies.Northstar Receives Canadian Patent for Asphalt Shingle Reprocessing TechnologyJuly 15, 2024View ReleasePDFNorthstar Closes Strategic Investment of C$2.25 Million from Two Calgary-Based Strategic Investors and Appoints Mr. Patrick Chiu to Board of Directors June 27, 2024View ReleasePDFNorthstar Announces Participation in the 2024 Canadian Climate Investor Conference and 2024 AGSM ResultsJune 20, 2024View ReleasePDFNorthstar Reports First Quarter 2024 Financial ResultsMay 31, 2024View ReleasePDFNorthstar Announces Acceleration and Closing of TAMKO’s US$1.8 Million Convertible Debenture and Addition of Fourth Facility to U.S. Development PlanMay 28, 2024View ReleasePDFNorthstar Receives Canadian Patent for Asphalt Shingle Reprocessing TechnologyJuly 15, 2024View ReleasePDFNorthstar Closes Strategic Investment of C$2.25 Million from Two Calgary-Based Strategic Investors and Appoints Mr. Patrick Chiu to Board of Directors June 27, 2024View ReleasePDFNorthstar Announces Participation in the 2024 Canadian Climate Investor Conference and 2024 AGSM ResultsJune 20, 2024View ReleasePDFNorthstar Reports First Quarter 2024 Financial ResultsMay 31, 2024View ReleasePDFNorthstar Announces Acceleration and Closing of TAMKO’s US$1.8 Million Convertible Debenture and Addition of Fourth Facility to U.S. Development PlanMay 28, 2024View ReleasePDFNorthstar Issued Second Patent by United States Patent & Trademark Office and Amends Stock OptionsMay 15, 2024View ReleasePDFNorthstar Receives First Long-Lead Equipment Item at Empower Calgary FacilityApril 30, 2024View ReleasePDFNorthstar Announces 2023 Financial ResultsApril 29, 2024View ReleasePDFVIEW ALL RELEASESFeatured VideoWatch the latest from Northstar Clean Technologies.\n\nView More MediaTweets by NStarCleanTech Providing the construction industry with clean, sustainable processing solutions.About NorthstarSee Our SolutionOur LocationsLearn more about Northstar's current and planned asphalt shingle reprocessing facilities.Calgary Scale Upfmd_goodCalgary, AB, CanadainfoNear-Term ConstructionEmpower Pilot Facilityfmd_goodDelta, British ColumbiainfoR&D and Testing FacilityUS Expansionfmd_goodUnited StatesinfoPlanning PhaseNorthstar Clean TechnologiesInvestorsHomeAbout NorthstarOur SolutionContact UsRecent Press ReleasesNorthstar Receives Canadian Patent for Asphalt Shingle Reprocessing TechnologyJuly 15, 2024Northstar Closes Strategic Investment of C$2.25 Million from Two Calgary-Based Strategic Investors and Appoints Mr. Patrick Chiu to Board of Directors June 27, 2024Northstar Announces Participation in the 2024 Canadian Climate Investor Conference and 2024 AGSM ResultsJune 20, 2024Northstar Clean Technologies Inc.7046 Brown StreetDelta, BC, V4G 1G8W: 604.946.0019Follow us on LinkedInFollow us on TwitterInvestor RelationsW: 604.684.6730TF: 866.684.6730E: roof@kincommunications.com\n\n©2022 Northstar Clean Technologies | Disclaimer | Privacy Policy\n\n\n\nMarket Data powered by QuoteMedia. Terms of Use.\n\n"}]}