{"text": [{"https://persistent.energy": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe build impact ventures - Persistent - Home\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbout Us\n\nTeam\nInvestors\nCareers\n\n\nWhat We Do\n\nInvestments\nVenture Building\nImpact\nFAQ\n\n\nPortfolio Companies\nThought Leadership\n\nPublications\nNews\nPersistent Stories\n\n\nContact\n \n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nAfrica's Climate Venture Builder\n\n\n\n                We believe in the power of climate neutral  economic development in Africa. For the last decade, we have been working hand in hand with exceptional entrepreneurs, investing both financial and human capital to build successful climate ventures on the continent. Our companies offer competitive financial returns required to drive lasting impact. \r\n            \n\n\n                What We Do            \n\n\n\n\n \n\n\n\n\n \n\n6408180\n\nlives improved by persistent partner companies\n\n\n\n \n\n200%+\n\naverage portfolio growth rate since investment\n\n\n\n \n\n21662\n\njobs created by persistent partner companies\n\n\n\n \n\n1375013\n\ntotal tons of CO2 Avoided overall\n\n\n\n \n\nAbout Us\n\n\n\nFounded in 2010, Persistent is Africa’s Climate Venture Builder and a leading investor. We provide essential support including finance, strategic guidance, governance, technical and legal expertise to early-stage companies committed to creating sustainable impact. Our Venture Builders actively engage in and contribute to these ventures, particularly in emerging markets where such support is crucial at the early stages.\n\n\n\n\nLearn More\n\n\n\n\nOur Portfolio Companies\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n \n\r\n            Portfolio Companies        \n\n\n\nThought Leadership\n\n\nFeatured Articles\nView All\n\n\n\n\n\n\n\n\n\n\n\nPersistent in Lagos\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\nSolarWorks! concludes recapitalization with leading investors EDP and Persistent\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\nIs it Time for a Solar Receivable FinCo?\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\nTestimonials\n \n\n\n\n\n\nPartnering with Persistent has been transformative for Altech. The financial solutions and dedicated support have significantly enhanced our operational efficiency, innovation and driven measurable growth. We highly value and appreciate our collaboration with Persistent.\n\nAltech\nWashikala Malango, CO-Founder and CEO\nDRC\n\n\n\n\n\nPersistent has been a key player in Rensource’s development, helping us establish our legal and tax structure, refine our growth strategy and develop critical IT systems. They are on the cutting edge of the sector, extremely knowledgeable and always generous with their assistance.\n\nRensource\nAdemola Adesina, Founder & CEO\nNigeria\n\n\n\n\n\nPersistent supported us  when we were struggling to close our Series A, and have since helped us to build a far stronger company. The Persistent team is engaged in the strategic and day-to-day operations of the company. Persistent’s support covers corporate structuring, Interim CFO services, international expansion strategy, portfolio management to logistics, etc. I recommend them as highly as I can to other founders and potential partners. They are genuine in their impact mission and experienced enough to support companies across the energy sector.\n\ncandi\nPhilippe Flamand, Commercial Director\nSouth Africa\n\n\n\n\n\nPersistent has played a crucial role in the growth and development of Ecobodaa over the last three years. Their venture-building services have provided us with experienced CFO and legal support, enabling us to establish efficient financial reporting and ensure compliance. Persistent's introduction to other investors and grant institutions has greatly assisted our fundraising endeavors. It is worth noting that Persistent goes beyond being a mere investor; they have invested time and effort to truly comprehend the intricacies of investing in Africa and how to navigate it successfully.\n\nEcobodaa\nKim Chepkoit, Co-Founder\nKenya\n\n\n\n\n\nPersistent has been a real partner for us. One of the most valuable services they have provided is an interim CFO who helped bring our reporting and modelling to a level that was reliable and robust for third party investors. The Interim CFO worked side-by-side with us to bring in a new strategic equity investor. Persistent’s work has literally changed our lives as a company and therefore will change hundreds of thousands of lives in Africa as we accelerate our expansion.\n\nSolarWorks!\nArnoud de Vroomen, Co-Founder and CEO\nMozambique\n\n\n\n\n\nPersistent has been a part of candi's story from the word go. Without its support in these early stages it's fair to say that we may never have seen the light of day. From there, Persistent has not only continued to provide capital at critical times, it has brought in relevant expertise to fill important gaps, as well as connecting the dots within its extensive network to allow candi to grow its capital base.\n\nupOwa\nKillien de Renty, CEO \nCameroon\n\n\n\n\n\nPartnering with Persistent has been transformative for Altech. The financial solutions and dedicated support have significantly enhanced our operational efficiency, innovation and driven measurable growth. We highly value and appreciate our collaboration with Persistent.\n\nBBOXX\nMansoor Hamayun, CEO & Founder\nKenya\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAfrica's Climate Venture Builder\n\n\n\n\n\n\nSubscribe to the latest news\n\n\nEmail Address\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPersistent Kenya\n1st Floor, Ushuru Pension Plaza\r\nMuthangari Drive, Off Waiyaki Way, Nairobi\r\nP.O. Box 66488-00800\r\nNairobi, Kenya\nTel: +254(0)727144842\n\n\n\n\nPersistent Switzerland\nBirmensdorferstrasse 94\r\n8003 Zurich \r\nSwitzerland\n\n\n\n\nPersistent USA\nNew York, New York 10025 \n\n\n\n\n\n\nAbout Us\n\nTeam\nInvestors\nCareers\n\n\nExplore\n\nWhat We Do\nPortfolio Companies\n\n\nContact\n\nGet in touch\n\n\nLegal\n\nPrivacy Policy\nCookies\n\n\nFollow\n\nTwitter\nLinkedIn\n\n\nNews\nPublications\n \n\n© 2024 Persistent. All Rights Reserved.\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://persistent.energy/about-us/": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbout Us - Persistent - Leading experts and pioneer investors\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbout Us\n\nTeam\nInvestors\nCareers\n\n\nWhat We Do\n\nInvestments\nVenture Building\nImpact\nFAQ\n\n\nPortfolio Companies\nThought Leadership\n\nPublications\nNews\nPersistent Stories\n\n\nContact\n \n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\nAbout Us\n \n\n\nAt Persistent, we believe that climate change is the most pressing challenge of our time. That is why we invest in early-stage climate focused companies that are actively developing and implementing climate change mitigation and transition with a focus on Energy Transition, Resource Transition and Agricultural Transition. We believe that these companies have the power to create a more sustainable Africa through our financial and human capital support.\nFor over a decade, we have invested in Clean Energy Solutions, Sustainable Transportation, Energy Efficiency and other climate focused ventures. Our investment philosophy is simple: We invest in companies that have the potential to generate strong financial returns while also making a positive impact on the African continent.\nWith our Venture Builder model, Persistent is more than just an investment firm. We are a community of entrepreneurs, investors and experts who are passionate about building a sustainable Africa. Headquartered in Nairobi, Persistent is a diverse team of 23 professionals from 11 countries with team members located in Lagos, Dakar, Goma, Kampala, New York, and Zurich.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                          Meet The Persistent Team                                      \n\n                                          The people that make it happen                                      \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n                                          Would you like to make an impact?                                      \n\n                                          We're always on the lookout for more people                                      \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\nOur Investors\n\n\n\nPersistent is supported by highly committed investors seeking both climate and economic impact and commercial returns. Our investors include high net worth individuals, family offices, foundations, international development organizations, as well as our current and former Persistent team.\nWhy invest in Persistent?\n\nReturns: Our commitment extends to delivering robust financial returns while achieving meaningful impact.\nImpact: We invest in climate focused companies actively working on low-carbon solutions for a sustainable Africa.\nVenture building: Led by experienced entrepreneurs and investors, our team is dedicated to building companies that possess the ability to stimulate further investments, generate significant climate and economic impact and achieve scalability.\n\nIf you are interested in knowing more about becoming an investor in Persistent, please contact us.\n\n\n\n\nGet In Touch\n\n\n\n\n\n \n\n\n                                  Kyuden Group                              \n\nEstablished in 1951, Kyushu Electric Power Company and its affiliates (“Kyuden Group”) has supported the lives and business development of people in Kyushu region, acting as an integrated energy company performing fuel supply, power generation / transformation / transmission / distribution and electricity retailing. Kyuden International Corporation is the overseas business arm of Kyuden Group. Utilizing the technologies and know-how of the Kyuden Group, the company will steadily promote the development of renewable energy in Japan and overseas to contribute to the realization of carbon neutrality. The aim is to be a corporate group that can lead the change toward the decarbonization from Kyushu in Japan.\n\n\n\n\n\n\n\n \n\n\n                                  Shell Foundation                              \n\nShell Foundation is an independent UK-registered charity established by the Shell Group in 2000 to create and scale new solutions to global development challenges. They apply business thinking to major social and environmental issues linked to the energy sector, and seek to leverage the skills and networks of Shell where possible to deliver greater development impact.\n\n\n\n\n\n\n\n \n\n\n                                  FSD Africa Investments                              \n\nFSD Africa Investments is the investment arm of FSD Africa. We provide early-stage, risk-bearing capital to inventive financial organisations that permit more capital to flow for green economic growth benefiting people and the planet. As a catalytic investor, we seek out ambitious financial ventures with the potential to test and drive innovative models and products that can address gaps in Africa’s financial market. We use a range of investment instruments designed fit for purpose to take the early-stage commercial risk, drive high market development impact, and a financial return on investment.\n\n\n\n\n\n\n\n \n\n\n                                  Dream Project Incubators                              \n\nDream Project Incubators (DPI) is a development/investment firm focusing on utility-scale solar and off-grid and microgrid renewable energy projects, especially where no electricity access is available, leveraging its ability to deploy early risk capital, financing and technological expertise, relationships in the region, agility of decision making and project execution. DPI is delighted to support startups and investment firms, which are dedicated to creating better places on this planet.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAfrica's Climate Venture Builder\n\n\n\n\n\n\nSubscribe to the latest news\n\n\nEmail Address\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPersistent Kenya\n1st Floor, Ushuru Pension Plaza\r\nMuthangari Drive, Off Waiyaki Way, Nairobi\r\nP.O. Box 66488-00800\r\nNairobi, Kenya\nTel: +254(0)727144842\n\n\n\n\nPersistent Switzerland\nBirmensdorferstrasse 94\r\n8003 Zurich \r\nSwitzerland\n\n\n\n\nPersistent USA\nNew York, New York 10025 \n\n\n\n\n\n\nAbout Us\n\nTeam\nInvestors\nCareers\n\n\nExplore\n\nWhat We Do\nPortfolio Companies\n\n\nContact\n\nGet in touch\n\n\nLegal\n\nPrivacy Policy\nCookies\n\n\nFollow\n\nTwitter\nLinkedIn\n\n\nNews\nPublications\n \n\n© 2024 Persistent. All Rights Reserved.\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://persistent.energy/about-us/team/": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPersistent - Team\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbout Us\n\nTeam\nInvestors\nCareers\n\n\nWhat We Do\n\nInvestments\nVenture Building\nImpact\nFAQ\n\n\nPortfolio Companies\nThought Leadership\n\nPublications\nNews\nPersistent Stories\n\n\nContact\n \n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\nAbout Us\n\n\nTeam\n\n\n\n\nTeam\n \n\n\n\n\nLearn more about Tobias Ruckstuhl\n\n\nTobias Ruckstuhl\nManaging Partner                                                                                                                            \n\n                        Tobias Ruckstuhl is the Managing Partner of Persistent. Tobias has significant experience in investing and building companies in frontier markets, with over 10 years background of living and working in Sub-Saharan Africa. He has held CFO positions and serves as Board member in several Climate start-up companies. Prior to joining Persistent he was an entrepreneur in Central Africa and worked in management consulting (strategy & IT) at Accenture in Switzerland. Tobias holds a Masters in International Affairs from the University of St. Gallen as well as a Bachelor's in business & economics. He is also a Certified Management Accountant (CMA) charter holder.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Wairimu Karanja\n\n\nWairimu Karanja\nPartner                                                                                                                            \n\n                        Wairimu Karanja is a Partner at Persistent. She is based in Nairobi and manages the corporate, legal, ESG and compliance matters at Persistent. She also works with the investment teams and supports entrepreneurs with venture building advice.\r\nWairimu has 15 years’ legal experience in leading international firms, working on climate, energy, infrastructure, private equity, M&A and corporate law in Africa. She is also a Council Member of the ICC Institute of World Business Law.\r\nOff-duty, Wairimu is a nature lover, hiker, runner and bookworm. She loves anything with an African print.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Chris Aidun\n\n\nChris Aidun\nPartner                                                                                                                                                                Co-founder                                                                                                            Director of the Board                                                                        \n\n                        Chris Aidun is a co-founder and Partner at Persistent. Chris has over 30 years of experience in venture capital, private equity and finance law. Prior to founding Persistent Energy, he was Managing Director of E+Co, a non-profit clean energy impact investor where he led a financial restructuring that returned significantly more than expected to E+Co creditors. Prior to E+Co, Chris was a senior private equity partner at the international law firm of Weil, Gotshal & Manges LLP. Chris manages corporate structure, legal and tax matters for Persistent and its partner companies.  Chris is a US trained lawyer with a JD from New York University School of Law and a BS in Economics from the University at Albany.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Toukam Ngoufanke\n\n\nToukam Ngoufanke\nPartner                                                                                                                            \n\n                        Toukam is a Partner at Persistent. He helps drive investing and venture building efforts across Sub-Saharan Africa (SSA). Previously, Toukam held various roles at Mastercard in both New York and SSA: from M&A and global corporate strategy work in New York; to running Mastercard's consulting business in SSA; driving business and product strategy in East Africa including launching and running a corporate startups serving low-income users since absorbed into Mastercard's social enterprise unit; and driving business development and sales for Mastercard's social enterprise unit. Prior to Mastercard ,Toukam worked at KPMG in Chicago. Toukam holds MBA and MA degrees from the University of Pennsylvania's Wharton School and Lauder Institute, respectively; an MSc Engineering degree from the Northwestern University; and combined-plan bachelor degrees from Columbia University and DePauw University.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Eva Maria Stolz\n\n\nEva Maria Stolz\nVenture Builder                                                                                                                            \n\n                        Eva Maria Stolz is a Venture Builder at Persistent, serving as an interim CFO for some of our portfolio companies and also as the Treasurer of GOGLA since 2020. Before joining Persistent, she worked as a Consultant at Bain & Company, conducting due diligence for PE funds and advising clients on a range of topics, including strategy, performance improvement and organizational development. She gained first working experience in Africa during her time at a microcredit organization in Uganda, where she supported the launch of a micro venture capital arm. Eva holds a Masters in International Management from Bocconi University in Milan and FGV in São Paulo.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Peter Huisman\n\n\nPeter Huisman\nTech Venture Builder                                                                                                                            \n\n                        As Venture Builder with a focus on technology Peter works with portfolio and partner companies on technology related issues such as business IT and product hardware. During due diligence of potential investment opportunities Peter assesses the technology landscape and ensures investment decisions are well understood from a technology perspective. Peter stays on top of the latest technology trends and sees how these are or might become relevant for Persistent. Peter has worked and lived in SSA for the last 14 years. After several tech related volunteering positions Peter co-founded SolarNow, one of the first generation solar PAYGO companies in 2011 where he worked until 2020 as a CTO predominantly in business administration, IT, product development and sourcing. In 2020 he started a new agritech business in aquaponics which he combines with his role at Persistent. Peter, who has a MSc in Electrical Engineering from University of Twente, has broad experience setting up and running a business in East Africa with a strong focus on Technology.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Thomas Gallas\n\n\nThomas Gallas\nVenture Builder                                                                                                                            \n\n                        Thomas is a Principal at Persistent. He works on implementing the mandate of the CEI Africa Foundation through co-investing with crowdfunding platforms  in off-grid energy and mini-grids. He holds a M.Sc. in Environment and Resource management from VU-University Amsterdam and a B.A. from Amsterdam University College. \r\nPreviously Thomas worked in the private equity energy team at FMO, managing PE-fund and direct investments in the renewable energy sector across emerging markets, with a particular focus on off-grid energy. Prior to FMO, Thomas worked at Pymwymic, an impact VC, where he invested in several early-stage sustainable startups in Europe and Africa. \r\n                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Jessica Stephens\n\n\nJessica Stephens\nBusiness Development                                                                                                                            \n\n                        Jessica is a Director of Business Development at Persistent. She is an entrepreneur, renewable energy and off-grid policy expert with more than 15 years of experience working across Africa, establishing and running businesses. Helping both the private and public sector develop strategic growth and policy initiatives while ensuring collaboration between stakeholders. She has been tackling the energy access challenge in Africa in order to create an innovative, decentralized, renewable energy solutions for the under & un-electrified.                     \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Vincent Kienzler\n\n\nVincent Kienzler\nLead Tech Venture Builder                                                                                                                            \n\n                        As Lead Technology Venture Builder, Vincent works together with Persistent partner companies to solve their technology-related challenges, develop their technology vision and strategy and build their capacity in software development, IT & cyber security, and product hardware. During the due diligence of potential investments, Vincent and his team assess the maturity of the company’s tech stack, the value of its IP, and ensure that technology risks and opportunities are well understood by the investment team.\r\nVincent has worked and lived in Sub-Saharan Africa for the last 12 years. He co-founded two companies in the tech and energy sector, worked with the World Bank as a private-sector development consultant and held several technology leadership positions, as Managing Director and Chief Technology Officer.\r\nA passionate and avid learner, Vincent trained as an Engineer and Economist. He holds Master degrees in Computer Science (ENSTA), Economics (Science-Po Paris) and Philosophy (Sorbonne University). He also holds an Mphil in Development Studies (London School of Economics) and a PhD in Management Sciences.\r\n                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Manuela Böck\n\n\nManuela Böck\nVenture Builder                                                                                                                            \n\n                        Manuela is a Venture Builder at Persistent. Prior to joining the firm, she completed internships with Deutsche Bank Structured Commodity Trade Finance team and worked as a summer analyst for HSBC`s investment banking division. She gained first working experience on the African market during her time with DGP Advisory in Nairobi, Kenya. Manuela holds a master’s degree in International Finance from Nova SBE and a bachelor’s degree in Management and Business with a Finance Minor from the Amsterdam University of Applied Sciences.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Faith Wilson\n\n\nFaith Wilson\nVenture Builder                                                                                                                            \n\n                        Faith is a Venture Builder at Persistent, working as an Investment Associate and Venture Advisor focused on identifying and evaluating investments, as well as offering venture building support to companies across Sub-Saharan Africa (SSA). She holds a first-class honors degree in Economics and holds a Master of Science in Finance from the University of Nairobi. She is also a Certified Public Accountant. Faith has over 5 year’s progressive experience in consulting and advisory services. Prior to joining Persistent, she was an Investment Analyst with Africa Enterprise Challenge Fund (AECF) – where she was involved in providing investment readiness and facilitation services to SMEs in Renewable Energy and Agribusiness. Prior to AECF, Faith worked at KPMG East Africa as a Senior Accounting Advisor in the Consulting unit, focusing on SME advisory, financial analysis, and due diligence. \r\n\r\n                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Magdalena Herman\n\n\nMagdalena Herman\nData Consultant & IT Solutions Engineer                                                                                                                            \n\n                        Magdalena has broad experience across a variety of applications and IT set-ups, including inventory management, call centre software, CRM and more. She has worked on IT systems implementation, mobile apps configuration as well as data related projects with a variety of organizations across 3 continents with the main focus on Africa.\r\n\r\nShe holds a MSc in Information Systems from the University of Lausanne. After graduating, she has worked as a technology consultant on IT implementation projects in international banks. Before Persistent, she has worked 4 years for Enable.digital, a consultancy offering flexible, future-proof, digital technology and data management solutions to clients in emerging markets providing essential goods and services for their customers in sectors such as Agriculture, Energy, Mobility and Waste. She has been part of Enable's journey developing a custom loan account management tool (LAMT) for the PAYGO solar distribution companies. \r\n\r\nAt Persistent, she has been focusing on data management, developing solutions as well as assessing the quality and usability of data in organizations, performing evaluations of technology set-ups of investees and supporting them in increasing the automation and scalability of their application networks.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Nnenna Chukwurah\n\n\nNnenna Chukwurah\nVenture Builder                                                                                                                            \n\n                        Nnenna is a Venture Builder at Persistent based in Nigeria. She helps implement the mandate of the CEI Africa Foundation through co-investing with crowdfunding platforms in off-grid energy. Prior to joining Persistent, she worked at the Nigerian Sovereign Wealth Fund as a special adviser to the MD/CEO on technology and innovation, focused on executing digital infrastructure, healthcare, gas and heavy industries projects. Prior to the SWF, She worked at Sahel Capital facilitating the deployment of over USD10 million in various food and agribusiness-focused MSMEs across West Africa. She holds an MSc. in Energy Finance (Distinction) from the Centre for Petroleum and Mineral Law & Policy (CEPMLP) at the University of Dundee.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Joy Rukundo\n\n\nJoy Rukundo\nMarketing & Communication Manager                                                                                                                            \n\n                        Joy is a Marketing and Communication Manager at Persistent. She is responsible for our internal and external communication as well as brand and design perspectives and Event Management. Joy holds a Bachelor of Arts from the Macromedia University of Applied Science in Munich, where she studied Media Management with a special focus on Brand Communication and Advertising. In 2011 she founded a non-governmental organization,  focusing on child education and entrepreneurial projects. Before joining Persistent she worked for a German advertising agency, as well as a freelancer on several design and web content projects in Kenya and Germany. \r\n                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Great Eluehike\n\n\nGreat Eluehike\nInvestment Associate                                                                                                                            \n\n                        Great is an investment professional with Persistent working on the implementation of the CEI Africa Foundation and also supporting on other venture building and advisory work. He has over 5 years working experience in audit, advisory and investment roles with BDO Professional services, PwC Nigeria and British International Investment. During time in PwC he was a senior associate with the team executing corporate finance and transaction due diligence mandates across several sectors including energy, oil and gas and consumer goods. He was also an investment associate with British International Investment with the venture capital team deploying funds and executing co-investment mandates in emerging markets. \r\nHe is a graduate of Accounting from Covenant University and is also an Associate Chartered Accountant and Chartered Financial Analyst (CFA) holder.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about James Wambua\n\n\nJames Wambua\nInvestment Associate                                                                                                                            \n\n                        James is an Investment Associate at Persistent. He works on Persistent’s mandate in the US$ 125m Energy Entrepreneurs Growth Fund (EEGF), a fund tailored to early and growth-stage companies in the access to energy ecosystem in Sub-Saharan Africa. He earned a Bachelor of Commerce degree with a major in Finance from the University of Nairobi and is a Chartered Financial Analyst (CFA) Charterholder. He has over seven years of experience in transaction advisory, project finance and corporate finance in industries such as Distributed Renewable Energy, Utility-scale Renewable Energy, manufacturing, retail, logistics, real estate, and technology. Before joining Persistent, he worked for Berkeley Energy, a renewable energy fund manager and developer focused on Sub-Saharan Africa and Asia emerging markets; E3 capital, an early-stage fund focusing on climate transition and digital connectivity; and InVhestia Africa, a boutique project finance and corporate finance advisory firm.\r\n                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Yewande Oyewole\n\n\nYewande Oyewole\nSenior Investment Analyst                                                                                                                            \n\n                        Yewande is a Venture Builder at Persistent, helping to implement the mandate of the CEI\r\nAfrica Foundation. She holds a Bachelor's degree in Economics from the University of Lagos\r\nand is a Chartered Financial Analyst (CFA) charterholder. Yewande has over five years of\r\nexperience spanning consulting and impact investment. Prior to joining Persistent, she was an\r\nInvestment Analyst with All On Partnerships for Energy Access Limited by Guarantee (All On),\r\nwhere she was responsible for deal sourcing, due diligence, and portfolio management. Prior\r\nto All On, Yewande worked at Fritova International Limited as a Senior Associate in the Project\r\nFinance Unit, where she provided innovative solutions and insights to satisfy client needs in\r\ndifferent industries, including energy, healthcare, manufacturing, and real estate sectors.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Nahashon Nyaga Mwangi\n\n\nNahashon Nyaga Mwangi\nSenior Investment Analyst                                                                                                                            \n\n                        Nahashon is a Senior Investment Analyst at Persistent and works with the investment team to identify and evaluate new investment opportunities. He provides support on ongoing portfolio management and fundraising efforts, while also contributing to research on the climate-positive sector in Sub-Saharan Africa.\r\nNahashon has a bachelor’s degree in Financial Engineering.\r\nPrior to joining Persistent, he worked at Pearl Capital Partners, a specialized agriculture investment firm focusing on small and medium-sized East African agribusinesses. His responsibilities included supporting due diligence and screening for potential deals, financial modeling, co-authoring investment memos, and portfolio management. Additionally, Nahashon spearheaded the development of semi-annual ESG and impact reports.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Léa Bouguern\n\n\nLéa Bouguern\nVenture Builder                                                                                                                            \n\n                        Léa is a Venture Builder at Persistent. Before joining the firm, she completed internships in investment banking at BNP Paribas as a merger & acquisition analyst in the Energy, Natural Resources, Infrastructure, and Transport (ENRIT) team, and at Natixis as a credit analyst as well as in the syndication division of the bank. Léa holds a master's degree from the Magistère Finance de La Sorbonne (corporate finance and market finance over three years education) and a master's degree in financial engineering from La Sorbonne University.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Serge Musingilwa\n\n\nSerge Musingilwa\nVenture Builder                                                                                                                            \n\n                        Serge is a Venture Builder at Persistent, working as an analyst on diverse partner projects as well as on pipeline efforts.\r\nHe holds a Bachelor of Commerce degree in Finance from the Catholic University of Eastern Africa, is an affiliate of the Association of Chartered Certified Accountants (ACCA), and is currently pursuing a Master’s of Commerce in Finance at the Strathmore Business School. Serge has worked on research projects into new investment areas with high potential in Africa. Before joining Persistent, he worked as an intern for the United Nations Food and Agriculture Organization (UNFAO) in the D.R. Congo and co-founded the Congo Youth Entrepreneurship Forum, a platform aiming to provide business management skills to young Congolese entrepreneurs. Serge is fluent in French, English, and Kiswahili.\r\n                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Clara Li\n\n\nClara Li\nVenture Builder                                                                                                                            \n\n                        Clara is a Venture Builder at Persistent supporting pipeline management and evaluating investment opportunities in the Resources Transition and Agricultural Transition sectors across Sub-Saharan Africa. She has over three years of experience across the energy access and consulting spaces. Previously, she worked for Easy Solar’s sales and operations and carbon finance teams, where she was responsible for evaluating sales performance trends and assessing opportunities to develop carbon revenue streams. Prior to Easy Solar, Clara worked at IBM’s Salesforce practice as a Solution Consultant focusing on cloud implementations for healthcare and life sciences clients. Clara holds a graduate degree in International Relations from Columbia University and undergraduate degree in Public Policy from the University of Michigan. Outside of work, you can find her taking dance classes and exploring hiking spots across Kenya.\r\n                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Yvette Akoth\n\n\nYvette Akoth\nLegal Associate                                                                                                                            \n\n                        Yvette Akoth is a Legal Associate at Persistent and based in Nairobi. She is an international lawyer qualified in Kenya, with eight years of legal experience. Yvette has extensively advised established companies, impactful start-up ventures, social enterprises and governmental organizations and institutions on various projects in Africa relating to Financial Technology & Services, Employment Law, Capital Markets, Mergers & Acquisitions (M&A), Intellectual Property & Trademarks, Legal Technology, Electric Mobility (E-Mobility), Project Finance, Energy, Public Private Partnerships (PPPs), Infrastructure & Projects and Environmental & Social Governance (ESG). She is a member of the Law Society of Kenya (LSK) and the East Africa Law Society (EALS). Yvette is a mentor with the Fleischer Foundation, a non-profit that seeks to empower underprivileged children in the slums of Nairobi through mentorship and education,  and has previously worked with leading Kenyan and international law firms and institutions including Great Lakes Africa Energy, MMC Asafo and Oraro & Company Advocates. She has a Bachelor of Laws (LLB) from the University of Nairobi and a Post-Graduate Diploma in Law from the Kenya School of Law.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Winfred Nakkazi Kiberu\n\n\nWinfred Nakkazi Kiberu\nLegal Analyst                                                                                                                            \n\n                        Winnie is a Legal Analyst at Persistent, offering legal knowledge and support to the company and its partners, to ensure compliance with laws and professional industry practice standards. Winnie graduated with a Bachelor of Laws degree from Strathmore University and will join the Advocates Training Programme at the Kenya School of Law in March 2022. Winnie is a member of Africa in the Moot, the Moot Alumni Association, and is a student member of Chartered Institute of Arbitrators Kenya and the Young and International Group of the International Centre for Dispute Resolution. Before joining Persistent, Winnie was a Legal Intern at  Wairimu & Co. Law + Policy, where she provided legal support and gained experience in various legal fields including commercial law, employment, energy law, investment, taxation, and IP law. Winnie has served as an intern at the Centre for Intellectual Property and IT Law (CIPIT), the Malindi Law Courts in Kenya, and as an Associate Editor of the Strathmore Law Review.\r\nWinnie is an experienced editor, with a great aptitude for legal research and writing.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Njugu-ini Ruci-ini\n\n\nNjugu-ini Ruci-ini\nFinance & HR Officer                                                                                                                            \n\n                        Njugu-ini is an Accounts & Administration Officer at Persistent, focused on financial reporting and tax compliance for Persistent and its portfolio companies. Njugu-ini has over 7 years of progressive experience in accounting, payroll and tax advisory. Prior to Persistent, she was a Payables Accountant at HSC Systems Ltd, a leading ICT solutions provider firm in Africa. Moreover, she worked as an Accountant at Estrang Associates, a financial consulting firm providing services to SMEs from different sectors including real estate, travel, NGOs and service. She has also worked as a Receivables Accountant at the Aga Khan University Hospital in Nairobi, playing a key role in debt management and reporting. Njugu-ini is a CPA finalist holding a Bachelor of Commerce Degree in Finance. She is currently pursuing her Master of Science in Finance at the University of Nairobi.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about John Ndosi\n\n\nJohn Ndosi\nFinance Manager                                                                                                                            \n\n                        John is Finance Manager at Persistent, focused on financial reporting and management for Persistent and its portfolio companies. John has over 15 years of progressive experience in financial management, budgeting,Financial forecasting,Strategy and investor relations management in startups and established companies. Prior to Persistent, he was the Finance Manager at Worldcover Inc, a global climate Insurance firm Moreover, he worked as a Finance head at Samasource Kenya, leading the finance function of the AI company. John is a Certified Public accountant of Kenya holding a Master of Science Degree in Finance and a Bachelor of Arts in Economics from the University of Nairobi.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Damilola Oluwayose\n\n\nDamilola Oluwayose\nCommunication Intern                                                                                                                            \n\n                        Damilola is a Communications Intern at Persistent. She supports all internal and external communications as well as brand and design perspectives. Damilola holds a first-class B. A degree in History and International relations from the Federal University, Oye-Ekiti. Before joining Persistent, she completed internships in Project Management and worked as a Project Communications Officer where she supported girl child and government initiatives. She has also worked as a Design and Freelance Writer on several independent projects.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Dirk Muench\n\n\nDirk Muench\nCo-founder                                                                                                                                                                Strategy Advisor                                                                                                            Director of the Board                                                                        \n\n                        Dirk Muench is a Co-founder of Persistent and a Strategy Advisor. For 8 years he has led many of the firm's key initiatives. Dirk is also the Director of Climate Investments and Ventures at South Pole, serves on the board of Uebermorgen Ventures - one of Europe's leading climate VC firms - and he sits on the Investment Committee of Clima Now Foundation. Prior to Persistent, Dirk worked for pioneer impact investment firm E+CO and for 8 years in global capital markets with JPMorgan and DRKW in London and New York. He holds a Master’s Degree in Engineering from the Swiss Federal Institute of Technology (ETH Zurich) and studied climate science at Columbia University in New York.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\nBoard of Directors \n\n\n\nLearn more about Philipp Cottier\n\n\nPhilipp Cottier\nChairman of Board of Directors                                                                                                                            \n\n                        Dr. Philipp Cottier (Chairman) is an active investor and entrepreneur in fintech, blockchain, hedge funds, and impact investments. He is chairman of Bellegarde Capital and L1 Digital in Zurich and sits on the board of CryptoFinance and other firms active in the financial sector, including until recently Bank Vontobel. Philipp also engages in impact investments as chairman of Persistent Energy LLC and former head private equity of  USD 3 billion development impact firm responsAbility Investments and is a committed philanthropist and avid supporter of social causes such as girl empowerment through the Cottier Donzé Foundation. From 1998 to 2008, he built up and successfully exited Harcourt, a  USD 6 billion asset manager focusing on alternative investments, with partners. He started his career at UBS in Basel, New York and Hong Kong, and Boston Consulting in Sydney, and holds a Ph.D. in finance.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Meera Shah\n\n\nMeera Shah\nDirector of the Board                                                                                                                            \n\n                        Meera Shah (designee) is a Business Director at the Shell Foundation (SF), heading the household energy and off grid utility portfolios and is a member of the SF Investment Committee. Meera has nine years experience in seeding, scaling and providing strategic advisory and hands on operational support to a range of pioneering social enterprises in Africa and India that are addressing access to energy and sustainable mobility. Before joining SF in 2012, Meera had worked globally in a broad range of business roles within the Shell Group. Meera holds a degree in Economics, Politics and International Studies from the University of Warwick.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Amos Gachuiri\n\n\nAmos Gachuiri\nDirector of the Board                                                                                                                            \n\n                        Amos is an investment professional with two decades of experience gained in development & impact investing, SME finance, M&A advisory and audit. Amos started his career as an auditor with PwC before moving to KPMG. After KPMG, Amos worked with GroFin and Grassroots Business Fund in east Africa building and managing portfolios and worked across a wide variety of sectors gaining immeasurable experience. Amos serves as an Investment Manager at FSD Africa Investments; driving strategic relations with portfolio clients working to ensure that finance works to serve the future of Africa, drives impact and further deepens financial services. He has interests in pursuing innovative models that deliver effective financial services to those in most need. He has board level experience and holds an MBA from ESMT Berlin, a Bachelor of Commerce from University from Nairobi and is a member of the Institute of Certified Public Accountants of Kenya (ICPAK). \r\n                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Masashi Mizoguchi\n\n\nMasashi Mizoguchi\nDirector of the Board                                                                                                                            \n\n                        Masashi “Mike” Mizoguchi is the managing director, head of the business division Tokyo branch office of Kyuden International Co.(KIC) which is the subsidiary of Kyuden Electric Power Co., the fourth largest power utility in Japan taking care of international business. He is in charge of expanding KIC’s business in EMEA, Europe, Middle East and Africa. Mike joined KIC in 2020. Since then his team has achieved two major projects in the Middle East, M&A of GTCC project in Bahrain and Green Development of HVDC Subsea cable project in UAE.  His team is now focusing on the Africa and Europe market. He earned his BS Nuclear Engineering from Kobe University of Mercantile Marine and has had a strong EPC background and project management in Asia, Europe and USA for more than 25 years.  As the management of infrastructure investment business he has managed many projects for power and energy investment both green and brown assets for more than 10 years.      \r\n                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Kazuomi Kaneto (K2)\n\n\nKazuomi Kaneto (K2)\nDirector of the Board                                                                                                                            \n\n                        Kazuomi Kaneto (K2) is a serial entrepreneur and seasoned global investor, with over 25 years in development and management positions in renewable energy companies around the world. In 2017, he founded Dream Project Incubators Pte. Ltd. (DPI), a green-field renewable energy developer in the Asia Pacific region and with its VC arms investing in decentralized renewable energy solutions. Owning several renewable energy startups and projects in Africa and is on a mission to drive innovation across the continent by empowering the best builders to change industries. He founded Pacifico Energy K.K., the biggest solar development company in Japan, which has successfully raised over USD 4.5 billion for over 1,300MW solar projects in Japan, also Sparks Energy group, which owns 90MW solar projects in Malaysia. He earned his MS from Stanford University and his BE from Keio University.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Chris Aidun\n\n\nChris Aidun\nPartner                                                                                                                                                                Co-founder                                                                                                            Director of the Board                                                                        \n\n                        Chris Aidun is a co-founder and Partner at Persistent. Chris has over 30 years of experience in venture capital, private equity and finance law. Prior to founding Persistent Energy, he was Managing Director of E+Co, a non-profit clean energy impact investor where he led a financial restructuring that returned significantly more than expected to E+Co creditors. Prior to E+Co, Chris was a senior private equity partner at the international law firm of Weil, Gotshal & Manges LLP. Chris manages corporate structure, legal and tax matters for Persistent and its partner companies.  Chris is a US trained lawyer with a JD from New York University School of Law and a BS in Economics from the University at Albany.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Dirk Muench\n\n\nDirk Muench\nCo-founder                                                                                                                                                                Strategy Advisor                                                                                                            Director of the Board                                                                        \n\n                        Dirk Muench is a Co-founder of Persistent and a Strategy Advisor. For 8 years he has led many of the firm's key initiatives. Dirk is also the Director of Climate Investments and Ventures at South Pole, serves on the board of Uebermorgen Ventures - one of Europe's leading climate VC firms - and he sits on the Investment Committee of Clima Now Foundation. Prior to Persistent, Dirk worked for pioneer impact investment firm E+CO and for 8 years in global capital markets with JPMorgan and DRKW in London and New York. He holds a Master’s Degree in Engineering from the Swiss Federal Institute of Technology (ETH Zurich) and studied climate science at Columbia University in New York.                    \n\n\n\n\n\n\n\n\n \n\n\n\n\nWe are delighted to have Hiroki Matsuo and Ron Cordes as Observers on our Board.\nAdvisory Board \n\n\n\nLearn more about Rolake Rosiji\n\n\nRolake Rosiji\nAdvisory Board Member                                                                                                                            \n\n                        Rolake Rosiji is currently Acting MD for Careers in Africa. She has over 13 years of professional experience in jobtech (Jobberman) renewable energy (M-Kopa), consumer goods (Arla Foods), consulting services and entrepreneurship. She has an MSC from London School of Economics and BA Hons from Durham.\r\n                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nLearn more about Mia von Koschitzky-Kimani\n\n\nMia von Koschitzky-Kimani\nAdvisory Board & Investment Committee Member                                                                                                                            \n\n                        Mia von Koschitzky-Kimani is part of the Advisory Board and Investment Committee at Persistent after having been a Partner at Persistent previously. Mia is also a Partner and COO at Future Africa, an early stage VC fund focused on tech investments across Africa. Previously, Mia was with the Boston Consulting Group building up their Johannesburg office as well as their Sub-Saharan Consumer and Retail Practice where she led projects across the African continent. Mia subsequently founded her own company, DukaConnect, building an AI based point of sale product for micro-retailers across Africa. In 2018, she sold the company to MasterCard where she worked for a year integrating the team and product into the MasterCard organization and leading their overall micro-retail innovation efforts. Mia holds an MBA from Harvard Business School and a Bachelor degree from the University of St. Gallen.\r\n                    \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAfrica's Climate Venture Builder\n\n\n\n\n\n\nSubscribe to the latest news\n\n\nEmail Address\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPersistent Kenya\n1st Floor, Ushuru Pension Plaza\r\nMuthangari Drive, Off Waiyaki Way, Nairobi\r\nP.O. Box 66488-00800\r\nNairobi, Kenya\nTel: +254(0)727144842\n\n\n\n\nPersistent Switzerland\nBirmensdorferstrasse 94\r\n8003 Zurich \r\nSwitzerland\n\n\n\n\nPersistent USA\nNew York, New York 10025 \n\n\n\n\n\n\nAbout Us\n\nTeam\nInvestors\nCareers\n\n\nExplore\n\nWhat We Do\nPortfolio Companies\n\n\nContact\n\nGet in touch\n\n\nLegal\n\nPrivacy Policy\nCookies\n\n\nFollow\n\nTwitter\nLinkedIn\n\n\nNews\nPublications\n \n\n© 2024 Persistent. All Rights Reserved.\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://persistent.energy/about-us/#investors": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbout Us - Persistent - Leading experts and pioneer investors\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbout Us\n\nTeam\nInvestors\nCareers\n\n\nWhat We Do\n\nInvestments\nVenture Building\nImpact\nFAQ\n\n\nPortfolio Companies\nThought Leadership\n\nPublications\nNews\nPersistent Stories\n\n\nContact\n \n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\nAbout Us\n \n\n\nAt Persistent, we believe that climate change is the most pressing challenge of our time. That is why we invest in early-stage climate focused companies that are actively developing and implementing climate change mitigation and transition with a focus on Energy Transition, Resource Transition and Agricultural Transition. We believe that these companies have the power to create a more sustainable Africa through our financial and human capital support.\nFor over a decade, we have invested in Clean Energy Solutions, Sustainable Transportation, Energy Efficiency and other climate focused ventures. Our investment philosophy is simple: We invest in companies that have the potential to generate strong financial returns while also making a positive impact on the African continent.\nWith our Venture Builder model, Persistent is more than just an investment firm. We are a community of entrepreneurs, investors and experts who are passionate about building a sustainable Africa. Headquartered in Nairobi, Persistent is a diverse team of 23 professionals from 11 countries with team members located in Lagos, Dakar, Goma, Kampala, New York, and Zurich.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                                          Meet The Persistent Team                                      \n\n                                          The people that make it happen                                      \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n                                          Would you like to make an impact?                                      \n\n                                          We're always on the lookout for more people                                      \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\nOur Investors\n\n\n\nPersistent is supported by highly committed investors seeking both climate and economic impact and commercial returns. Our investors include high net worth individuals, family offices, foundations, international development organizations, as well as our current and former Persistent team.\nWhy invest in Persistent?\n\nReturns: Our commitment extends to delivering robust financial returns while achieving meaningful impact.\nImpact: We invest in climate focused companies actively working on low-carbon solutions for a sustainable Africa.\nVenture building: Led by experienced entrepreneurs and investors, our team is dedicated to building companies that possess the ability to stimulate further investments, generate significant climate and economic impact and achieve scalability.\n\nIf you are interested in knowing more about becoming an investor in Persistent, please contact us.\n\n\n\n\nGet In Touch\n\n\n\n\n\n \n\n\n                                  Kyuden Group                              \n\nEstablished in 1951, Kyushu Electric Power Company and its affiliates (“Kyuden Group”) has supported the lives and business development of people in Kyushu region, acting as an integrated energy company performing fuel supply, power generation / transformation / transmission / distribution and electricity retailing. Kyuden International Corporation is the overseas business arm of Kyuden Group. Utilizing the technologies and know-how of the Kyuden Group, the company will steadily promote the development of renewable energy in Japan and overseas to contribute to the realization of carbon neutrality. The aim is to be a corporate group that can lead the change toward the decarbonization from Kyushu in Japan.\n\n\n\n\n\n\n\n \n\n\n                                  Shell Foundation                              \n\nShell Foundation is an independent UK-registered charity established by the Shell Group in 2000 to create and scale new solutions to global development challenges. They apply business thinking to major social and environmental issues linked to the energy sector, and seek to leverage the skills and networks of Shell where possible to deliver greater development impact.\n\n\n\n\n\n\n\n \n\n\n                                  FSD Africa Investments                              \n\nFSD Africa Investments is the investment arm of FSD Africa. We provide early-stage, risk-bearing capital to inventive financial organisations that permit more capital to flow for green economic growth benefiting people and the planet. As a catalytic investor, we seek out ambitious financial ventures with the potential to test and drive innovative models and products that can address gaps in Africa’s financial market. We use a range of investment instruments designed fit for purpose to take the early-stage commercial risk, drive high market development impact, and a financial return on investment.\n\n\n\n\n\n\n\n \n\n\n                                  Dream Project Incubators                              \n\nDream Project Incubators (DPI) is a development/investment firm focusing on utility-scale solar and off-grid and microgrid renewable energy projects, especially where no electricity access is available, leveraging its ability to deploy early risk capital, financing and technological expertise, relationships in the region, agility of decision making and project execution. DPI is delighted to support startups and investment firms, which are dedicated to creating better places on this planet.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAfrica's Climate Venture Builder\n\n\n\n\n\n\nSubscribe to the latest news\n\n\nEmail Address\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPersistent Kenya\n1st Floor, Ushuru Pension Plaza\r\nMuthangari Drive, Off Waiyaki Way, Nairobi\r\nP.O. Box 66488-00800\r\nNairobi, Kenya\nTel: +254(0)727144842\n\n\n\n\nPersistent Switzerland\nBirmensdorferstrasse 94\r\n8003 Zurich \r\nSwitzerland\n\n\n\n\nPersistent USA\nNew York, New York 10025 \n\n\n\n\n\n\nAbout Us\n\nTeam\nInvestors\nCareers\n\n\nExplore\n\nWhat We Do\nPortfolio Companies\n\n\nContact\n\nGet in touch\n\n\nLegal\n\nPrivacy Policy\nCookies\n\n\nFollow\n\nTwitter\nLinkedIn\n\n\nNews\nPublications\n \n\n© 2024 Persistent. All Rights Reserved.\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://persistent.energy/about-us/careers-persistent/": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nCareers at Persistent - Impact and Excellence\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbout Us\n\nTeam\nInvestors\nCareers\n\n\nWhat We Do\n\nInvestments\nVenture Building\nImpact\nFAQ\n\n\nPortfolio Companies\nThought Leadership\n\nPublications\nNews\nPersistent Stories\n\n\nContact\n \n\n\n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\nAbout Us\n\n\nCareers\n\n\n\n\n\nCareers\n \n\nBuild with us\n\n\n\nOur culture is entrepreneurial, collaborative, and flexible. We seek talented people who are passionate about impact and have a drive for excellence. We offer a dynamic work environment that is required to work closely with our fast-moving partner companies.\nAt Persistent, our partner companies are focused on developing and delivering products and services that improve livelihoods in underserved markets. These excellent companies offer great job opportunities all over the world.\n\n\n\nBenefits of working with Persistent\n\n\n\n\n\n\n \nImpact\nAn opportunity to work directly with start-ups in underserved markets and create lasting social and\r\nenvironmental impact.\r\n\n\n\n\n\n\n \nSteep learning curve\nBecome a multi-skilled professional in a short period of time and build the confidence to embrace and tackle most business challenges.\n\n\n\n\n\n \nOpportunity to take initiative\nLeverage your expertise to create practical and relevant solutions for companies on the frontline and see concrete outcomes of your work.\n\n\n\n\n\n \nFlexibility\nExercise a significant amount of discretion in determining what you do and how you do it.\n\n\n\n\n\n\n\nOpenings at Persistent\n \n\n\n\nPosition Type\nJob Type\nCompany\nLocation\n\n\n\n                        IT Solutions Engineer                     \n\n                        Part Time/Full time                    \n\n                                                    Persistent                                            \n\n                        Kenya                    \n\n\n\n                        Senior Investment Professional (Early-stage Equity)                    \n\n                        Full-time                    \n\n                                                    Persistent                                            \n\n                        Nigeria or Kenya                    \n\n\n\n\n\n\n\nOpenings at Partner Companies\n \n\nThere are currently no job openings.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAfrica's Climate Venture Builder\n\n\n\n\n\n\nSubscribe to the latest news\n\n\nEmail Address\r\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPersistent Kenya\n1st Floor, Ushuru Pension Plaza\r\nMuthangari Drive, Off Waiyaki Way, Nairobi\r\nP.O. Box 66488-00800\r\nNairobi, Kenya\nTel: +254(0)727144842\n\n\n\n\nPersistent Switzerland\nBirmensdorferstrasse 94\r\n8003 Zurich \r\nSwitzerland\n\n\n\n\nPersistent USA\nNew York, New York 10025 \n\n\n\n\n\n\nAbout Us\n\nTeam\nInvestors\nCareers\n\n\nExplore\n\nWhat We Do\nPortfolio Companies\n\n\nContact\n\nGet in touch\n\n\nLegal\n\nPrivacy Policy\nCookies\n\n\nFollow\n\nTwitter\nLinkedIn\n\n\nNews\nPublications\n \n\n© 2024 Persistent. All Rights Reserved.\n\n\n\n\n\n\n\n\n\n\n\n\n"}]}