{"text": [{"https://planet-a-foods.com/": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe love our planet and we love chocolate — Planet A Foods\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMission\nTechnology\nAbout us\nCareers\nPress\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\tA new era of sustainable food ingredients is here\t\t\t\t\n\n\t\t\t\t\tWelcome to Planet A Foods.\t\t\t\t\n\n\n\n\n\t\tKNOWN FROM\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\tBACKED BY\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nFoods we love are often based on troubling realities.\nCrops like cocoa can only be grown in certain parts of the world, where rainforests thrive. But the demand for these ingredients leads to mass deforestation and huge carbon emissions, which will only be made worse through climate change. According to Global Forest Watch, Ghana – a major producer of cocoa – lost 1.4 million hectares of tree cover from 2000 to 2021, resulting in 739 million tons of CO2 emissions.\n\n\n\n\n\n\nThat’s where we come in. We’ll save  500 million tons of CO2 each year.\n\n\nHow? By producing food ingredients that are decoupled from limited resources & exploitation. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHow We Do It At Planet A Foods, we use proprietary technology to ferment plant-based ingredients, allowing us to naturally recreate the flavours and fats in the foods we love. That means we can produce food ingredients locally and sustainably, which are decoupled from limited land and labor resources.\n\n\n\n\n\n\n\n\n                    Tasty as chocolate – sustainable as never before\nVisit ChoViva now\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSite\n\n\nTechnology\nAbout us\nMission\nCareers\nFrequently asked questions\nPress\n \n\n\n\nLegal\n\n\nContact\nPrivacy Policy\nLegal\n \n\n\n\nStay on Board\n\n                    Be the first to know about ourlatest product releases.                \n\n\n\n\n\n\nEmail address\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLinkedIn\n\n\n\n\n\nInstagram\n\n\n\n\n\n\n\n\n\n\nYouTube\n\n\n\n\n\n\n© 2024 Planet A Foods.\n                All rights reserved.\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://planet-a-foods.com/mission/": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nOur Mission\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMission\nTechnology\nAbout us\nCareers\nPress\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPLANET A FOODS\n\n\t\t\t\t\tChanging the Food Industry to Protect the Planet We Love\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAt Planet A Foods …\n… we want to revolutionise the food industry to protect the planet we love. We’re on a mission to create dramatically more sustainable food ingredients, and thus save millions of tons of CO2 emissions each year. And we’re starting with cocoa. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\tWhat’s The Problem With Cocoa?\t\t\t\t\t\t\t\n\nChocolate is much beloved, but behind its sweetness lies the reality of deforestation, extreme poverty, huge carbon footprints, and more.\n\nMonoculture farming kills biodiversity, degenerates soil, and increases global CO2\nMassive yearly deforestation, and up to 50% of cocoa plants threatened by climate change\n24,000 liters of water needed to produce 1kg of cocoa (1.5x the amount of water needed to produce 1 kg of beef!)\nMillions of children working in slave and/or unsafe working conditions.\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\tThat’s where ChoViva comes in\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\t\tWhat’s the Problem with Palm Oil?\t\t\t\t\t\t\t\n\nFrom packaged foods to soaps and cosmetics, palm oil is a high-quality oil that – like chocolate – has a troubling impact on our planet.\n\nLarge-scale deforestation, leading to loss of plant and animal diversity, including critically endangered animals\nMassive increases in CO2 due to loss of tropical peat forests, which act as ‘carbon sinks’\nBurning practices for land clearing lead to major air pollution and increases in CO2\nIncrease in soil erosion, leading to increased flooding\n\nAt Planet A, we’re working to save 500 million tons of CO2 annually, by creating foods we love based on sustainable and local ingredients. \n\n\n\n\t\t\t\t\t\t\t\t\t\t\tDiscover our technology\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHelping Meet The UN’s Sustainable Development Goals\nWe believe in the UN’s Sustainable Development Goals, which promote global prosperity while tackling climate change and addressing economic growth.\nBy decoupling beloved products – like chocolate – from unsustainable farming practices, some examples of the goals we are working towards are:\nGoal 13: Climate Action – our starting goal is to save 500 Mt of CO2 from entering the atmosphere.\nGoal 15: Life on Land – slowing deforestation, increasing biodiversity, and reversing land degradation.\n\n\n\n\t\t\t\t\t\t\t\t\t\t\tLearn more\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\nSite\n\n\nTechnology\nAbout us\nMission\nCareers\nFrequently asked questions\nPress\n \n\n\n\nLegal\n\n\nContact\nPrivacy Policy\nLegal\n \n\n\n\nStay on Board\n\n                    Be the first to know about ourlatest product releases.                \n\n\n\n\n\n\nEmail address\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLinkedIn\n\n\n\n\n\nInstagram\n\n\n\n\n\n\n\n\n\n\nYouTube\n\n\n\n\n\n\n© 2024 Planet A Foods.\n                All rights reserved.\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}]}