{"text": [{"https://satgana.com": "Satgana - Investing in planet-positive startupsNext generation Climate Tech Venture Capital firm investing in the Future of EarthLearn moreAbout UsInvestment thesisWhat we doTeamPortfolioPartnersContact UsApply Nowसत् Sat गण Ganameans a good company in SanskritWe are on a mission to use business as a force for good, by investing in the next generation of entrepreneurs to build a more sustainable, fair and regenerative future.IntegrityTransparencyHumilityInclusionEmpathyAmbitionThe climate & ecological crisis is the defining issue of our time.We invest in technology solutions across these themes. TransportationElectric mobilityLong battery storageLow emissions aviationEnergyRenewable energyBattery storageDistributed systemsFood & AgricultureAlternative proteinsRegenerative agricultureReducing food wasteIndustry & BuildingsHeating and coolingCement alternativesSustainable textilesCarbon RemovalNature-based solutionsEngineered carbon removalHybrid solutions & platformsCircular EconomyUpcyclingWaste and recyclingSecond hand marketplacesWe invest between €100k and €300k in category-defining early-stage Climate Tech startups in Europe and Africa. Post-investment, we provide hands-on support, partner-driven perks, and far-reaching networks, going all in to give firepower to our founders.Pitch your startup to usOperational TeamOur diverse and purpose-driven collective has a proven track record as investors, founders and operators across Europe & Africa.Romain DiazChief Executive OfficerAnil MaguruPartnerDesirée PetterssonInvestor & Head of ImpactJoana FonsecaMarketingPhilippe Audebert Venture PartnerPatricia SilvaVenture PartnerMichael NapperVenture PartnerJames CrowleyVenture PartnerBoard of DirectorsHugo VautierBoard MemberEryn ZanderChair Of The BoardOriane SchoonbroodtBoard MemberAdvisorsAlexis AngotCo-Founder of ŸnsectLubomila JordanovaCo-Founder & CEO of Plan A EarthMarijn WiersmaDirector at 2X GlobalMartjin BlomImpact Funds at EVPACordula PflüglCMO at The Next WebKonstantin BehrChief of Staff at Founders Factory Africa Cathy GoddardCEO of Fyrefem Fund ManagersRyan Grant LittleVenture Scout, Investor & Podcast hostBacked ByOur LPs consist of impact-driven individuals, many of whom are involved with us in deal-sourcing, due diligence, co-investments, networks and/or portfolio support.Thibaud Hug de LarauzeCo-Founder & CEO of Back MarketFabrice de GaudemarCEO of QottoCullom Capital Founded by Peter CullomCharles PfisterCo-Founder & co-CEO of YesparkAntoine LouisetCo-Founder of YouSignElsa HermalCo-Founder of EpiceryJosef Bovet & Dimitri FarberCo-Founders of Tiller SystemsZachariah GeorgeManaging Partner Launch AfricaChristophe Chausson Founder of Chausson FinanceMarc SudreauMP at Chausson FinanceLaurence HémeryMP at Chausson FinanceAntoine PaillusseauFounder & CEO at FCB.aiOur PortfolioAccelerating the low-carbon transition with actionable methane intelligence. Orbio EarthGermanyTurning hard-to-recycle plastic waste into low-cost, low-carbon building materials.KubikEthiopiaLeveraging AI to helprestaurants reduce their food waste.FullsoonFranceProducing sustainable protein by reusing an industrial by-product: spent brewer’s yeast. OnimaFranceRefurbishing electric bicycles, enabling a cheaper, circular and low carbon form of mobility. LoewiFranceTransforming protein-rich spent grain waste into animal and plastic-free alternative leather.ArdaUnited KingdomDeveloping deep tech solutions that make electronic repair scalable and affordable.Rebel TechGermanyRevolutionizing shared mobility through an electric vehicle ecosystem in Africa. Mazi MobilityKenyaIncreasing the access to quality and affordable electronic repairs in emerging markets. RevivoKenyaDeveloping a novel carbon dioxide removal method, utilizing desalination brine.BrineworksThe NetherlandsEliminating single-use plastics from FMCG value chains with an innovative IoT system.NovekKenyaUsing precision fermentation to enable large-scale alternative milk protein production.FermifyAustriaSolving Africa’s environmental data scarcity by utilizing AI and satellites.AminiKenyaTackling the aviation sector’s climate impact with an AI-powered SaaS platform.EstuaireFranceBuilding Direct Air Capture technology for speed and scale.SironaBelgiumDecarbonizing industries thanks to IoT-enabled and AI-powered energy management systems.WattnowTunisiaWe are part of a growing, global community, passionate about regenerating our planet and taking climate action.Join the journey — Get in touch with usFollow us on Social MediaAddress18 rue Robert Stümper, L2577 Luxembourg,Grand Duchy of LuxembourgNameEmail AddressMessageThank you! Your submission has been received!Oops! Something went wrong while submitting the form.Please try again.Built with ♥ by SatganaBlogSFDRGDPRFor Investors"}]}