{"text": [{"http://www.sidbiventure.co.in": "\n\n\nsidbiventure.co.in\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome \nAbout Us\n\nPromoter\nSVCL: Partner\nFAQs\nStewardship Policy\nCSR Activities \nMGT-7 - FY 2023\n\n\nFunds\n\nActive Funds\n\n Assam Start-up Venture Capital Fund\n Atmanirbhar Start-up Venture Fund\n Tripura Start-up Venture Capital Fund\n Ubharte Sitaare Fund\n\n\nPast Funds\n\nMaharashtra State Social Venture Fund\nWest Bengal MSME VC Fund\nTex Fund\nSamridhi Fund\nIndia Opportunities Fund\nSME Growth Fund\nNational Venture Fund for Software and IT Industry\n\n\n\n\nKnowledge Repository\n\nBusiness Plan\nUseful Links\n\n\nCareer \nContact Us \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPreferred Venture Capital for\nMSMEs \n\n\n\n\n\nPreferred Fund for\nMSMEs \n\n\n\n\n\nPreferred Venture Capital for\nMSMEs\n\n\n\n\n\n\n\n\n\n\n\n\n Ubharte Sitaare Fund invest â¹30 crores in OmniBRx Biotechnologies Private Limited \n            \n|\n            \nUbharte Sitaare Fund invest â¹30 crores in OmniBRx Biotechnologies Private Limited\n            \n|\n            \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nAbout Us\nSIDBI Venture Capital Limited (SVCL), incorporated in 1999, is an \ninvestment management company and a wholly owned subsidiary of SIDBI (www.sidbi.in), \nthe Apex Financial Institution in the country for the MSME sector.Over its life, SVCL has managed funds focussed on \ndifferent themes including Startups/ early stage technology businesses... \n\nRead More\n\n\n\nPromoters\nSmall Industries Development Bank Of India \nWebsite Link: (www.sidbi.in)\nSmall Industries Development Bank Of India (SIDBI) was established in April 1990, under an Act of Indian Parliament \nto serve as the Principal Financial Institution for promotion, financing, and development... \n\n\nRead More\n\n\n\nSVCL: Partner\nSVCL partners with outstanding founders & leadership teams of start ups and small and mid-size Indian businesses across growth \nsectors. The capital could be provided for:\nAny tangible and intangible investment which is considered critical for the growth requirement  the \ncompany. Intangible requirements could... \n\n\nRead More\n\n\n\n\n\n\n\nInvestments \n\n\n\n \n\n\n\nIndiaIdeas.com Limited, Mumbai \n\n\nIntegrated Electronic Bill Presentment and Payment (EBPP) Service & payment \n\tsolutions in India.\nWebsite: http://www.billdesk.com/\n\nClose\nx\n\n\n\n\n \n\n\n\nManthan Software Services Private Limited, Bangalore\n\n\nManthan is a provider of specialised software solutions for the retail and consumer goods industries.\nWebsite: https://www.manthan.com/\n\nClose\nx\n\n\n\n\n \n\n\n\nKraftPowercon India Private Limited.\n\n\nPowercon is an ISO 9001-2000 compliant integrated manufacturer of high current controlled \n\trectifiers and high voltage rectifiers, with its core strength lying in design and engineering. \n\tIt has several thousand installations across the globe for applications ranging from metal finishing, \n\tbattery formation, chlorination/ hydro generation to water treatment, \n\telectrowinning processes, etc., as well as for Electrostatic Precipitators (ESPs) \n\tin thermal power, steel, paper and cement plants.\nWebsite: https://kraftpowercon.com/\n\nClose\nx\n\n\n\n\n \n\n\n\nCentaur Pharmaceuticals Private Limited, Mumbai\n\n\nThe manufactures formulations for respiratory, ophthalmic, pain management, nutrients, \n\tgastrointestinal, anti-infective cardiovascular, diabetics and herbal segments.\n\tWebsite: https://www.centaurpharma.com/\n\n\nClose\nx\n\n\n\n\n \n\n\n\nStovekraft Private Limited, Bangalore\n\n\nStovekraft is the largest manufacturer of LPG stoves and 3rd largest \n\tmanufacturer of pressure cookers in India. It also retails other high end appliances through \n\tits network of Pigeon and Gilma branded retail outlets.\nWebsite: https://www.stovekraft.com/\n\nClose\nx\n\n\n\n\n \n\n\n\nSynergistic Financial Networks Private Limited (Mosambee), Mumbai\n\n\nSynergistic Financial Networks Private Limited offers mPOS solutions under the\n\tbrand \"Mosambee\". It enables mobile payments by plugging in a small Mosambee card reading device \n\tinto the audio jack of merchant's mobile handset.\nWebsite: https://www.mosambee.in/\n\nClose\nx\n\n\n\n\n \n\n\n\nWestern India Cashew Company Private Limited\n\n\nWestern India Cashew Company Private Limited (WICCPL) is engaged in the business \n\tof processing of edible nuts. \nWebsite: http://www.wenders.com/\n\nClose\nx\n\n\n\n\n \n\n\n\nESAF Microfinance and Investments Private Limited\n\n\nESAF Microfinance and Investments Private Limited is an NBFC-MFI and is well established\n\tin Kerala, Tamil Nadu and  Maharashtra. ESAF plans to expand its operation by setting up branches in SF States.\n\tIt is one amongst ten companies who got âin-principleâ approval from RBI for small bank licence. \n\tAs on March 31, 2015, the Company had loan portfolio of more than â¹1,000 crore with presence in 72 districts \n\tin India. The borrower base of the Company is more than 5,00,000 with 224 branches. With this fund infusion, \n\tover the next five years, the Co. plans to penetrate more into Samridhi States.\n\n\nWebsite:http://emfil.org/\n\nClose\nx\n\n\n\n\n \n\n\n\nRite Water Solutions (India) Private Limited\n\n\nRite Water Solutions (India) Private Limited is an ISO 9001:2008 certified company with \n\ta focus on providing potable water to rural population where available ground / surface water sources are \n\tcontaminated by chemical (fluoride, nitrate, arsenic, salinity etc.) & bacteriological impurities.\nWebsite: http://www.ritewater.in/\n\nClose\nx\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nBusiness Plan\nA good quality business plan is the first pre requisite for an entrepreneur to evoke interest of financial investors. The investors are going through a large number of business plans all the time and \ntherefore it is critical that your investment plan is clear and also sharply brings out the value proposition to the investors...  \nRead More\n\n\n\nGeneral Investment Criteria\n\nA strong management team which has commitment, demonstrated track record and a high degree of integrity\nLong term competitive advantage\nPotential for above average profitability leading to attractive returns on investments\nSubscription to equity/ equity type instruments\nUnlisted companies preferably in SMEs\nExit should be established\n\n\n\n\n\n\n\n\n\n\n\nFAQs\n\n\n\nHow does the Company approach SVCL for funding?\nThe details of the active funds being managed by SVCL are given in the website It would be preferable if \nthe company submits the business plan in a format given in the website. \nBased on a preliminary assessment of the business plan, course of further interaction with SVCL can be decided.\n\n\nHow do I submit a plan to SVCL?\nYou can send an email on the respective email ids of the Funds, forwarding a copy of the executive summary of your \nbusiness plan including the profile of management team, historical & future financials and industry information.\n\n\n\n\n\nRead More\n\n\n\nKnowledge Repository\n\n\nA Guide for Raising Equity Investment by MSMEs (PDF) \nDevelopment Commissioner, Ministry of MSME  (www.dcmsme.gov.in)\nDepartment for Promotion of Industry and Internal Trade (www.dipp.nic.in)\nCredit Guarantee Fund Trust for Micro and Small Enterprises (www.cgtmse.in)\nNational Credit Guarantee Trustee Company Ltd (www.ncgtc.in)\nTechnology Development Board (www.tdb.gov.in)\nBiotechnology Industry Research Assistance Council (www.birac.nic.in)\nGovernment Portal for MSME (Udyam) Registration ( www.udyamregistration.gov.in )\n\n\n\nRead More\n\n\n\nNews\n\n\n\n Ubharte Sitaare Fund invest â¹30 crores in OmniBRx Biotechnologies \n Ubharte Sitaare Fund investÂ â¹30 crores inÂ Serosoft Solutions Private Limited \n First investment of Ubharte Sitaare Fund of â¹25 crores in Covalense Digital Solution Pvt. Ltd.\n Ubharte Sitaare Fund (USF) announces first close on March 16, 2022 at â¹ 285 crores\n Ubharte Sitaare Fund (USF) launched by Honâble Union Finance Minister Smt. Nirmala Sitharaman on August 21, 2021\n Maharashtra State Social Venture Fund invests in Locobuzz Solutions Private Limited \n\n\n\n\n\n\n\n\n\n\nAddress\n SIDBI Venture Capital Limited\n2nd Floor, Swavalamban Bhavan,\nC-11, G-Block, \nBandra Kurla Complex,\nBandra (East),\nMumbai - 400 051\n\n\nContact Us\nTelephone No.: 022 â 6753 1202 \nSend us a message\nE-mail:  info@sidbiventure.co.in\n\n\nCIN No. & GSTIN No.\nCIN No. U67190MH1999PLC120866GSTIN No. 27AADCS3380F2ZD\n\n\n\n\n\n\n\n\n\nAbout Us\nFunds \nKnowledge Repository \nFAQs \nArchives \nContact Us \nSite Map\n\n\n\n\nCopyrightÂ© SIDBI VC. All Rights Reserved\n\n\n\n\n"}]}