{"text": [{"https://sosv.com": "\n\n\n\n\n\n\n\n\nSOSV - Deep Tech for Human and Planetary Health\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkip to content\n\n\nInvestors: Register for HAX’s Sept. 11 San Francisco Demo Day\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrograms\nClimate 100\nHealth 100\nPortfolio\nNews\nEvents\nJobs\nTeam\nAbout\nInvest\n\n\n\t\t\t\t\t\tCopyright All Rights Reserved © 2024 SOSV Investments LLC. All SOSV registered trademarks are owned by SOSV Investments LLC\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDeep Tech for Human and Planetary Health\nSOSV is a global venture capital firm that offers multi-stage investment starting in our deeply resourced, deep tech startup programs, IndieBio and HAX, with locations in New York City, Newark and San Francisco. \n\nLEARN MORE\n\n\n\n\n\n\n\n\n\n\n\n                TechCrunch               \n\n                SOSV Closes $306M Deep Tech Fund for Human and Planetary Health              \n\n\n\n\n\n\n\n\n                    Aug 01, 2024                \n\n\n                Announcing HAX’s Sept. 11 San Francisco Demo Day              \n\n\n\n\n\n\n\n\n                    Jul 17, 2024                \n\n\n                Announcing the fourth annual SOSV Climate Tech Summit              \n\n\n\n\n\n\n                  BetaKit                \n\n                    Jul 30, 2024                \n\n\n                Afynia raises $2 million CAD to bring endometriosis test to market              \n\n\n\n\n\n\n                  Founder Stories                \n\n                    Jul 29, 2024                \n\n\n                unspun’s Weaving Machines Aim to Fix Apparel’s Waste and Carbon Problem              \n\n\n\n\n\nSee all news\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe help startups go further, faster.\n\n\n\n\n\n\n\n\n3\n\n\n                Lab & Office Locations              \n\n\n\n80,000\n\n\n                Sq ft Lab & Office Space              \n\n\n\n225 \n\n\n                HAX & IndieBio Grads  2020-2023              \n\n\n\n44% \n\n\n                Founders with PhDs2020-2023              \n\n\n\n$4.02B \n\n\n                Raised Post-program 2020-2023              \n\n\n\n1000+\n\n\n                SOSV Co-investors              \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                    SOSV Founders\n                  \n\n                    Walden Lam, Kevin Martin and Beth Esponnette                  \n\n                    Co-founders, unspun                  \n\n                    unspun’s Weaving Machines Aim to Fix Apparel’s Waste and Carbon Problem                  \n\nFunded with $57 million from DCVC, Lowercarbon Capital and SOSV, among others, unspun aims to eliminate 1% of global carbon emissions \n\n\n\nREAD PROFILE\n \n\n\n\n\n\n\n\n\n\n                    SOSV Founders\n                  \n\n                    Karim Pichara and Matias Muchnik                  \n\n                    Co-founders, NotCo                  \n\n                    NotCo’s plant-based foods are on store shelves, but its AI engine “Giuseppe” is the real business                  \n\nWhile it might look like a plant-based food company, NotCo is in the data and AI business—and aims to disrupt R&D in many industries that use animal and plant ingredients.\n\n\n\nREAD PROFILE\n \n\n\n\n\n\n\n\n\n\n                    SOSV Founders\n                  \n\n                    Miranda Wang and Jeanny Yao                  \n\n                    Co-founders, Novoloop                  \n\n                    Novoloop Is Upcycling Your Future                  \n\nMiranda Wang and Jeanny Yao have an uncanny talent for finding value where others see waste. Their plastics upcycling company, Novoloop, just raised a $21m Series A to prove it.\n\n\n\nREAD PROFILE\n \n\n\n\n\n\n\n\n\n\n                    SOSV Founders\n                  \n\n                    Declan Jones, Max Huisman, Deniz Kent                   \n\n                    Co-founders, Prolific Machines                  \n\n                    Prolific Machines Has The Key to Affordable Cultured Meat                  \n\nWhile volunteering in a Syrian refugee camp, stem cell biologist Deniz Kent saw what climate change could do to humanity at a massively greater scale. He co-founded Prolific Machines with Max Huisman and Declan Jones to address a top source of greenhouse gas emissions: livestock.\n\n\n\nREAD PROFILE\n \n\n\n\n\n\n\n\n\n\n                    SOSV Founders\n                  \n\n                    Chiu Chau                  \n\n                    Co-Founder, OpenTrons                  \n\n                    Chiu Chau Reboots a Robot into a Billion Dollar Business                  \n\nIt was 2015, and Chiu Chau was on the ropes. He had pitched nearly 150 venture capital firms. No one would invest. Everyone doubted the startup with the open-source laboratory robot.\n\n\n\nREAD PROFILE\n \n\n\n\n\n\n\n\n\n\n                    SOSV Founders\n                  \n\n                    Uma Valeti                  \n\n                    Founder and CEO, Upside Foods                  \n\n                    Upside Foods Serves Up a Sustainable Future                  \n\nTo find the future of food, you may have to look no further than Emeryville, CA, a small city by the San Francisco Bay, where Upside Foods has built a 53,000-square-foot production facility for cultivated meat.\n\n\n\nREAD PROFILE\n \n\n\n\n\n\n\n\n\n\n                    SOSV Founders\n                  \n\n                    Radhika Patil and Bharath Patil                  \n\n                    Co-founders, Cradlewise                  \n\n                    Sleeping Beauty                  \n\nIn a timeless dilemma for new parents, Radhika and her husband Bharath discovered early that their baby daughter was a fussy sleeper. The situation left them tired and frustrated; being effective at work became a challenge.\n\n\n\nREAD PROFILE\n \n\n\n\n\n\n\n\n\n\n                    SOSV Founders\n                  \n\n                    Antonio Rocha, GIlberto Loureiro, and Paulo Ribeiro                  \n\n                    Co-founders, Smartex                  \n\n                    Smartex is Creating the Textile Factory of the Future                  \n\nGilberto Loureiro grew up inspecting fabrics in a Portuguese textile factory. With Smartex, he and co-founders Antonio Rocha and Paulo Ribeiro are eliminating textile defects—and their enormous cost both to manufacturers and the environment. \n\n\n\nREAD PROFILE\n \n\n\n\n\n\n\n\n\n\n                    SOSV Founders\n                  \n\n                    Adebayo Alonge and Amy Kao                  \n\n                    Co-founders of RxAll                  \n\n                    RxAll’s Life-Saving Deep Tech for African Pharmacies                  \n\nAdebayo (“Ade”) Alonge and Amy Kao, co-founders of RxAll had invented a handheld scanner for detecting counterfeit prescription drugs—an illicit, multibillion-dollar industry that kills an estimated 1 million people annually around the world and 100,000 in Africa.\n\n\n\nREAD PROFILE\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                  IndieBio SF office                \n\n\n\n\nFirst Check in Deep TechTM\n\nWith more than $1.5 billion in assets under management, SOSV makes 200+ deep tech investments per year, including 75 pre-seed and seed rounds in startups that join our industry leading HAX and IndieBio startup development programs. Our pre-seed, “first checks” range from $250,000 to $525,000, and we follow on in later rounds. SOSV is the most active deep tech venture investor in the world.\n\n\n\n\n\n\n\n\n\n\n                  Smartex founders, HAX                \n\n\n\nHuman & Planetary Health\n\nSOSV’s core mission is to launch visionary founders who are destined to have a radically beneficial impact on human and planetary health. That ranges from the vast effort to make humanity’s means of production more sustainable to curing disease and improving healthcare. As of April 2023, our top 100 climate tech companies have an aggregate valuation of $11.69 billion and have raised $3.77 billion, while our top 100 health startups are valued at $6.47 billion with $1.42 billion raised. SOSV is consistently ranked by PitchBook as a top investor in both categories.\n\n\n\n\n\n\n\n\n\n\n                  SOSV Founder Sean O’Sullivan                \n\n\n\n\nBuilt for Builders\n\nSOSV’s HAX and IndieBio programs offer 80,000 square feet of bio, chem, mech and EE labs at three locations—New York, Newark and San Francisco. Our founders have access to sophisticated lab and fabrication equipment ranging from 3D printers to mass spectrometers, and they work side-by-side with our GPs and staff to turn their research into scalable commercial reality. 62% of program graduates raise their next round within 12 months.\n\n\n\n\n\n\n\n\n\n\n                  Prototype development at HAX                \n\n\n\n\nThat Next Check Too\n\nSOSV’s pre-seed or seed investment is just the beginning. With more than 1,000 co-investors in SOSV’s syndicates, we have a powerful global network to match investors with our founders for series seed, A and beyond. We join those later rounds as well, through our core funds as well as the SOSV Select Fund. Between 2020 to 2023, our deep tech portfolio raised $4.02 billion and SOSV joined 449 rounds.\n\n\n\n\n\n\n\n\n\n\n                  IndieBio SF lab                \n\n\n\n\nDiversity for the Win\n\nSOSV believes that great founders come from all geographies, genders and cultures. Our 1,690 deep tech founders represent 75 nationalities and operate in 40 countries. 44% have PhDs earned at 70 universities around the world. And 33% of our startups have at least one female founder. What all SOSV founders have in common is a drive to deliver incredible science and technology that will make the world a better place today and for generations to come.\n\n\n\n\n\n\n\n\n\n\n                  IndieBio SF demo day                \n\n\n\n\nSOSV for Life \nThe friendships founders build in the HAX and IndieBio programs last forever, and so do their ties to our general partners, who long remain trusted advisors. We continue helping founders raise funds, make connections, and win press coverage long after they finish our programs. We also produce unique, high profile events to showcase our founders as well as drive the overall climate and health ecosystem, including the SOSV Climate Tech Summit, the SOSV VC-Founder Matchups (Sustainable Industry, Health, and Climate), and our SOSV Climate 100 and Health 100 lists. SOSV is for life.\n\n\n\n\n\n\n\n\n\n\nSOSV Programs\n\n\n\nSOSV staff at HAX and IndieBio work with founders around the world\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                    Helping hard tech founders tap into the world’s premier ecosystems for real-world product development, manufacturing and fundraising.                  \n\n\nLearn more\n\n\nApply\n\n\n\n\n\n\n\n\n\n\n                    Dedicated to turning scientists into entrepreneurs determined to save lives and save the planet, based in San Francisco and New York City.                  \n\n\nLearn more\n\n\nApply\n\n\n\n\n\n\nNot sure which program is right for your startup?\nLearn more about SOSV pre-seed investment and startup  development programs.\n\n\n\n\n\n\n\n\n\n\n\n\n\nA Day in the Life of SOSV\n\nScenes from SOSV’s offices in San Francisco, New York, Newark, and Shenzhen.\n\n\n\n\n\n\n\n\n\nHAX\n\n\n\n\nIndieBio NY\n\n\n\n\nIndieBio SF\n\n\n\n\nHAX\n\n\n\n\nRobotics at HAX\n\n\n\n\n\n\n                Follow us\n              \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInvest with SOSV\n\nSOSV welcomes co-investors in portfolio companies as well as limited partners in SOSV funds\n\n\n\n\n\n\n\nInvest in our Companies\n\nSOSV’s portfolio companies raise 200 follow-on rounds each year, and the co-investors in SOSV’s 1000+ portfolio number in the 100s. SOSV aims to build a global, diverse network of investors, and new co-investors are always welcome.\n\n\nLEARN MORE\n\n\n\n\n\nInvest in our Funds\n\nSOSV is a multi-stage VC that invests in 100+ pre-seed startups each year and joins hundreds of follow-on rounds through SOSV’s core and select funds. New limited partners interested in “human and planetary health” are welcome.\n\n\nLEARN MORE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGet Monthly Email Updates from SOSV\n\n\n\n\n\n\n\n\n\n\n\n\n\nFirst name(Required) Last name(Required) Email(Required)\n\nHiddensubscriptions \n  \n\n\n\n\n\n\n\n\n\n\n\n\nWe don’t spam. Our Privacy Statement and Terms of Use apply.\nThe forms on this site are protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLearn\n\nAbout SOSV\nOur Programs\nOur Portfolio\nOur Team\nLegal FAQ\nPress & Media\nBrand Guidelines\n\n\nApply\n\nApplication FAQ\nApply\n\n\nInvest\n\nInvest in our Funds\nInvest in our Companies\n\n\nParticipate\n\nJobs at our Companies\nOur Events\nJoin Talent network\nGet Email Updates\nSOSV Consortium\nMomentum Program\n\n\n \n\n\n\n\n\n\t\t\t\t\tCopyright All Rights Reserved © 2024 SOSV Investments LLC. All SOSV registered trademarks are owned by SOSV Investments LLC\n\t\t\t\t\t\n\nPrivacy Statement\nTerms of Use\nCookie Policy\nDisclaimer\nCommunication Policy\nCode of Conduct\nPress & Media\n \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\t\t\t\tStay In The Know\t\t\t\n\nCurated trends and insights on deep tech for human and planetary health.\n\n\n\n\n\n\nFirst name(Required) Last name(Required) Email(Required)\n\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\nWe don’t spam. Our Privacy Statement and Terms of Use apply.\n\n\n\n\n\n\nWe use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept All”, you consent to the use of ALL the cookies or visit \"Cookie Settings\" to provide a controlled consent. Cookie PolicyCookie SettingsAccept AllManage consent\n\n\n\n\nClose\n\n\n\n\n\n\nCookie Preferences \nThis website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience.\n\n \n\n\n\n\n\n                                Necessary                            \n\n\n Necessary \n\n\n                                    Always Enabled                                \n\n\n\nNecessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously.\nCookieDurationDescriptionAWSELBsessionAssociated with Amazon Web Services and created by Elastic Load Balancing, AWSELB cookie is used to manage sticky sessions across production servers.cookielawinfo-checkbox-advertisement1 yearSet by the GDPR Cookie Consent plugin, this cookie is used to record the user consent for the cookies in the \"Advertisement\" category .cookielawinfo-checkbox-analytics11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checkbox-functional11 monthsThe cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\".cookielawinfo-checkbox-necessary11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".cookielawinfo-checkbox-others11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other.cookielawinfo-checkbox-performance11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\".viewed_cookie_policy11 monthsThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data.\n\n\n\n\n\n\n                                Functional                            \n\n\nfunctional\n\n\n\n\nFunctional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features.\nCookieDurationDescription__Host-airtable-session1 yearContains a specific ID for the current Airtable.com session. This is necessary for the integartion of Airtable lists.__Host-airtable-session.sig1 yearContains a specific ID for the current Airtable.com session. This is necessary for the integartion of Airtable lists.brw1 yearDetects and logs potential errors on third-party provided functions of airtable.com integration.community_token30 daysThis cookie is used to track authenticated users in SOSV's Community Portal.login-status-ppastThis cookie is necessary for the integartion of Airtable lists.\n\n\n\n\n\n\n                                Performance                            \n\n\nperformance\n\n\n\n\nPerformance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors.\nCookieDurationDescriptionAWSELBCORSsessionThis cookie is used by Elastic Load Balancing from Amazon Web Services to effectively balance load on the servers.\n\n\n\n\n\n\n                                Analytics                            \n\n\nanalytics\n\n\n\n\nAnalytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc.\nCookieDurationDescription_ga2 yearsThe _ga cookie, installed by Google Analytics, calculates visitor, session and campaign data and also keeps track of site usage for the site's analytics report. The cookie stores information anonymously and assigns a randomly generated number to recognize unique visitors._gat_UA-45933216-181 minuteA variation of the _gat cookie set by Google Analytics and Google Tag Manager to allow website owners to track visitor behaviour and measure site performance. The pattern element in the name contains the unique identity number of the account or website it relates to._gid1 dayInstalled by Google Analytics, _gid cookie stores information on how visitors use a website, while also creating an analytics report of the website's performance. Some of the data that are collected include the number of visitors, their source, and the pages they visit anonymously.CONSENT2 yearsYouTube sets this cookie via embedded youtube-videos and registers anonymous statistical data.\n\n\n\n\n\n\n                                Advertisement                            \n\n\nadvertisement\n\n\n\n\nAdvertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads.\nCookieDurationDescriptionVISITOR_INFO1_LIVE5 months 27 daysA cookie set by YouTube to measure bandwidth that determines whether the user gets the new or old player interface.YSCsessionYSC cookie is set by Youtube and is used to track the views of embedded videos on Youtube pages.yt-remote-connected-devicesneverYouTube sets this cookie to store the video preferences of the user using embedded YouTube video.yt-remote-device-idneverYouTube sets this cookie to store the video preferences of the user using embedded YouTube video.\n\n\n\n\n\n\n                                Others                            \n\n\nothers\n\n\n\n\nOther uncategorized cookies are those that are being analyzed and have not been classified into a category as yet.\nCookieDurationDescriptionmv30 minutesNo description\n\n\n\n\n\n\n\n\n\n\n\n\nSave & Accept\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://sosv.com": "\n\n\n\n\n\n\n\n\nSOSV - Deep Tech for Human and Planetary Health\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkip to content\n\n\nInvestors: Register for HAX’s Sept. 11 San Francisco Demo Day\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrograms\nClimate 100\nHealth 100\nPortfolio\nNews\nEvents\nJobs\nTeam\nAbout\nInvest\n\n\n\t\t\t\t\t\tCopyright All Rights Reserved © 2024 SOSV Investments LLC. All SOSV registered trademarks are owned by SOSV Investments LLC\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDeep Tech for Human and Planetary Health\nSOSV is a global venture capital firm that offers multi-stage investment starting in our deeply resourced, deep tech startup programs, IndieBio and HAX, with locations in New York City, Newark and San Francisco. \n\nLEARN MORE\n\n\n\n\n\n\n\n\n\n\n\n                TechCrunch               \n\n                SOSV Closes $306M Deep Tech Fund for Human and Planetary Health              \n\n\n\n\n\n\n\n\n                    Aug 01, 2024                \n\n\n                Announcing HAX’s Sept. 11 San Francisco Demo Day              \n\n\n\n\n\n\n\n\n                    Jul 17, 2024                \n\n\n                Announcing the fourth annual SOSV Climate Tech Summit              \n\n\n\n\n\n\n                  BetaKit                \n\n                    Jul 30, 2024                \n\n\n                Afynia raises $2 million CAD to bring endometriosis test to market              \n\n\n\n\n\n\n                  Founder Stories                \n\n                    Jul 29, 2024                \n\n\n                unspun’s Weaving Machines Aim to Fix Apparel’s Waste and Carbon Problem              \n\n\n\n\n\nSee all news\n\n\n\n\n\n\n\n\n\n\n\n\n\nWe help startups go further, faster.\n\n\n\n\n\n\n\n\n3\n\n\n                Lab & Office Locations              \n\n\n\n80,000\n\n\n                Sq ft Lab & Office Space              \n\n\n\n225 \n\n\n                HAX & IndieBio Grads  2020-2023              \n\n\n\n44% \n\n\n                Founders with PhDs2020-2023              \n\n\n\n$4.02B \n\n\n                Raised Post-program 2020-2023              \n\n\n\n1000+\n\n\n                SOSV Co-investors              \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                    SOSV Founders\n                  \n\n                    Walden Lam, Kevin Martin and Beth Esponnette                  \n\n                    Co-founders, unspun                  \n\n                    unspun’s Weaving Machines Aim to Fix Apparel’s Waste and Carbon Problem                  \n\nFunded with $57 million from DCVC, Lowercarbon Capital and SOSV, among others, unspun aims to eliminate 1% of global carbon emissions \n\n\n\nREAD PROFILE\n \n\n\n\n\n\n\n\n\n\n                    SOSV Founders\n                  \n\n                    Karim Pichara and Matias Muchnik                  \n\n                    Co-founders, NotCo                  \n\n                    NotCo’s plant-based foods are on store shelves, but its AI engine “Giuseppe” is the real business                  \n\nWhile it might look like a plant-based food company, NotCo is in the data and AI business—and aims to disrupt R&D in many industries that use animal and plant ingredients.\n\n\n\nREAD PROFILE\n \n\n\n\n\n\n\n\n\n\n                    SOSV Founders\n                  \n\n                    Miranda Wang and Jeanny Yao                  \n\n                    Co-founders, Novoloop                  \n\n                    Novoloop Is Upcycling Your Future                  \n\nMiranda Wang and Jeanny Yao have an uncanny talent for finding value where others see waste. Their plastics upcycling company, Novoloop, just raised a $21m Series A to prove it.\n\n\n\nREAD PROFILE\n \n\n\n\n\n\n\n\n\n\n                    SOSV Founders\n                  \n\n                    Declan Jones, Max Huisman, Deniz Kent                   \n\n                    Co-founders, Prolific Machines                  \n\n                    Prolific Machines Has The Key to Affordable Cultured Meat                  \n\nWhile volunteering in a Syrian refugee camp, stem cell biologist Deniz Kent saw what climate change could do to humanity at a massively greater scale. He co-founded Prolific Machines with Max Huisman and Declan Jones to address a top source of greenhouse gas emissions: livestock.\n\n\n\nREAD PROFILE\n \n\n\n\n\n\n\n\n\n\n                    SOSV Founders\n                  \n\n                    Chiu Chau                  \n\n                    Co-Founder, OpenTrons                  \n\n                    Chiu Chau Reboots a Robot into a Billion Dollar Business                  \n\nIt was 2015, and Chiu Chau was on the ropes. He had pitched nearly 150 venture capital firms. No one would invest. Everyone doubted the startup with the open-source laboratory robot.\n\n\n\nREAD PROFILE\n \n\n\n\n\n\n\n\n\n\n                    SOSV Founders\n                  \n\n                    Uma Valeti                  \n\n                    Founder and CEO, Upside Foods                  \n\n                    Upside Foods Serves Up a Sustainable Future                  \n\nTo find the future of food, you may have to look no further than Emeryville, CA, a small city by the San Francisco Bay, where Upside Foods has built a 53,000-square-foot production facility for cultivated meat.\n\n\n\nREAD PROFILE\n \n\n\n\n\n\n\n\n\n\n                    SOSV Founders\n                  \n\n                    Radhika Patil and Bharath Patil                  \n\n                    Co-founders, Cradlewise                  \n\n                    Sleeping Beauty                  \n\nIn a timeless dilemma for new parents, Radhika and her husband Bharath discovered early that their baby daughter was a fussy sleeper. The situation left them tired and frustrated; being effective at work became a challenge.\n\n\n\nREAD PROFILE\n \n\n\n\n\n\n\n\n\n\n                    SOSV Founders\n                  \n\n                    Antonio Rocha, GIlberto Loureiro, and Paulo Ribeiro                  \n\n                    Co-founders, Smartex                  \n\n                    Smartex is Creating the Textile Factory of the Future                  \n\nGilberto Loureiro grew up inspecting fabrics in a Portuguese textile factory. With Smartex, he and co-founders Antonio Rocha and Paulo Ribeiro are eliminating textile defects—and their enormous cost both to manufacturers and the environment. \n\n\n\nREAD PROFILE\n \n\n\n\n\n\n\n\n\n\n                    SOSV Founders\n                  \n\n                    Adebayo Alonge and Amy Kao                  \n\n                    Co-founders of RxAll                  \n\n                    RxAll’s Life-Saving Deep Tech for African Pharmacies                  \n\nAdebayo (“Ade”) Alonge and Amy Kao, co-founders of RxAll had invented a handheld scanner for detecting counterfeit prescription drugs—an illicit, multibillion-dollar industry that kills an estimated 1 million people annually around the world and 100,000 in Africa.\n\n\n\nREAD PROFILE\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                  IndieBio SF office                \n\n\n\n\nFirst Check in Deep TechTM\n\nWith more than $1.5 billion in assets under management, SOSV makes 200+ deep tech investments per year, including 75 pre-seed and seed rounds in startups that join our industry leading HAX and IndieBio startup development programs. Our pre-seed, “first checks” range from $250,000 to $525,000, and we follow on in later rounds. SOSV is the most active deep tech venture investor in the world.\n\n\n\n\n\n\n\n\n\n\n                  Smartex founders, HAX                \n\n\n\nHuman & Planetary Health\n\nSOSV’s core mission is to launch visionary founders who are destined to have a radically beneficial impact on human and planetary health. That ranges from the vast effort to make humanity’s means of production more sustainable to curing disease and improving healthcare. As of April 2023, our top 100 climate tech companies have an aggregate valuation of $11.69 billion and have raised $3.77 billion, while our top 100 health startups are valued at $6.47 billion with $1.42 billion raised. SOSV is consistently ranked by PitchBook as a top investor in both categories.\n\n\n\n\n\n\n\n\n\n\n                  SOSV Founder Sean O’Sullivan                \n\n\n\n\nBuilt for Builders\n\nSOSV’s HAX and IndieBio programs offer 80,000 square feet of bio, chem, mech and EE labs at three locations—New York, Newark and San Francisco. Our founders have access to sophisticated lab and fabrication equipment ranging from 3D printers to mass spectrometers, and they work side-by-side with our GPs and staff to turn their research into scalable commercial reality. 62% of program graduates raise their next round within 12 months.\n\n\n\n\n\n\n\n\n\n\n                  Prototype development at HAX                \n\n\n\n\nThat Next Check Too\n\nSOSV’s pre-seed or seed investment is just the beginning. With more than 1,000 co-investors in SOSV’s syndicates, we have a powerful global network to match investors with our founders for series seed, A and beyond. We join those later rounds as well, through our core funds as well as the SOSV Select Fund. Between 2020 to 2023, our deep tech portfolio raised $4.02 billion and SOSV joined 449 rounds.\n\n\n\n\n\n\n\n\n\n\n                  IndieBio SF lab                \n\n\n\n\nDiversity for the Win\n\nSOSV believes that great founders come from all geographies, genders and cultures. Our 1,690 deep tech founders represent 75 nationalities and operate in 40 countries. 44% have PhDs earned at 70 universities around the world. And 33% of our startups have at least one female founder. What all SOSV founders have in common is a drive to deliver incredible science and technology that will make the world a better place today and for generations to come.\n\n\n\n\n\n\n\n\n\n\n                  IndieBio SF demo day                \n\n\n\n\nSOSV for Life \nThe friendships founders build in the HAX and IndieBio programs last forever, and so do their ties to our general partners, who long remain trusted advisors. We continue helping founders raise funds, make connections, and win press coverage long after they finish our programs. We also produce unique, high profile events to showcase our founders as well as drive the overall climate and health ecosystem, including the SOSV Climate Tech Summit, the SOSV VC-Founder Matchups (Sustainable Industry, Health, and Climate), and our SOSV Climate 100 and Health 100 lists. SOSV is for life.\n\n\n\n\n\n\n\n\n\n\nSOSV Programs\n\n\n\nSOSV staff at HAX and IndieBio work with founders around the world\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n                    Helping hard tech founders tap into the world’s premier ecosystems for real-world product development, manufacturing and fundraising.                  \n\n\nLearn more\n\n\nApply\n\n\n\n\n\n\n\n\n\n\n                    Dedicated to turning scientists into entrepreneurs determined to save lives and save the planet, based in San Francisco and New York City.                  \n\n\nLearn more\n\n\nApply\n\n\n\n\n\n\nNot sure which program is right for your startup?\nLearn more about SOSV pre-seed investment and startup  development programs.\n\n\n\n\n\n\n\n\n\n\n\n\n\nA Day in the Life of SOSV\n\nScenes from SOSV’s offices in San Francisco, New York, Newark, and Shenzhen.\n\n\n\n\n\n\n\n\n\nHAX\n\n\n\n\nIndieBio NY\n\n\n\n\nIndieBio SF\n\n\n\n\nHAX\n\n\n\n\nRobotics at HAX\n\n\n\n\n\n\n                Follow us\n              \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nInvest with SOSV\n\nSOSV welcomes co-investors in portfolio companies as well as limited partners in SOSV funds\n\n\n\n\n\n\n\nInvest in our Companies\n\nSOSV’s portfolio companies raise 200 follow-on rounds each year, and the co-investors in SOSV’s 1000+ portfolio number in the 100s. SOSV aims to build a global, diverse network of investors, and new co-investors are always welcome.\n\n\nLEARN MORE\n\n\n\n\n\nInvest in our Funds\n\nSOSV is a multi-stage VC that invests in 100+ pre-seed startups each year and joins hundreds of follow-on rounds through SOSV’s core and select funds. New limited partners interested in “human and planetary health” are welcome.\n\n\nLEARN MORE\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nGet Monthly Email Updates from SOSV\n\n\n\n\n\n\n\n\n\n\n\n\n\nFirst name(Required) Last name(Required) Email(Required)\n\nHiddensubscriptions \n  \n\n\n\n\n\n\n\n\n\n\n\n\nWe don’t spam. Our Privacy Statement and Terms of Use apply.\nThe forms on this site are protected by reCAPTCHA and the Google Privacy Policy and Terms of Service apply.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLearn\n\nAbout SOSV\nOur Programs\nOur Portfolio\nOur Team\nLegal FAQ\nPress & Media\nBrand Guidelines\n\n\nApply\n\nApplication FAQ\nApply\n\n\nInvest\n\nInvest in our Funds\nInvest in our Companies\n\n\nParticipate\n\nJobs at our Companies\nOur Events\nJoin Talent network\nGet Email Updates\nSOSV Consortium\nMomentum Program\n\n\n \n\n\n\n\n\n\t\t\t\t\tCopyright All Rights Reserved © 2024 SOSV Investments LLC. All SOSV registered trademarks are owned by SOSV Investments LLC\n\t\t\t\t\t\n\nPrivacy Statement\nTerms of Use\nCookie Policy\nDisclaimer\nCommunication Policy\nCode of Conduct\nPress & Media\n \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\t\t\t\tStay In The Know\t\t\t\n\nCurated trends and insights on deep tech for human and planetary health.\n\n\n\n\n\n\nFirst name(Required) Last name(Required) Email(Required)\n\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\nWe don’t spam. Our Privacy Statement and Terms of Use apply.\n\n\n\n\n\n\nWe use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept All”, you consent to the use of ALL the cookies or visit \"Cookie Settings\" to provide a controlled consent. Cookie PolicyCookie SettingsAccept AllManage consent\n\n\n\n\nClose\n\n\n\n\n\n\nCookie Preferences \nThis website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience.\n\n \n\n\n\n\n\n                                Necessary                            \n\n\n Necessary \n\n\n                                    Always Enabled                                \n\n\n\nNecessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously.\nCookieDurationDescriptionAWSELBsessionAssociated with Amazon Web Services and created by Elastic Load Balancing, AWSELB cookie is used to manage sticky sessions across production servers.cookielawinfo-checkbox-advertisement1 yearSet by the GDPR Cookie Consent plugin, this cookie is used to record the user consent for the cookies in the \"Advertisement\" category .cookielawinfo-checkbox-analytics11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checkbox-functional11 monthsThe cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\".cookielawinfo-checkbox-necessary11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".cookielawinfo-checkbox-others11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other.cookielawinfo-checkbox-performance11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\".viewed_cookie_policy11 monthsThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data.\n\n\n\n\n\n\n                                Functional                            \n\n\nfunctional\n\n\n\n\nFunctional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features.\nCookieDurationDescription__Host-airtable-session1 yearContains a specific ID for the current Airtable.com session. This is necessary for the integartion of Airtable lists.__Host-airtable-session.sig1 yearContains a specific ID for the current Airtable.com session. This is necessary for the integartion of Airtable lists.brw1 yearDetects and logs potential errors on third-party provided functions of airtable.com integration.community_token30 daysThis cookie is used to track authenticated users in SOSV's Community Portal.login-status-ppastThis cookie is necessary for the integartion of Airtable lists.\n\n\n\n\n\n\n                                Performance                            \n\n\nperformance\n\n\n\n\nPerformance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors.\nCookieDurationDescriptionAWSELBCORSsessionThis cookie is used by Elastic Load Balancing from Amazon Web Services to effectively balance load on the servers.\n\n\n\n\n\n\n                                Analytics                            \n\n\nanalytics\n\n\n\n\nAnalytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc.\nCookieDurationDescription_ga2 yearsThe _ga cookie, installed by Google Analytics, calculates visitor, session and campaign data and also keeps track of site usage for the site's analytics report. The cookie stores information anonymously and assigns a randomly generated number to recognize unique visitors._gat_UA-45933216-181 minuteA variation of the _gat cookie set by Google Analytics and Google Tag Manager to allow website owners to track visitor behaviour and measure site performance. The pattern element in the name contains the unique identity number of the account or website it relates to._gid1 dayInstalled by Google Analytics, _gid cookie stores information on how visitors use a website, while also creating an analytics report of the website's performance. Some of the data that are collected include the number of visitors, their source, and the pages they visit anonymously.CONSENT2 yearsYouTube sets this cookie via embedded youtube-videos and registers anonymous statistical data.\n\n\n\n\n\n\n                                Advertisement                            \n\n\nadvertisement\n\n\n\n\nAdvertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads.\nCookieDurationDescriptionVISITOR_INFO1_LIVE5 months 27 daysA cookie set by YouTube to measure bandwidth that determines whether the user gets the new or old player interface.YSCsessionYSC cookie is set by Youtube and is used to track the views of embedded videos on Youtube pages.yt-remote-connected-devicesneverYouTube sets this cookie to store the video preferences of the user using embedded YouTube video.yt-remote-device-idneverYouTube sets this cookie to store the video preferences of the user using embedded YouTube video.\n\n\n\n\n\n\n                                Others                            \n\n\nothers\n\n\n\n\nOther uncategorized cookies are those that are being analyzed and have not been classified into a category as yet.\nCookieDurationDescriptionmv30 minutesNo description\n\n\n\n\n\n\n\n\n\n\n\n\nSave & Accept\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://sosv.com/programs/": "\n\n\n\n\n\n\n\n\nPrograms - SOSV\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkip to content\n\n\nInvestors: Register for HAX’s Sept. 11 San Francisco Demo Day\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrograms\nClimate 100\nHealth 100\nPortfolio\nNews\nEvents\nJobs\nTeam\nAbout\nInvest\n\n\n\t\t\t\t\t\tCopyright All Rights Reserved © 2024 SOSV Investments LLC. All SOSV registered trademarks are owned by SOSV Investments LLC\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\nSOSV Programs\n\nCommitted to helping founders create disruptive products and win venture capital investment \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHAX is the world’s first and most active pre-seed program focused on hard tech startups. HAX helps founders tap into the world’s premier ecosystems for real-world product development, manufacturing and fundraising.\n\nThe flagship HAX program provides 6-months collaborative residency, hands-on engineering support, and an initial investment package of $500,000 with millions available in SOSV follow-on funding. 320 startups have graduated from the program since 2012 with cumulative value of over $9.8 billion. HAX graduates have raised nearly $2.3 billion, including $174 million from SOSV.\nIn April 2024, HAX opened its flagship, 35,000 sq.ft. office in Newark, NJ, in partnership with the New Jersey Economic Development Authority (NJEDA), which is providing $25 million over 5 years to support the Newark office. \nThe program hosts 20 companies per year and focus on startups in manufacturing, healthcare, and climate tech. HAX has 24 companies on the SOSV Climate Tech 100 and 37 companies on the SOSV Health Tech 100. Among HAX’s best known alumni are Opentrons, R-Zero, Youibot, Smartex, and Avidbots.\nSOSV general partner Duncan Turner is the managing director of HAX and leads the Newark program with SOSV partners Ji Ke, Andy Gollach and Susan Schofer, who is also HAX’s chief science officer. \nVisit HAX.\n\n\nMORE\nAPPLY NOW\n\n\n\n\n\n\n\n\n\n\n\n\n\nIndieBio is the world’s first and most active pre-seed opportunity for startups in human and planetary health. IndieBio helps scientist entrepreneurs harness disruptive products and processes so that they can secure venture capital.\n\nIndieBio works virtually or in-person with founders for four-months, providing daily, 1:1 support from staff scientists engineers and mentors in well equipped laboratory spaces shared with a cohort of 10-15 companies. Companies receive an investment package of  $250,000 – $525,000, and their choice of IndieBio locations, either New York City or San Francisco.Some 250 companies have graduated from IndieBio since 2014, and they have gone on to raise $2.9 billion, including over $190 million from SOSV, and in aggregate a valuation of $8.2 billion.\nIn 2020, Indiebio announced a $25 million project with The Partnership for New York City and New York state to open IndieBio’s program in New York City. IndieBio has 44 companies on the SOSV Human Health 100 and 58 companies on the SOSV Climate Tech 100. Among IndieBio’s best known alumni are Upside Foods, Perfect Day,  Notco, and The Every Company.  \nGeneral Partners Po Bronson, Pae Wu (also CTO)  and Mohan Iyer lead IndieBio SF and General Partner Stephen Chambers oversees IndieBio in NYC. SOSV Partner Sabriya Stukes is the Chief Scientific Officer at IndieBio NY. \nVisit IndieBio.\n\n\nMORE\nAPPLY NOW\n\n\n\n\n\n\n\n\n\n\n\n\n\nChoose SOSV for the long-term\n\n\n\n\n\n\nThe journey starts in SOSV’s pre-seed programs and continues long afterward as SOSV continues to invest in series seed, series A and beyond as top performers proceed to raise more capital with new lead investors. SOSV invests only in the graduates of SOSV’s pre-seed programs.\n\n \n\n\n\n$500k\n\n\n                Maximum SOSV invests at pre-seed              \n\n\n\n80%\n\n\n                Percentage of SOSV capital invested in alums              \n\n\n\n27\n\n\n                Rounds >$10M joined in 2022              \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSOSV portfolio companies raise from the best firms in venture \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nMeet our Companies\n\n\nOur top companies are unicorns and global leaders, recognized by consumers and industrial partners alike.\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n                    OpenTrons                  \n\nLiquid-handling robot for laboratory automation.\n\n\n\n                      Learn more\n                    \n\n\n\n\n\n\n\n\n \n\n\n\n                    NotCo                  \n\nFood technology company producing plant-based meat and dairy alternatives using AI algorithms.\n\n\n\n                      Learn more\n                    \n\n\n\n\n\n\n\n\n \n\n\n\n                    Upside Foods                  \n\nMaking your favorite food a force for good.\n\n\n\n                      Learn more\n                    \n\n\n\n\n\n\n\n\n \n\n\n\n                    R-Zero                  \n\nUV-C disinfection for businesses\n\n\n\n                      Learn more\n                    \n\n\n\n\n\n\n\n\n \n\n\n\n                    Neptune Robotics                  \n\nAn underwater drone for the marine industry.\n\n\n\n                      Learn more\n                    \n\n\n\n\n\n\n\n\n \n\n\n\n                    Allozymes                  \n\nFast and affordable enzyme development platform.\n\n\n\n                      Learn more\n                    \n\n\n\n\n\n\n\n\n \n\n\n\n                    Perfect Day                  \n\nSustainable, animal-free dairy and protein.\n\n\n\n                      Learn more\n                    \n\n\n\n\n\n\n\n\n \n\n\n\n                    Vertical Oceans                  \n\nSmart urban aquaculture.\n\n\n\n                      Learn more\n                    \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLearn\n\nAbout SOSV\nOur Programs\nOur Portfolio\nOur Team\nLegal FAQ\nPress & Media\nBrand Guidelines\n\n\nApply\n\nApplication FAQ\nApply\n\n\nInvest\n\nInvest in our Funds\nInvest in our Companies\n\n\nParticipate\n\nJobs at our Companies\nOur Events\nJoin Talent network\nGet Email Updates\nSOSV Consortium\nMomentum Program\n\n\n \n\n\n\n\n\n\t\t\t\t\tCopyright All Rights Reserved © 2024 SOSV Investments LLC. All SOSV registered trademarks are owned by SOSV Investments LLC\n\t\t\t\t\t\n\nPrivacy Statement\nTerms of Use\nCookie Policy\nDisclaimer\nCommunication Policy\nCode of Conduct\nPress & Media\n \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\t\t\t\tStay In The Know\t\t\t\n\nCurated trends and insights on deep tech for human and planetary health.\n\n\n\n\n\n\nFirst name(Required) Last name(Required) Email(Required)\n\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\nWe don’t spam. Our Privacy Statement and Terms of Use apply.\n\n\n\n\n\n\nWe use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept All”, you consent to the use of ALL the cookies or visit \"Cookie Settings\" to provide a controlled consent. Cookie PolicyCookie SettingsAccept AllManage consent\n\n\n\n\nClose\n\n\n\n\n\n\nCookie Preferences \nThis website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience.\n\n \n\n\n\n\n\n                                Necessary                            \n\n\n Necessary \n\n\n                                    Always Enabled                                \n\n\n\nNecessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously.\nCookieDurationDescriptionAWSELBsessionAssociated with Amazon Web Services and created by Elastic Load Balancing, AWSELB cookie is used to manage sticky sessions across production servers.cookielawinfo-checkbox-advertisement1 yearSet by the GDPR Cookie Consent plugin, this cookie is used to record the user consent for the cookies in the \"Advertisement\" category .cookielawinfo-checkbox-analytics11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checkbox-functional11 monthsThe cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\".cookielawinfo-checkbox-necessary11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".cookielawinfo-checkbox-others11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other.cookielawinfo-checkbox-performance11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\".viewed_cookie_policy11 monthsThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data.\n\n\n\n\n\n\n                                Functional                            \n\n\nfunctional\n\n\n\n\nFunctional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features.\nCookieDurationDescription__Host-airtable-session1 yearContains a specific ID for the current Airtable.com session. This is necessary for the integartion of Airtable lists.__Host-airtable-session.sig1 yearContains a specific ID for the current Airtable.com session. This is necessary for the integartion of Airtable lists.brw1 yearDetects and logs potential errors on third-party provided functions of airtable.com integration.community_token30 daysThis cookie is used to track authenticated users in SOSV's Community Portal.login-status-ppastThis cookie is necessary for the integartion of Airtable lists.\n\n\n\n\n\n\n                                Performance                            \n\n\nperformance\n\n\n\n\nPerformance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors.\nCookieDurationDescriptionAWSELBCORSsessionThis cookie is used by Elastic Load Balancing from Amazon Web Services to effectively balance load on the servers.\n\n\n\n\n\n\n                                Analytics                            \n\n\nanalytics\n\n\n\n\nAnalytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc.\nCookieDurationDescription_ga2 yearsThe _ga cookie, installed by Google Analytics, calculates visitor, session and campaign data and also keeps track of site usage for the site's analytics report. The cookie stores information anonymously and assigns a randomly generated number to recognize unique visitors._gat_UA-45933216-181 minuteA variation of the _gat cookie set by Google Analytics and Google Tag Manager to allow website owners to track visitor behaviour and measure site performance. The pattern element in the name contains the unique identity number of the account or website it relates to._gid1 dayInstalled by Google Analytics, _gid cookie stores information on how visitors use a website, while also creating an analytics report of the website's performance. Some of the data that are collected include the number of visitors, their source, and the pages they visit anonymously.CONSENT2 yearsYouTube sets this cookie via embedded youtube-videos and registers anonymous statistical data.\n\n\n\n\n\n\n                                Advertisement                            \n\n\nadvertisement\n\n\n\n\nAdvertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads.\nCookieDurationDescriptionVISITOR_INFO1_LIVE5 months 27 daysA cookie set by YouTube to measure bandwidth that determines whether the user gets the new or old player interface.YSCsessionYSC cookie is set by Youtube and is used to track the views of embedded videos on Youtube pages.yt-remote-connected-devicesneverYouTube sets this cookie to store the video preferences of the user using embedded YouTube video.yt-remote-device-idneverYouTube sets this cookie to store the video preferences of the user using embedded YouTube video.\n\n\n\n\n\n\n                                Others                            \n\n\nothers\n\n\n\n\nOther uncategorized cookies are those that are being analyzed and have not been classified into a category as yet.\nCookieDurationDescriptionmv30 minutesNo description\n\n\n\n\n\n\n\n\n\n\n\n\nSave & Accept\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://sosv.com/sosv-climate-tech-100-list/": "\n\n\n\n\n\n\n\n\nClimate Tech 100 - SOSV\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkip to content\n\n\nInvestors: Register for HAX’s Sept. 11 San Francisco Demo Day\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrograms\nClimate 100\nHealth 100\nPortfolio\nNews\nEvents\nJobs\nTeam\nAbout\nInvest\n\n\n\t\t\t\t\t\tCopyright All Rights Reserved © 2024 SOSV Investments LLC. All SOSV registered trademarks are owned by SOSV Investments LLC\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe SOSV Climate Tech 100\n\n\nThe SOSV Climate Tech 100 is an annual list of the top climate companies in the SOSV portfolio. They range from unicorns making a huge impact to pre-seed startups emerging from SOSV programs.\n\n\n\nSEE THE FULL LIST\n\n\n\n\n\n\n\n\n\n\n$11.1B\n\n\n                Aggregate Value              \n\n\n\n$3.68B\n\n\n                Capital Raised              \n\n\n\n37%\n\n\n                Female Founders              \n\n\n\n$151M\n\n\n                SOSV Capital              \n\n\n\n51%\n\n\n                PhD Founders              \n\n\n\n18\n\n\n                Countries              \n\n\n\n\n\n\n\nAbout Climate Tech 100\n\nSOSV’s core mission is human and planetary health, and the SOSV Climate Tech 100 springs from that commitment. We publish the list each year to showcase the highest potential climate startups in SOSV’s portfolio. \n\nThe 2024 SOSV Climate Tech 100 list includes startups in every climate category, from energy and transport to manufacturing and the circular economy. \n\nFor the 2024 edition of the SOSV Climate Tech 100, we added 30 new companies from our portfolio. The aggregate valuation of the 100 reached $11.1 billion and in total the companies have raised $3.68 billion to date, including $151 million from SOSV. 22 companies on the list saw valuation gains in the past year, despite a 30% drop last year in capital flowing to climate companies.\n\n\n\nWe fully expect that the climate category will roar forward again soon because it must for humanity’s sake, of course, but also because there are so many remarkable tailwinds, including the adjacent themes of industrial sustainability and reshoring US production capabilities. \n\n\n\n\n\n\n\n\n\n                SEAN O’SULLIVAN              \n\n                Managing General Partner              \n\n\n\n\n\nSOSV is a global leader in climate tech investing, thanks to our two pre-seed startup development programs, HAX, based in Newark, which focuses on hard tech startups, and IndieBio, based in San Francisco and New York City, which focuses of bio-tech driven startups. Together they help launch more than 80 new companies each year in human and planetary health, and SOSV continues to invest as the graduates advance through later rounds. \n\nPitchbook ranks SOSV the most active in climate tech investment since 2018, as well as most active in agtech, and carbon emissions tech. \n\nIn order to expand the fledgling climate startup ecosystem, we launched the annual SOSV Climate Tech Summit in 2021 More than 4,000 people participated in the 2023 two-day virtual event that included speakers Vinod Khosla, Gaurab Chakrabarti, Uma Valeti, Professor Jesse Jenkins, Sean O’Sullivan, and many more. Register today for this year’s SOSV Climate Tech Summit. \n\nTo read about past lists, check out climate 100 posts for 2021 and 2022 and 2023.\n\n\n\n\n\n\nLatest News\n\n\n\n\n\n                July 17, 2024              \n\n                Announcing the fourth annual SOSV Climate Tech Summit              \n\n\n\n\n\n                July 2, 2024              \n\n                Artyc has raised $14M to disrupt the cold chain with battery powered coolers              \n\n\n\n\n\n                June 10, 2024              \n\n                Prolific Machines nabs $55M for its unique optogenetic approach to growing cells              \n\n\n\n\n\n                May 24, 2024              \n\n                Voyage Foods nabs $52M in fresh funding for cocoa-free chocolate              \n\n\n\n\n\n                April 21, 2024              \n\n                Announcing the 2024 SOSV Climate Tech 100              \n\n\n\n\n\n                April 16, 2024              \n\n                SOSV Closes $306M Deep Tech Fund for Human and Planetary Health              \n\n\n\n\n\n                April 8, 2024              \n\n                Voyage Foods partners with Cargill to scale sustainable chocolate alternatives              \n\n\n\n\n\nSee all Climate Tech 100 news\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSOSV’s Climate Tech 100 – The List \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nClimate Tech 100 Ecosystem\n\n\n\n\n\n\n\n\n\n\nRegister for the SOSV Climate Tech Summit (Oct. 14-18)\nJoin thousands of founders, investors, technologists and more at SOSV’s second annual free and virtual climate tech event.\nRegister Now\n\n\nApply to the HAX and IndieBio programs \nJoin the many climate tech companies in SOSV’s programs. Applications are open year round for HAX (Newark, Shenzhen) and IndieBio (NYC and San Francisco).\nApply to HAX\nApply to IndieBio\n\n\nWork in Climate Tech\nSOSV’s climate tech companies are hiring. Research job openings and join the Talent Network to get alerts on new openings.\nBrowse companies and roles\nJoin Talent Network\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLearn\n\nAbout SOSV\nOur Programs\nOur Portfolio\nOur Team\nLegal FAQ\nPress & Media\nBrand Guidelines\n\n\nApply\n\nApplication FAQ\nApply\n\n\nInvest\n\nInvest in our Funds\nInvest in our Companies\n\n\nParticipate\n\nJobs at our Companies\nOur Events\nJoin Talent network\nGet Email Updates\nSOSV Consortium\nMomentum Program\n\n\n \n\n\n\n\n\n\t\t\t\t\tCopyright All Rights Reserved © 2024 SOSV Investments LLC. All SOSV registered trademarks are owned by SOSV Investments LLC\n\t\t\t\t\t\n\nPrivacy Statement\nTerms of Use\nCookie Policy\nDisclaimer\nCommunication Policy\nCode of Conduct\nPress & Media\n \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\t\t\t\tStay In The Know\t\t\t\n\nCurated trends and insights on deep tech for human and planetary health.\n\n\n\n\n\n\nFirst name(Required) Last name(Required) Email(Required)\n\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\nWe don’t spam. Our Privacy Statement and Terms of Use apply.\n\n\n\n\n\n\nWe use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept All”, you consent to the use of ALL the cookies or visit \"Cookie Settings\" to provide a controlled consent. Cookie PolicyCookie SettingsAccept AllManage consent\n\n\n\n\nClose\n\n\n\n\n\n\nCookie Preferences \nThis website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience.\n\n \n\n\n\n\n\n                                Necessary                            \n\n\n Necessary \n\n\n                                    Always Enabled                                \n\n\n\nNecessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously.\nCookieDurationDescriptionAWSELBsessionAssociated with Amazon Web Services and created by Elastic Load Balancing, AWSELB cookie is used to manage sticky sessions across production servers.cookielawinfo-checkbox-advertisement1 yearSet by the GDPR Cookie Consent plugin, this cookie is used to record the user consent for the cookies in the \"Advertisement\" category .cookielawinfo-checkbox-analytics11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checkbox-functional11 monthsThe cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\".cookielawinfo-checkbox-necessary11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".cookielawinfo-checkbox-others11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other.cookielawinfo-checkbox-performance11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\".viewed_cookie_policy11 monthsThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data.\n\n\n\n\n\n\n                                Functional                            \n\n\nfunctional\n\n\n\n\nFunctional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features.\nCookieDurationDescription__Host-airtable-session1 yearContains a specific ID for the current Airtable.com session. This is necessary for the integartion of Airtable lists.__Host-airtable-session.sig1 yearContains a specific ID for the current Airtable.com session. This is necessary for the integartion of Airtable lists.brw1 yearDetects and logs potential errors on third-party provided functions of airtable.com integration.community_token30 daysThis cookie is used to track authenticated users in SOSV's Community Portal.login-status-ppastThis cookie is necessary for the integartion of Airtable lists.\n\n\n\n\n\n\n                                Performance                            \n\n\nperformance\n\n\n\n\nPerformance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors.\nCookieDurationDescriptionAWSELBCORSsessionThis cookie is used by Elastic Load Balancing from Amazon Web Services to effectively balance load on the servers.\n\n\n\n\n\n\n                                Analytics                            \n\n\nanalytics\n\n\n\n\nAnalytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc.\nCookieDurationDescription_ga2 yearsThe _ga cookie, installed by Google Analytics, calculates visitor, session and campaign data and also keeps track of site usage for the site's analytics report. The cookie stores information anonymously and assigns a randomly generated number to recognize unique visitors._gat_UA-45933216-181 minuteA variation of the _gat cookie set by Google Analytics and Google Tag Manager to allow website owners to track visitor behaviour and measure site performance. The pattern element in the name contains the unique identity number of the account or website it relates to._gid1 dayInstalled by Google Analytics, _gid cookie stores information on how visitors use a website, while also creating an analytics report of the website's performance. Some of the data that are collected include the number of visitors, their source, and the pages they visit anonymously.CONSENT2 yearsYouTube sets this cookie via embedded youtube-videos and registers anonymous statistical data.\n\n\n\n\n\n\n                                Advertisement                            \n\n\nadvertisement\n\n\n\n\nAdvertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads.\nCookieDurationDescriptionVISITOR_INFO1_LIVE5 months 27 daysA cookie set by YouTube to measure bandwidth that determines whether the user gets the new or old player interface.YSCsessionYSC cookie is set by Youtube and is used to track the views of embedded videos on Youtube pages.yt-remote-connected-devicesneverYouTube sets this cookie to store the video preferences of the user using embedded YouTube video.yt-remote-device-idneverYouTube sets this cookie to store the video preferences of the user using embedded YouTube video.\n\n\n\n\n\n\n                                Others                            \n\n\nothers\n\n\n\n\nOther uncategorized cookies are those that are being analyzed and have not been classified into a category as yet.\nCookieDurationDescriptionmv30 minutesNo description\n\n\n\n\n\n\n\n\n\n\n\n\nSave & Accept\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://sosv.com/sosv-human-health-100-list/": "\n\n\n\n\n\n\n\n\nSOSV 2024 Human Health 100 - SOSV\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSkip to content\n\n\nInvestors: Register for HAX’s Sept. 11 San Francisco Demo Day\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPrograms\nClimate 100\nHealth 100\nPortfolio\nNews\nEvents\nJobs\nTeam\nAbout\nInvest\n\n\n\t\t\t\t\t\tCopyright All Rights Reserved © 2024 SOSV Investments LLC. All SOSV registered trademarks are owned by SOSV Investments LLC\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nThe SOSV Human Health 100\n\n\nThe SOSV Human Health 100 is an annual list that presents the top companies in the SOSV portfolio. They range from unicorns making a huge impact to pre-seed startups emerging from SOSV programs.\n\n\n\nSEE THE FULL LIST\n\n\n\n\n\n\n\n\n\n\n$6.67B\n\n\n                Aggregate Value              \n\n\n\n16\n\n\n                Countries              \n\n\n\n$1.43B\n\n\n                Total Raised              \n\n\n\n35%\n\n\n                Female Founders              \n\n\n\n$99M\n\n\n                SOSV Invested              \n\n\n\n70%\n\n\n                PhD Founders              \n\n\n\n\n\n\n\nSOSV Human Health 100\n\nSOSV is committed to building deep tech startups focused on human and planetary health. Each year we produce the Human Health 100 to showcase our most exciting companies in the health category. We do the same with in the climate with our annual SOSV Climate Tech 100, which we publish in April. \n\nWe published the first SOSV Health Tech 100 in February 2022 in order to showcase our top health-related companies across our HAX and IndieBio startup development programs. The list also underscores SOSV’s strong performance on venture leaderboards for health investing, including strong rankings on PitchBook’s leaderboards for Healthcare devices & supplies, women’s health, pharma and biotech. \n\n\n\nAt SOSV, our vantage point for health is informed by living at the deep tech intersection represented by our startup development programs HAX, IndieBio and Orbit—the Shibuya Crossing of hardware, genetics, and frontier markets.\n\n\n\n\n\n\n\n\n\n                PO BRONSON              \n\n                General Partner, IndieBio              \n\n\n\n\n\nFrom SOSV’s standpoint, each company on the Human Health 100 represents a unique window into the very rapid advances taking place in fields as varied as cancer therapeutics, CRISPR platforms, various applications of AI, assistive robotics, and remote healthcare, to name a few. As SOSV general partner Po Bronson has argued, scientific and computational breakthroughs are seeding new products and startups at a breakneck pace even as the need for more cost-effective and scalable healthcare has never been more apparent.\n\nFor the 2024 edition of the Human Health 100, there are 16 new companies, which we detail in this post announcing the list. The aggregate valuation of the companies is $6.67 billion (up 3% from $6.47B in 2023), and all told the firms have raised $1.43 billion (up 1% from $1.42B in 2023). SOSV, which invests starting at pre-seed and continues through later stages, has invested $99 million (up 3% from $96M in 2023). Like all venture categories in the past year, health has slowed down considerably.\nAs with the SOSV Climate Tech 100, the diversity and sophistication of our health companies and founders is striking. 35% of the companies have a woman co-founder. The companies are located in 16 countries.  70% of the startups have at least one PhD co-founder. A  total of 52 companies graduated from the biology-centric IndieBio while another 38 hail from hard-tech focused HAX program and five from the SOSV Consortium.\nYou can read more about this year’s list here or review the Health 100 below. \n\n\n\nLatest News\n\n\n\n\n\n                July 30, 2024              \n\n                Afynia raises $2 million CAD to bring endometriosis test to market              \n\n\n\n\n\n                June 10, 2024              \n\n                Prolific Machines nabs $55M for its unique optogenetic approach to growing cells              \n\n\n\n\n\n                April 16, 2024              \n\n                SOSV Closes $306M Deep Tech Fund for Human and Planetary Health              \n\n\n\n\n\n                March 27, 2024              \n\n                Announcing HAX’s May 1st Demo Day              \n\n\n\n\n\n                March 14, 2024              \n\n                Catch HAX’s Duncan Turner and Susan Schofer in Boston April 24 & 25              \n\n\n\n\n\n                March 11, 2024              \n\n                Announcing the 2024 Human Health 100              \n\n\n\n\n\n                February 2, 2024              \n\n                2024: Deep Tech in the Spotlight              \n\n\n\n\n\n                January 22, 2024              \n\n                RizLab’s CytoTracker provides highly accurate white blood cell count with single drop of blood              \n\n\n\n\n\n                September 22, 2023              \n\n                UPSIDE Foods announces first commercial-scale plant; debuts “Road to Rubicon” series              \n\n\n\n\n\n                September 21, 2023              \n\n                Watch the 3 SOSV founder pitches that landed in the Top 20 at TechCrunch Disrupt Battlefield 2023              \n\n\n\n\n\nSee all Human Health 100 news\n\n\n\n\n\n\n\n\n\n\n\nThe 2024 Human Health 100  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSOSV’s Human Health Ecosystem\n\n\n\n\n\n\n\n\n\n\nSign up for SOSV’s monthly email updates\nGet the latest news from SOSV and the programs in their monthly updates on human health and other topics.\n\nSign Up for email updates\n\n\nApply to the HAX and IndieBio programs\nJoin the many health tech companies in SOSV’s programs. Applications are open year round for HAX (Newark, Shenzhen) and IndieBio (NYC and San Francisco).\nApply to HAX\nApply to IndieBio\n\n\nWork in Human Health\nSOSV’s health tech companies are hiring. Research job openings and join the Talent Network to get alerts on new openings.\nBrowse companies and roles\nJoin Talent Network\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLearn\n\nAbout SOSV\nOur Programs\nOur Portfolio\nOur Team\nLegal FAQ\nPress & Media\nBrand Guidelines\n\n\nApply\n\nApplication FAQ\nApply\n\n\nInvest\n\nInvest in our Funds\nInvest in our Companies\n\n\nParticipate\n\nJobs at our Companies\nOur Events\nJoin Talent network\nGet Email Updates\nSOSV Consortium\nMomentum Program\n\n\n \n\n\n\n\n\n\t\t\t\t\tCopyright All Rights Reserved © 2024 SOSV Investments LLC. All SOSV registered trademarks are owned by SOSV Investments LLC\n\t\t\t\t\t\n\nPrivacy Statement\nTerms of Use\nCookie Policy\nDisclaimer\nCommunication Policy\nCode of Conduct\nPress & Media\n \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\t\t\t\tStay In The Know\t\t\t\n\nCurated trends and insights on deep tech for human and planetary health.\n\n\n\n\n\n\nFirst name(Required) Last name(Required) Email(Required)\n\n\n  \n\n\n\n\n\n\n\n\n\n\n\n\n\nWe don’t spam. Our Privacy Statement and Terms of Use apply.\n\n\n\n\n\n\nWe use cookies on our website to give you the most relevant experience by remembering your preferences and repeat visits. By clicking “Accept All”, you consent to the use of ALL the cookies or visit \"Cookie Settings\" to provide a controlled consent. Cookie PolicyCookie SettingsAccept AllManage consent\n\n\n\n\nClose\n\n\n\n\n\n\nCookie Preferences \nThis website uses cookies to improve your experience while you navigate through the website. Out of these, the cookies that are categorized as necessary are stored on your browser as they are essential for the working of basic functionalities of the website. We also use third-party cookies that help us analyze and understand how you use this website. These cookies will be stored in your browser only with your consent. You also have the option to opt-out of these cookies. But opting out of some of these cookies may affect your browsing experience.\n\n \n\n\n\n\n\n                                Necessary                            \n\n\n Necessary \n\n\n                                    Always Enabled                                \n\n\n\nNecessary cookies are absolutely essential for the website to function properly. These cookies ensure basic functionalities and security features of the website, anonymously.\nCookieDurationDescriptionAWSELBsessionAssociated with Amazon Web Services and created by Elastic Load Balancing, AWSELB cookie is used to manage sticky sessions across production servers.cookielawinfo-checkbox-advertisement1 yearSet by the GDPR Cookie Consent plugin, this cookie is used to record the user consent for the cookies in the \"Advertisement\" category .cookielawinfo-checkbox-analytics11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Analytics\".cookielawinfo-checkbox-functional11 monthsThe cookie is set by GDPR cookie consent to record the user consent for the cookies in the category \"Functional\".cookielawinfo-checkbox-necessary11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookies is used to store the user consent for the cookies in the category \"Necessary\".cookielawinfo-checkbox-others11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Other.cookielawinfo-checkbox-performance11 monthsThis cookie is set by GDPR Cookie Consent plugin. The cookie is used to store the user consent for the cookies in the category \"Performance\".viewed_cookie_policy11 monthsThe cookie is set by the GDPR Cookie Consent plugin and is used to store whether or not user has consented to the use of cookies. It does not store any personal data.\n\n\n\n\n\n\n                                Functional                            \n\n\nfunctional\n\n\n\n\nFunctional cookies help to perform certain functionalities like sharing the content of the website on social media platforms, collect feedbacks, and other third-party features.\nCookieDurationDescription__Host-airtable-session1 yearContains a specific ID for the current Airtable.com session. This is necessary for the integartion of Airtable lists.__Host-airtable-session.sig1 yearContains a specific ID for the current Airtable.com session. This is necessary for the integartion of Airtable lists.brw1 yearDetects and logs potential errors on third-party provided functions of airtable.com integration.community_token30 daysThis cookie is used to track authenticated users in SOSV's Community Portal.login-status-ppastThis cookie is necessary for the integartion of Airtable lists.\n\n\n\n\n\n\n                                Performance                            \n\n\nperformance\n\n\n\n\nPerformance cookies are used to understand and analyze the key performance indexes of the website which helps in delivering a better user experience for the visitors.\nCookieDurationDescriptionAWSELBCORSsessionThis cookie is used by Elastic Load Balancing from Amazon Web Services to effectively balance load on the servers.\n\n\n\n\n\n\n                                Analytics                            \n\n\nanalytics\n\n\n\n\nAnalytical cookies are used to understand how visitors interact with the website. These cookies help provide information on metrics the number of visitors, bounce rate, traffic source, etc.\nCookieDurationDescription_ga2 yearsThe _ga cookie, installed by Google Analytics, calculates visitor, session and campaign data and also keeps track of site usage for the site's analytics report. The cookie stores information anonymously and assigns a randomly generated number to recognize unique visitors._gat_UA-45933216-181 minuteA variation of the _gat cookie set by Google Analytics and Google Tag Manager to allow website owners to track visitor behaviour and measure site performance. The pattern element in the name contains the unique identity number of the account or website it relates to._gid1 dayInstalled by Google Analytics, _gid cookie stores information on how visitors use a website, while also creating an analytics report of the website's performance. Some of the data that are collected include the number of visitors, their source, and the pages they visit anonymously.CONSENT2 yearsYouTube sets this cookie via embedded youtube-videos and registers anonymous statistical data.\n\n\n\n\n\n\n                                Advertisement                            \n\n\nadvertisement\n\n\n\n\nAdvertisement cookies are used to provide visitors with relevant ads and marketing campaigns. These cookies track visitors across websites and collect information to provide customized ads.\nCookieDurationDescriptionVISITOR_INFO1_LIVE5 months 27 daysA cookie set by YouTube to measure bandwidth that determines whether the user gets the new or old player interface.YSCsessionYSC cookie is set by Youtube and is used to track the views of embedded videos on Youtube pages.yt-remote-connected-devicesneverYouTube sets this cookie to store the video preferences of the user using embedded YouTube video.yt-remote-device-idneverYouTube sets this cookie to store the video preferences of the user using embedded YouTube video.\n\n\n\n\n\n\n                                Others                            \n\n\nothers\n\n\n\n\nOther uncategorized cookies are those that are being analyzed and have not been classified into a category as yet.\nCookieDurationDescriptionmv30 minutesNo description\n\n\n\n\n\n\n\n\n\n\n\n\nSave & Accept\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}]}