{"text": [{"https://sublime-energie.com": "\n\n\n\n\n\n\n\n\n\nAccueil - SUBLIME Energie\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\n\t\tAller au contenu\n\n \n\n\n\n\n\n\n\n \n \n\n\n\n\n\n\n\n\n \n\n\nNotre technologie\nL’entreprise\nNos actualités\n\n\n\n\n\nX\n \n\n\n\n\n\n\n\n\n\n\nContact\n\n\n\n\n\n\n\n\n\n\n\n \n \nContact\n\n\n\n\n\nX\n \n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n Une valorisation vertueuse de l’ensemble du biogaz pour la méthanisation à la ferme ​ \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSUBLIME Energie, première société à mission, permet la création de nouvelles filières locales d’approvisionnement de bioGNL et bioCO2 et donne accès au gisement de biomasse méthanisable issu des exploitations agricoles situées loin des réseaux.  \n\n\n\nDans une logique d’économie circulaire, nos équipements rendent possible un nouveau service de collecte, transport épuration et conditionnement de biogaz issu de méthanisation, répondant aux enjeux environnementaux et climatiques, tout en augmentant la résilience du monde agricole et la souveraineté énergétique des territoires. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\t\t\t\t\t\t\tDécouvrir notre technologie\n\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\t\t\t\t\t\t\tEn savoir plus sur SUBLIME Energie\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\t\t\t\t\t\t\tConnaître notre actualité  ​\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLa liquéfaction de biogaz pour répondre aux enjeux du marché de la méthanisation \n\n\n\n\n\n\n\nAujourd’hui, plus de 90% de la biomasse est détenue par les agriculteurs, mais le développement de la filière méthanisation est entravé par l'inadéquation entre les lieux de production potentiels de biogaz et ses lieux de consommation. La cogénération, historiquement utilisée, présente une rentabilité limitée en raison du faible rendement des moteurs, tandis que l'injection de biométhane dans les réseaux de gaz nécessite une coûteuse étape d'épuration préalable. Cela exclut les agriculteurs de petite taille ou éloignés des réseaux de gaz.SUBLIME Energie propose une solution, unique au monde, adaptée à de faibles débits, permettant la méthanisation à la ferme en mutualisant les coûts d'épuration, rendant ainsi rentables ces unités à impact positif.  \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\nUn modèle de méthanisation à la ferme \n\n\n\n\n\n\n\nUn investissement moindre et une rémunération juste pour l’agriculteur \n\n\n\n\n\n\n\nLa liquéfaction du biogaz permet son transport entre les lieux de production et de valorisation \n\n\n\n\n\n\n\nUne production mutualisée pour valoriser les co-produits (bioGNL et bioCO2) \n\n\n\n\n\n\n\n\n\n\n\nNous offrons une nouvelle voie de valorisation du biogaz de méthanisation sous forme de bioGNL, permettant la décarbonation du secteur du transport routier et des machines agricoles.Le bioGNL présente de nombreux avantages pour décarboner le premier secteur émetteur de gaz à effet de serre en France. D'abord, il réduit de 85% les émissions par rapport aux carburants fossiles aujourd'hui utilisés sur son cycle de vie complet. Ensuite, le bioGNL est une solution adaptée aux contraintes de la mobilité lourde et agricole avec une autonomie de plus de 1 000 kilomètres, un réapprovisionnement rapide et un confort de conduite amélioré. Enfin, le bioGNL est une technologie mature avec une croissance annuelle du parc de +36% depuis 2016 et facilement exploitable puisque ce carburant bas carbone s'utilise avec un moteur thermique.  \n\n\n\n\n\n\n\nLa nécessité de décarboner le secteur des transports \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\nProduire une énergie renouvelable valorisable localement \n\n\n\n\n\n\n\nUn carburant bas carbone adapté aux enjeux de la mobilité lourde \n\n\n\n\n\n\n\nUn usage mature en pleine croissance \n\n\n\n\n\n\n\n\n\n\n\nNos partenaires : \n\n\n\n \n\n \n\n \n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\nContact\nAdresse : 12 Rue Vivienne, 75002, Paris\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n  Email   \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\nCopyright © 2024 SUBLIME Energie\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://sublime-energie.com/notre-technologie/": "\n\n\n\n\n\n\n\nNotre technologie - SUBLIME Energie\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\n\t\tAller au contenu\n\n \n\n\n\n\n\n\n\n \n \n\n\n\n\n\n\n\n\n \n\n\nNotre technologie\nL’entreprise\nNos actualités\n\n\n\n\n\nX\n \n\n\n\n\n\n\n\n\n\n\nContact\n\n\n\n\n\n\n\n\n\n\n\n \n \nContact\n\n\n\n\n\nX\n \n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n Une innovation unique au monde de liquéfaction de biogaz​​ \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\t\t\t\t\t\t\tZoom sur notre technologie \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\t\t\t\t\t\t\tDécouvrir notre calendrier de maturation technologique\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\nZoom sur notre processus technologique : \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\nUn calendrier de maturation technologique ambitieux et réaliste  \n\n\n\n\n\n\n\n\n\n\n\n\n2026 \n\n\n\nMise en service de notre démonstrateur DELTA \n\n\n\nDELTA sera notre premier de série. Il réunira une dizaine d’exploitations agricoles et un hub. Il permettra de produire 3000 tonnes de bioGNL et 5500 tonnes de bioCO2.  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n2024 \n\n\n\nMise en service de notre démonstrateur CHARLIE \n\n\n\nCHARLIE correspondra à l’installation et l’utilisation de notre démonstrateur directement à la ferme chez un agriculteur partenaire, l’exploitation agricole GAZEA en Bretagne. Nous utiliserons un vrai biogaz issu du méthaniseur déjà en place pour éprouver notre technologie en environnement opérationnel intégré. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n2022 \n\n\n\nMise en service du démonstrateur BRAVO \n\n\n\nAprès une période de test, le démonstrateur a été mis en service à la fin de l’année et les tests de liquéfaction ont pu démarrer.   Abonnez-vous a notre lettre d’informations pour ne rien manquer ! En parallèle, nos équipes ont travaillé sur la conception d’un second démonstrateur nommé CHARLIE. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n2021 \n\n\n\nIngénierie et fabrication du démonstrateur laboratoire BRAVO \n\n\n\nUn ans après la création de l’entreprise, SUBLIME Energie s’est lancé dans la création d’un démonstrateur à l’échelle 1 en collaboration avec des acteurs industriels. Ce démonstrateur a pour objectif de prouver l’efficacité et les performances des innovations développées par l’entreprise, avec un débit de biogaz équivalent à celui de la méthanisation à la ferme.En 2021, un deuxième brevet a été déposé par SUBLIME Energie. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n2020 \n\n\n\nALPHA notre POC (Proof Of Concept)  \n\n\n\nEn 2020 nous avons développé notre POC, ALPHA, permettant de démontrer le bon fonctionnement de notre technologie sur de faibles débits de biogaz de synthèse. Cette même année, SUBLIME Energie a conclu un partenariat R&D avec Mines Paris – PSL ainsi que l’octroi d’une licence exclusive d’exploitation du brevet de liquéfaction de biogaz, déposé par Mines Paris. \n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\nContact\nAdresse : 12 Rue Vivienne, 75002, Paris\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n  Email   \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\nCopyright © 2024 SUBLIME Energie\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://sublime-energie.com/entreprise/": "\n\n\n\n\n\n\n\nL'entreprise - SUBLIME Energie\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\n\t\tAller au contenu\n\n \n\n\n\n\n\n\n\n \n \n\n\n\n\n\n\n\n\n \n\n\nNotre technologie\nL’entreprise\nNos actualités\n\n\n\n\n\nX\n \n\n\n\n\n\n\n\n\n\n\nContact\n\n\n\n\n\n\n\n\n\n\n\n \n \nContact\n\n\n\n\n\nX\n \n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n Une entreprise et une équipe engagées \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\t\t\t\t\t\t\tSUBLIME Energie en tant que société à mission\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\t\t\t\t\t\t\tNos impacts induits et évités\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\t\t\t\t\t\t\tUne équipe compétente et motivée\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSUBLIME Energie la première entreprise à mission \n\n\n\n\n\n\n\n\n\n\n\n\nSUBLIME Energie est une entreprise à mission, start-up Deeptech et spin-off de Mines Paris PSL. L’entreprise travaille depuis sa création en juillet 2019 sur une technologie unique au monde de liquéfaction de biogaz permettant le développement de la petite méthanisation à la ferme et la production locale de bioGNL, un carburant bas-carbone pour la mobilité lourde et de bioCO2. \n\n\n\n\n\n\n\n\n\n\n\nNotre raison d’être : \n\n\n\n \n\n\n\n\n\n\n\n« Contribuer à la nécessaire révolution écologique, sociale et énergétique des territoires par le développement de la production et de la valorisation de gaz renouvelables bas carbone en remplacement de leurs équivalents fossiles.«  \n\n\n\n\n\n\n\n\n\n\n\nNos 3 objectifs statutaires \n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\t\t\t\t\t\t\tObjectif 1 :\t\t\t\t\t\t\n\n\n\t\t\t\t\t\tDévelopper la production, la valorisation et l’utilisation de l'ensemble du biogaz pour substituer les gaz renouvelables bas carbone à leurs équivalents fossiles\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\t\t\t\t\t\t\tObjectif 2 :\t\t\t\t\t\t\n\n\n\t\t\t\t\t\tDévelopper l’économie circulaire, l'activité et l’indépendance des territoires, des paysans et des autres parties prenantes locales\n\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\t\t\t\t\t\t\tObjectif 3 :\t\t\t\t\t\t\n\n\n\t\t\t\t\t\tEncourager la recherche et l’enseignement dans le domaine des gaz renouvelables, dans le développement des modèles d’économie circulaire territoriale et dans la gestion responsable des entreprises.\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNotre comité de mission  \n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\nBenoît Legait \n\n\n\nPolytechnicien et Ingénieur du Corps des Mines spécialisé dans les énergies, ancien directeur des Mines Paris – PSL. Benoît est le président du comité de mission.  \n\n\n\n\n\n\n\n \n\n\n\nServane Lecollinet \n\n\n\nResponsable de l’unité de méthanisation de Gazea, administratrice de l’Association des Agriculteurs Méthaniseurs de France et membredu bureau depuis 2023. Servane est la vice-présidente du comité de mission.  \n\n\n\n\n\n\n\n \n\n\n\nArmand Hatchuel \n\n\n\nProfesseur et chercheur en sciences de gestion et en théorie de la conception à  Mines Paris – PSL. \n\n\n\n\n\n\n\n\n \n\n\n\n\nMarius Chapays \n\n\n\nResponsable Impacts, missions et RSE de SUBLIME Energie. Marius est le secrétaire du comité de mission. \n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\nMélanie Marcel  \n\n\n\nCEO et fondatrice de SoScience, experte en Recherche et Innovation responsable. \n\n\n\n\n\n\n\n\n \n\n\n\n\nTristan Dollé \n\n\n\nAncien Directeur Administratif et Financier de SUBLIME Energie. Historiquement, le premier salarié de l’entreprise.  \n\n\n\n\n\n\n\n\n \n\n\n\n\nInès Ben El Mekki \n\n\n\nDirectrice Technique de SUBLIME Energie. \n\n\n\n\n\n\n\n\n \n\n\n\n\nHayet Djelal \n\n\n\nEnseignante-chercheuse HDR dans le traitement et la valorisation des effluents à UniLaSalle Rennes. Co-pilote des groupes de travail méthanisation chez Bretagne Eco-Entreprise. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLes rapports du comité de mission et les audits : \n\n\n\n \n\n\n\n\n\n\n\n\nActualitésComité de mission\n\n\n\n\n\n\n\t\t\t\t\t\tRapport de mission 2023\t\t\t\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t11 juin 2024\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n                                        \t                                            Lire plus                                        \n\n\n\n\n\n\n\n\n\n\n\n\nActualitésComité de mission\n\n\n\n\n\n\n\t\t\t\t\t\tAudit entreprise à mission SUBLIME Energie\t\t\t\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t4 avril 2022\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n                                        \t                                            Lire plus                                        \n\n\n\n\n\n\n\n\n\nActualitésComité de mission\n\n\n\n\n\n\n\t\t\t\t\t\tRapport du comité de mission 2021\t\t\t\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t3 mars 2022\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n                                        \t                                            Lire plus                                        \n\n\n\n\n\n\n\n\n\nActualitésComité de mission\n\n\n\n\n\n\n\t\t\t\t\t\tRapport du comité de mission 2020\t\t\t\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t3 avril 2021\t\t\t\t\t\t\t\t\t\t\n\n\n\n\n                                        \t                                            Lire plus                                        \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\nLes impacts de notre activité  \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tNos impacts environnementaux\t\t\t\t\t\t\n\n\n\t\t\t\t\t\tNotre activité engendre un certain nombre d'impacts environnementaux positifs  \t\t\t\t\t\n\n\n\n\n\n\n \n\n\n \nDes émissions des GES (Gaz à Effet de Serre) évitées grâce à l'essor de la méthanisation à la ferme \n\n\n\n \nLa réduction des transports de matière par la liquéfaction du biogaz\n\n\n\n\n\n\n\n\n\n \nRéduction des émissions de GES et de particules fines par la commercialisation d'un carburant renouvelable bas carbone adapté à la mobilité lourde. \n\n\n\n \nRéduction du risque de lixiviation des nitrates par l'utilisation de digestat\n\n\n\n \nDiversification des cultures\n\n\n\n \nDes émissions de GES évitées par le remplacement de CO2 d'origine fossile​\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\t\t\t\t\t\t\tNos impacts sociaux et sociétaux \t\t\t\t\t\t\n\n\n\t\t\t\t\t\tAu-delà des impacts environnementaux engendrés par son activité, SUBLIME Energie souhaite construire des projets ayant un impact social et sociétal positif\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n \nCréation d'emplois non-délocalisables dans les territoires\n\n\n\n \nRevenus supplémentaires pour les exploitants agricoles\n\n\n\n \nAugmentation de l'attractivité des territoires et des opportunités\n\n\n\n \nMise aux normes des exploitations\n\n\n\n \nRéduction des dépenses d'engrais chimiques\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNotre équipe  \n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nDirigeant / Fondateur \n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nBruno Adhémar \n\n\n\nIngénieur INPG Phelma, diplômé en 1990, Bruno a travaillé 27 ans chez Orano (ex Aeva). Il a notamment codirigé de 2007 à 2011, la Business Line Transports de la BU Logistique d’AREVA. De 2000 à 2001, il a été coordinateur technique pour la construction d’une unité de traitement des fluides contaminés issus de l’accident de Tchernobyl.Entre Avril et Juillet 2011, il était au Japon le Chef de projet de la première unité de décontamination de l’eau issue de l’accident de Fukushima Daïchi. A son retour il a pioté jusqu’en 2018 la mise en place de la Force d’Intervention Nationale en cas d’accident grave, la FINA.De forte culture industrielle, Il dispose de compétences en management d’équipes et de projets ainsi qu’en gestion des situations de crise. Il est titulaire depuis 2019 du Mastère spécialisé « Second Life – Deep Tech Entrepreneur » de MINES Paris – PSL. \n\n\n\n\n\n\n\n\n\n\n\nInes Ben El Mekki \n\n\n\nInès est Docteure en génie des procédés et énergétique. Après une experience chez ExxonMobil en tant qu’ingénieure unité de production de résine, et chez Air Liquide en génie des procédés, Inès est aujourd’hui responsable technique et projet chez SUBLIME Energie et coordonne le développement du projet Charlie. \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\nDirectrice technique  \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nResponsable Administratif et Financier \n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nNicholas-Louis Berthier \n\n\n\n\n\n\n\n\n\n\n\nAmatalrhman Radman \n\n\n\nRecrutée en septembre 2021, Amatalrhman est titulaire d’un diplôme d’ingénieur en génie des procédés de l’ENSGTI de Pau et d’une bourse d’excellence de la filiale Total Exploration & Production Yémen. Elle a effectué son stage de fin d’études à l’IFPEN afin de développer un outil de simulation d’absorbeur du procédé DMXTM, dans le cadre d’un projet européen 3D (DMXTM Demonstration in Dunkirk) pour le captage du CO2. Elle est également l’auteure d’un article scientifique sur l’adsorption du CO2 dans les différents types de schistes de Marcellus, rédigé lors de son expérience à l’université de Petronas (Malaisie). Amatalrhman a notamment étudié lors de ses précédentes expériences professionnelles le captage et l’absorption du CO2. \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\nIngénieure procédés \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nIngénieur mécanique \n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nRedwan Mandouri \n\n\n\nRedwan a rejoint SUBLIME Energie en février 2022 dans le cadre de son stage de fin d’études et est ingénieur depuis août 2022 .Redwan est titulaire d’un master en ingénierie de la conception et la modélisation mécanique à l’université de Paris Saclay. \n\n\n\n\n\n\n\n\n\n\n\nJosephine Titeca \n\n\n\n Portée par ses convictions, Joséphine a rejoint SUBLIME Energie en septembre 2021 pour contribuer à relier agriculture et réponse aux défis climatiques. Ses missions permettent la définition d’une stratégie d’industrialisation à long terme en s’appuyant sur les retours d’expérience qu’elle collecte. Spécialisée en sciences environnementales, elle prépare son diplôme d’ingénieur en génie de l’environnement à l’école UniLaSalle à Rennes.  \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\nChargée d’industrialisation \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nResponsable RSE, impacts et missions \n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nMarius Chapays \n\n\n\nRecruté en janvier 2022, Marius s’occupe de l’évaluation, la valorisation et de la maximisation de l’impact environnemental et social de l’entreprise. En parallèle, il est investi dans la démarche d’entreprise à mission de SUBLIME Energie et est en charge de la communication externe de la structure. Marius est diplômé de l’école de commerce de Grenoble (GEM). Auparavant il a connu des expériences au sein d’une start-up, de la junior entreprise de son école et du Ministère de la Transition Ecologique (MTE). Il possède également des expériences associatives, puisqu’il est notamment fondateur et président d’une association humanitaire. Passionné par les énergies renouvelables et leur interêt pour la société et l’environnement, c’est le potentiel d’impact de SUBLIME Energie qui l’a poussé à rejoindre l’aventure. \n\n\n\n\n\n\n\n\n\n\n\nRachel Sfeir \n\n\n\nRecrutée en Septembre 2022, Rachel est ingénieure en chimie industrielle et pétrochimie, après une expérience en tant qu’ingénieure d’études dans le traitement de l’eau et les procédés membranaires au CNRS et en partenariat avec TotalEnergies. \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\nIngénieure procédés \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\nIngénieur procédés \n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\nGuillermo Hernán Zahler \n\n\n\nGuillermo a été recruté en septembre 2021 chez SUBLIME Energie.Il est titulaire d’un double diplôme en génie chimique, avec une spécialisation en génie des procédés, effectué à l’Ecole Nationale Supérieure de Chimie de Paris (Chimie ParisTech – PSL), France, et à la Facultad de Ingeniería Química de la Universidad Nacional del Litoral (FIQ – UNL), Argentine, entre 2016 et 2022. Guillermo dispose d’une expérience industrielle dans le dimensionnement des équipements, la simulation et l’optimisation des procédés, autant en France comme en Argentine. \n\n\n\n\n\n\n\n\n\n\n\nKathryn Welles \n\n\n\nKaty est diplômée du Smith College aux Etats-Unis où elle a étudié l’histoire de l’art, le français et les musées. Après avoir enseigné l’anglais dans des écoles primaires françaises pendant deux ans, elle s’est orientée vers l’administration scolaire. Elle a notamment travaillé pour le programme d’études à l’étranger du Sarah Lawrence College, la Chapin School de New York et l’Université américaine de Paris. Recrutée en février 2024, Katy s’occupe notamment des tâches administratives, des opérations quotidiennes et des ressources humaines chez SUBLIME Energie. \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\nOffice manager \n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\nContact\nAdresse : 12 Rue Vivienne, 75002, Paris\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n  Email   \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\nCopyright © 2024 SUBLIME Energie\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://sublime-energie.com/actualites-2/": "\n\n\n\n\n\n\n\nActualités - SUBLIME Energie\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\n\t\tAller au contenu\n\n \n\n\n\n\n\n\n\n \n \n\n\n\n\n\n\n\n\n \n\n\nNotre technologie\nL’entreprise\nNos actualités\n\n\n\n\n\nX\n \n\n\n\n\n\n\n\n\n\n\nContact\n\n\n\n\n\n\n\n\n\n\n\n \n \nContact\n\n\n\n\n\nX\n \n\n\n\n\n\n\n \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n \n\n\n\n\t\t\t\t\t\t\tNos actualités \t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\t\t\t\t\t\t\tDécouvrez nos dernières actualités\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\t\t\t\t\t\t\tAbonnez-vous à notre lettre d'information\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\nNos dernières publications \n\n\n\n \n\n\n\n\n\n\n\n\nActualitésComité de mission\n\n\n\n\n\n\n\t\t\t\t\t\tRapport de mission 2023\t\t\t\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t11 juin 2024\t\t\t\t\t\t\t\t\t\t\n\n\nActualités Rapport de mission 2023 : SUBLIME Energie, entreprise à mission depuis…\n\n\n                                        \t                                            Lire plus                                        \n\n\n\n\n\n\n\n\n\n\n\n\nActualités\n\n\n\n\n\n\n\t\t\t\t\t\tPremière mondiale\t\t\t\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t31 mai 2024\t\t\t\t\t\t\t\t\t\t\n\n\nActualités Première mondiale : Issue du Centre Énergie Environnement Procédés (CEEP) de…\n\n\n                                        \t                                            Lire plus                                        \n\n\n\n\n\n\n\n\n\n\n\n\nActualités\n\n\n\n\n\n\n\t\t\t\t\t\tLevée de fonds 11,5 M€ – Série A\t\t\t\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t11 mars 2024\t\t\t\t\t\t\t\t\t\t\n\n\nActualités SUBLIME Energie lève 11,5 millions d’euros pour déployer la liquéfaction de…\n\n\n                                        \t                                            Lire plus                                        \n\n\n\n\n\n\n\n\n\n\n\n\nActualités\n\n\n\n\n\n\n\t\t\t\t\t\tRapport du comité de mission 2022\t\t\t\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t18 avril 2023\t\t\t\t\t\t\t\t\t\t\n\n\nActualités Notre rapport du comité de mission 2022 est en ligne !…\n\n\n                                        \t                                            Lire plus                                        \n\n\n\n\n\n\n\n\n\n\n\n\nActualitésComité de mission\n\n\n\n\n\n\n\t\t\t\t\t\tAudit entreprise à mission SUBLIME Energie\t\t\t\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t4 avril 2022\t\t\t\t\t\t\t\t\t\t\n\n\nActualités Validation de nos engagements sociaux et environnementaux ! Première entreprise du…\n\n\n                                        \t                                            Lire plus                                        \n\n\n\n\n\n\n\n\n\nActualitésComité de mission\n\n\n\n\n\n\n\t\t\t\t\t\tRapport du comité de mission 2021\t\t\t\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t3 mars 2022\t\t\t\t\t\t\t\t\t\t\n\n\nActualités Notre rapport du comité de mission 2021 est en ligne !…\n\n\n                                        \t                                            Lire plus                                        \n\n\n\n\n\n\n\n\n\nActualitésComité de mission\n\n\n\n\n\n\n\t\t\t\t\t\tRapport du comité de mission 2020\t\t\t\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t3 avril 2021\t\t\t\t\t\t\t\t\t\t\n\n\nActualités Notre rapport est en ligne SUBLIME-Energie-Rapport-du-comite-de-mission-2020Télécharger\n\n\n                                        \t                                            Lire plus                                        \n\n\n\n\n\n\n\n\n\nActualités\n\n\n\n\n\n\n\t\t\t\t\t\tLevée de fonds – Amorçage\t\t\t\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t1 mars 2021\t\t\t\t\t\t\t\t\t\t\n\n\nActualités SUBLIME Energie annonce une levée de fonds de 1 M€ auprès…\n\n\n                                        \t                                            Lire plus                                        \n\n\n\n\n\n\n\n\n\nActualités\n\n\n\n\n\n\n\t\t\t\t\t\tConvention d’exploitation de la technologie de liquéfaction de…\t\t\t\t\t\n\n\n\n\n\n\t\t\t\t\t\t\t\t\t\t\t22 septembre 2020\t\t\t\t\t\t\t\t\t\t\n\n\nActualités MINES ParisTech – PSL, première école d’ingénieurs en France par son…\n\n\n                                        \t                                            Lire plus                                        \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\nSuivez nous sur linkedin  \n\n\n\n \n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nL'abonnement à notre lettre d'information semestrielle  \n\n\n\n\n\n\n\n\n\n\n\nVeuillez activer JavaScript dans votre navigateur pour remplir ce formulaire.Identité *PrénomNomProfession *PrénomNomEmail *Envoyer  \n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\nContact\nAdresse : 12 Rue Vivienne, 75002, Paris\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n  Email   \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\nCopyright © 2024 SUBLIME Energie\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://sublime-energie.com": "\n\n\n\n\n\n\n\n\n\nAccueil - SUBLIME Energie\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\r\n\t\tAller au contenu\n\n \n\n\n\n\n\n\n\n \n \n\n\n\n\n\n\n\n\n \n\n\nNotre technologie\nL’entreprise\nNos actualités\n\n\n\n\n\nX\n \n\n\n\n\n\n\n\n\n\n\nContact\n\n\n\n\n\n\n\n\n\n\n\n \n \nContact\n\n\n\n\n\nX\n \n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n Une valorisation vertueuse de l’ensemble du biogaz pour la méthanisation à la ferme ​ \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSUBLIME Energie, première société à mission, permet la création de nouvelles filières locales d’approvisionnement de bioGNL et bioCO2 et donne accès au gisement de biomasse méthanisable issu des exploitations agricoles situées loin des réseaux.  \n\n\n\nDans une logique d’économie circulaire, nos équipements rendent possible un nouveau service de collecte, transport épuration et conditionnement de biogaz issu de méthanisation, répondant aux enjeux environnementaux et climatiques, tout en augmentant la résilience du monde agricole et la souveraineté énergétique des territoires. \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n \n\n\n\n\n\t\t\t\t\t\t\tDécouvrir notre technologie\n\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\t\t\t\t\t\t\tEn savoir plus sur SUBLIME Energie\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\t\t\t\t\t\t\tConnaître notre actualité  ​\t\t\t\t\t\t\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nLa liquéfaction de biogaz pour répondre aux enjeux du marché de la méthanisation \n\n\n\n\n\n\n\nAujourd’hui, plus de 90% de la biomasse est détenue par les agriculteurs, mais le développement de la filière méthanisation est entravé par l'inadéquation entre les lieux de production potentiels de biogaz et ses lieux de consommation. La cogénération, historiquement utilisée, présente une rentabilité limitée en raison du faible rendement des moteurs, tandis que l'injection de biométhane dans les réseaux de gaz nécessite une coûteuse étape d'épuration préalable. Cela exclut les agriculteurs de petite taille ou éloignés des réseaux de gaz.SUBLIME Energie propose une solution, unique au monde, adaptée à de faibles débits, permettant la méthanisation à la ferme en mutualisant les coûts d'épuration, rendant ainsi rentables ces unités à impact positif.  \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\nUn modèle de méthanisation à la ferme \n\n\n\n\n\n\n\nUn investissement moindre et une rémunération juste pour l’agriculteur \n\n\n\n\n\n\n\nLa liquéfaction du biogaz permet son transport entre les lieux de production et de valorisation \n\n\n\n\n\n\n\nUne production mutualisée pour valoriser les co-produits (bioGNL et bioCO2) \n\n\n\n\n\n\n\n\n\n\n\nNous offrons une nouvelle voie de valorisation du biogaz de méthanisation sous forme de bioGNL, permettant la décarbonation du secteur du transport routier et des machines agricoles.Le bioGNL présente de nombreux avantages pour décarboner le premier secteur émetteur de gaz à effet de serre en France. D'abord, il réduit de 85% les émissions par rapport aux carburants fossiles aujourd'hui utilisés sur son cycle de vie complet. Ensuite, le bioGNL est une solution adaptée aux contraintes de la mobilité lourde et agricole avec une autonomie de plus de 1 000 kilomètres, un réapprovisionnement rapide et un confort de conduite amélioré. Enfin, le bioGNL est une technologie mature avec une croissance annuelle du parc de +36% depuis 2016 et facilement exploitable puisque ce carburant bas carbone s'utilise avec un moteur thermique.  \n\n\n\n\n\n\n\nLa nécessité de décarboner le secteur des transports \n\n\n\n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\n\n\nProduire une énergie renouvelable valorisable localement \n\n\n\n\n\n\n\nUn carburant bas carbone adapté aux enjeux de la mobilité lourde \n\n\n\n\n\n\n\nUn usage mature en pleine croissance \n\n\n\n\n\n\n\n\n\n\n\nNos partenaires : \n\n\n\n \n\n \n\n \n\n \n\n\n\n\n\n\n\n\n \n\n\n\n\n\n\n\n \n\n\n\nContact\nAdresse : 12 Rue Vivienne, 75002, Paris\n\n\n\n\n\n\n\n\n\n\n\n\n \n\n  Email   \n\n\n\n\n\n \n\n\n\n\n\n\n\n\n\nCopyright © 2024 SUBLIME Energie\n \n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}]}