{"text": [{"https://synapses.vc": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nHome | Synapses\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageHomePortfolioTeamResourcesDrawing on the power of human ingenuity, industry and collaboration to bring us in harmony with natureVenture fund supporting science-led global winners across\nClimateTech and HealthTechWe are building a multi-generational venture investment platform focused on identifying and supporting STEM start-ups solving for people and planet with the potential for global market leadership.WHY ?Building a future our children deserveHuman innovation and economic activity has dramatically improved quality of life, but at a huge cost. The resulting shifts in climatic patterns now threaten to destroy the lives and livelihoods of our people as the planet hurtles towards ecological collapse. Ours might be the last generation that can stop catastrophic climate change. The time to act is NOW!WHAT ?​01Identify and support global innovation at scaleIdentifying globally relevant STEM innovations and facilitating their scale up journey to market leadership by providing risk capital alongside strategic and operational support.02Taking on the hard stuffDriving alpha and impact by focusing on the confluence of STEM innovation, agile and resilient infrastructure like solutions that can be deployed at scale.03Climate Change mitigation and adaptationFocused on four major thematic areas across the climate change mitigation and adaptation spectrum.HOW ?A unique approach based on three core elements01. STEM solutions to create an alternate futureA first principles approach to solving hard problems with a science and engineering lens, that enables a step change disruption and establishes a new market paradigm.02. Deeply thematic approach to discovering innovationsPreidentified thesis driven global hunt for innovations with strongly aligned strategic partners enabling tech transfers between Asia and the world.03. Catalyse collective scale-up support via global synaptic connectionsNo one organization can do it alone. We will build knowledge, technology, and capital bridges for concerted, coordinated, and cooperative efforts from a breadth of stakeholders to  support commercialization at scale.SynapsesContact Us© 2024 | Synapses Business Services LLP. \nAll Rights Reserved.Email: info@synapses.vcDisclaimer\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nbottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.synapses.vc/portfolio": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPortfolio | Synapses\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageHomePortfolioTeamResourcesComing SoonSynapsesContact Us© 2024 | Synapses Business Services LLP. \nAll Rights Reserved.Email: info@synapses.vcDisclaimer\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nbottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.synapses.vc/about-1": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTeam | Synapses\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageHomePortfolioTeamResourcesMeet The TeamWe strive to serve our portfolio.Ruchira ShuklaKarthik ChandrasekarApurva KediaSreyashee DasShikhita GuptaAnish TutejaShalini PetwalRahul KumarIwank NegiSynapsesContact Us© 2024 | Synapses Business Services LLP. \nAll Rights Reserved.Email: info@synapses.vcDisclaimer\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nbottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.synapses.vc/resources": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nResources | Synapses\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageHomePortfolioTeamResourcesResourcesFeaturedIBlogsINewsNewsSynapses, a Pioneering Fund Focused on Establishing India as the Leading STEM Innovation Hub for Global Climate Action.Read MoreFormer IFC, TVS Capital exces launch $125-mn deeptech fund to invest in climate and health startups. Read MoreSynapses, launches $125mn VC fund for focused on climate, health tech.Read MoreSynapses, launches $125M VC fund focusing on STEM solution for climate, healthtech.Read MoreNew Venture Capital firm Synapses to invest in climate tech , health tech startups.Read MoreFormer IFC executive, startup VC launch new $125 million fund for STEM innovation in climate, health.Read MoreInvestors taking a shine to Indian climate tech space\nRead MoreFormer IFC exexc Ruchira Shukla-led VC firm launches 125m debut fund.Read MoreBlogsInvestment Opportunity in Climate-tech: Sustainable Agriculture and Land Use PatternsRead MoreCatapulting startups into scale mode or the answer to the question — “Do you have revenues?”Read MoreSynapsesContact Us© 2024 | Synapses Business Services LLP. \nAll Rights Reserved.Email: info@synapses.vcDisclaimer\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nbottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.synapses.vc/disclaimer": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDisclaimer | Synapses\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageHomePortfolioTeamResourcesDisclaimerWelcome to the website of Synapses.vc, a property of Synapses Business Services LLP. By accessing and using this website, you acknowledge and agree to the following terms and conditions:\n \nGeneral Information Only: The information provided on this website is for general informational purposes only. While we strive to keep the information accurate and up to date, we make no claims about the completeness, accuracy, reliability, suitability, or availability of the information, services, or related graphics on the website for any purpose. Any reliance you place on such information is strictly at your own risk.\n \nLimitation of Liability: In no event shall Synapses be liable for any loss or damage, including without limitation, indirect or consequential loss or damage, whatsoever arising from loss of data or profits arising out of, or in connection with, the use of this website.\n \nExternal Links: Through this website, there are links to other websites which are not under the control of Synapses. As such do not have any control over the nature, content, and availability of those sites. The inclusion of any links does not necessarily imply that we endorse the views expressed within them.\n \nNo Warranty of Virus-Free Content: Despite our best efforts, we cannot guarantee that the documents on this site are free from viruses or other harmful components. Users are responsible for ensuring appropriate precautions are taken from their end to protect against viruses or other harmful components.\n \nWebsite Availability: Every effort is made to keep the website up and running smoothly. However, Synapses takes no responsibility for, and will not be liable for, the website being temporarily unavailable due to technical issues beyond our control.\n \nModification of Content: We reserve the right to modify, update, or remove any content on this website without prior notice.\n \nNo Professional Advice: The information provided on this website is not intended to constitute any professional advice. Users should seek appropriate professional advice tailored to their specific circumstances.\n \nJurisdiction and Applicable Law: This disclaimer and any dispute arising out of or in connection with this website shall be governed by and construed by the laws of India.\n \nFeedback and Error Reporting: We welcome your suggestions to improve our site and request that any errors found may kindly be brought to our notice.\n \nBy continuing to use this website, you accept and agree to be bound by the terms and conditions of this disclaimer. If you do not agree to these terms and conditions, please refrain from using our website.SynapsesContact Us© 2024 | Synapses Business Services LLP. \nAll Rights Reserved.Email: info@synapses.vcDisclaimer\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nbottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}]}