{"text": [{"https://www.tandempv.com": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTandem PV - A Leader in Perovskite Solar Technology\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageTandem PV Announces Latest Funding RoundHome AboutTechnologySolar NewsInvestorsCareersBlogFAQPressSubscribe\n\n\n\n\nA Leader in Perovskite\nSolar TechnologyWe’re commercializing the most powerful and durable perovskite solar panel on the marketOUR MISSIONAccelerating to Net Zero with Perovskite Solar PanelsThe renewable energy revolution is underway, but solar power, already the world's fastest-growing energy source, must become even cheaper and easier to manufacture to meet our climate challenge. Tandem PV is leading the charge by developing a more powerful, durable and affordable solar panel to speed the commercialization of perovskite technology.\n \n\"We've been consistently told by the top solar industry experts that Tandem PV has the best combination of high efficiency and durability of any perovskite panel in commercial development.\"\n​\n- Scott Wharton, CEODISRUPTIVE TECHNOLOGYOur Targets\nEfficiency: 26-30%\nDurability: Decades\n​\nPerovskite is the power behind our panels. This synthetic crystalline material is sensitive to wavelengths of light that conventional silicon solar panels do not efficiently convert to electricity.\n \nTandem PV’s design boosts the output of conventional solar modules by stacking them with thin-film perovskite. We are producing tandem perovskite panels with 26% efficiency—which is roughly 25% more powerful than the average silicon solar panel.  We have also demonstrated the equivalent of decades of durability in the lab and plan to obtain third-party validation of our panels’ efficiency and durability during 2024.\n​\nSee our FAQ page for more information.Learn More\n\n\n\n\n\nLOWER COSTOur tandem approach results in more power at the same price per watt, which leads to lower labor and land costs, resulting in a lower total cost of ownership.\n \nWe are also developing a robust portfolio of patents in core perovskite-layer technology,\nsystem, and durability performance. We have several academic intellectual-property\npartnerships, including a collaboration with the University of North Carolina.Learn More\n\n\n\n\n\nCUTTING-EDGE\nDURABILITYPerovskites can degrade when they react with moisture and oxygen or with extended exposure to light, heat or voltage (just as silicon-based solar panels can). However, Tandem PV is drawing on years of solar industry experience and patented technology to demonstrate extended durability through a variety of technology and design innovations.Learn More\n\n\n\n\n\nOur VisionOur vision is to revolutionize the energy landscape, making clean and efficient solar power accessible to all to reduce our world's carbon footprint.\n \nMore powerful, affordable and easy-to-manufacture solar panels will be especially beneficial where land, labor, and rooftop space are scarce, whether in urban or remote regions of the globe. Our goal is to dramatically lower the cost of solar worldwide, accelerating the transition to a sustainable future.Learn More\n\n\n\n\n\nTandem PV by the numbers$28MFUNDS RAISED16GOVERNMENT GRANTS26%DecadesHIGHER EFFICIENCY PANELSDEMONSTRATED DURABILITYWORK WITH USOur\nCustomersTandem PV, guided by decades of solar industry expertise, is manufacturing standard-size solar panels designed to align with any utility's existing ecosystem and meet your needs. Our panels provide more power at the same price per watt, which leads to lower labor, installation and land costs and a lower total cost of ownership for customers. We welcome you to join our growing community and explore the possibilities of a cleaner, more sustainable future together. We will initially focus on utility-scale projects, with utilities as our first customers. For other applications, please contact us at info@tandempv.com.Contact UsEmailinfo@tandempv.comAddress575 Dado Street\nSan Jose, CA 95131SUBSCRIBESign up to receive Tandem PV news and updatesSign UpThanks for submitting!© 2024 Tandem PV, Inc.\n\n\n\n\n\n\n\nbottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.tandempv.com": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTandem PV - A Leader in Perovskite Solar Technology\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageTandem PV Announces Latest Funding RoundHome AboutTechnologySolar NewsInvestorsCareersBlogFAQPressSubscribe\n\n\n\n\nA Leader in Perovskite\nSolar TechnologyWe’re commercializing the most powerful and durable perovskite solar panel on the marketOUR MISSIONAccelerating to Net Zero with Perovskite Solar PanelsThe renewable energy revolution is underway, but solar power, already the world's fastest-growing energy source, must become even cheaper and easier to manufacture to meet our climate challenge. Tandem PV is leading the charge by developing a more powerful, durable and affordable solar panel to speed the commercialization of perovskite technology.\n \n\"We've been consistently told by the top solar industry experts that Tandem PV has the best combination of high efficiency and durability of any perovskite panel in commercial development.\"\n​\n- Scott Wharton, CEODISRUPTIVE TECHNOLOGYOur Targets\nEfficiency: 26-30%\nDurability: Decades\n​\nPerovskite is the power behind our panels. This synthetic crystalline material is sensitive to wavelengths of light that conventional silicon solar panels do not efficiently convert to electricity.\n \nTandem PV’s design boosts the output of conventional solar modules by stacking them with thin-film perovskite. We are producing tandem perovskite panels with 26% efficiency—which is roughly 25% more powerful than the average silicon solar panel.  We have also demonstrated the equivalent of decades of durability in the lab and plan to obtain third-party validation of our panels’ efficiency and durability during 2024.\n​\nSee our FAQ page for more information.Learn More\n\n\n\n\n\nLOWER COSTOur tandem approach results in more power at the same price per watt, which leads to lower labor and land costs, resulting in a lower total cost of ownership.\n \nWe are also developing a robust portfolio of patents in core perovskite-layer technology,\nsystem, and durability performance. We have several academic intellectual-property\npartnerships, including a collaboration with the University of North Carolina.Learn More\n\n\n\n\n\nCUTTING-EDGE\nDURABILITYPerovskites can degrade when they react with moisture and oxygen or with extended exposure to light, heat or voltage (just as silicon-based solar panels can). However, Tandem PV is drawing on years of solar industry experience and patented technology to demonstrate extended durability through a variety of technology and design innovations.Learn More\n\n\n\n\n\nOur VisionOur vision is to revolutionize the energy landscape, making clean and efficient solar power accessible to all to reduce our world's carbon footprint.\n \nMore powerful, affordable and easy-to-manufacture solar panels will be especially beneficial where land, labor, and rooftop space are scarce, whether in urban or remote regions of the globe. Our goal is to dramatically lower the cost of solar worldwide, accelerating the transition to a sustainable future.Learn More\n\n\n\n\n\nTandem PV by the numbers$28MFUNDS RAISED16GOVERNMENT GRANTS26%DecadesHIGHER EFFICIENCY PANELSDEMONSTRATED DURABILITYWORK WITH USOur\nCustomersTandem PV, guided by decades of solar industry expertise, is manufacturing standard-size solar panels designed to align with any utility's existing ecosystem and meet your needs. Our panels provide more power at the same price per watt, which leads to lower labor, installation and land costs and a lower total cost of ownership for customers. We welcome you to join our growing community and explore the possibilities of a cleaner, more sustainable future together. We will initially focus on utility-scale projects, with utilities as our first customers. For other applications, please contact us at info@tandempv.com.Contact UsEmailinfo@tandempv.comAddress575 Dado Street\nSan Jose, CA 95131SUBSCRIBESign up to receive Tandem PV news and updatesSign UpThanks for submitting!© 2024 Tandem PV, Inc.\n\n\n\n\n\n\n\nbottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.tandempv.com/about": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nTandem PV: Our Journey, Leadership Team & Story to Commercialize Perovskite Solar Technology\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageTandem PV Announces Latest Funding RoundHome AboutTechnologySolar NewsInvestorsCareersBlogFAQPressSubscribe\n\n\n\n\nOUR STORYTandem PV, based in Silicon Valley, was founded in 2016 in response to the urgent imperative for a swift global transition to net carbon zero. Solar power is now the world's cheapest energy source, but we must accelerate its exceptional growth to address our current critical environmental challenges.\n​\nOur founder and CTO, Colin Bailie, took on this challenge while earning his doctorate at Stanford University. There, he published seminal research on a then-new class of solar technology: perovskite-based tandem panels.\n \nChris Eberspacher, a solar energy innovator who had been working to mainstream solar since the 1980s, was so impressed with Bailie's groundbreaking R&D that he signed up as co-founder. At the time, Bailie was an Activate fellow at Cyclotron Road, the prestigious U.S. Department of Energy startup accelerator based at Lawrence Berkeley National Laboratory supporting innovations aimed at global impact.\n \nMeanwhile, Scott Wharton met Rob Carlson, managing director of the VC firm Planetary Strategies, at DLD (Digital – Life – Design), Europe’s leading innovation conference for visionaries from around the globe. Wharton had never heard of perovskite, but he had been fascinated by solar since his 20s. Tandem PV, funded by Planetary from the start, realized that Wharton’s extensive experience could turbocharge the company’s commercialization goals. Tandem PV allowed Wharton to realize his dream and to begin doing his part to bring about a carbon-free economy.\n \n“From the start of my doctoral studies, my advisor and I could see that low-cost tandems were the next frontier. Perovskite technology provided a platform for the perfect marriage with silicon and the idea of turning that potential into a commercial reality that could provide widespread climate benefits led me to launch Tandem PV.”\n- Colin Bailie\n \n\"I have had the good fortune to combine my experience in PV technology, products and strategy with Colin's experience and skills in perovskite materials and device science to help make perovskite-silicon tandems a commercial reality.\"\n- Chris Eberspacher\n \n“Everything just lined up—the timing, the complementary nature of our skills, the need to add commercial experience and scale Tandem, Colin's desire to focus more on tech. One thing led to another and I’m incredibly excited to be involved with such a superbly innovative company with cutting-edge technology and a world-class team.\"\n- Scott Wharton\n​\n“I’ve seen the company make some incredibly compelling strides in both efficiency and durability of its tandem silicon-perovskite solar panels. After nearly a decade of R&D, the company is ready to commercialize, and I feel so fortunate that I will be helping to lead Tandem PV through this next phase.\"\n- Saritha PeruriOur Journey2013BAILIE MAKES HIS FIRST PEROVSKITE SOLAR CELL2014BAILIE MAKES THE FIRST MECHANICALLY-STACKED PEROVSKITE-SILICON CELLOur Leadership TeamWe are a close-knit team driven to help build a cleaner energy future. This collective passion for change brought us together and inspires us to push the boundaries of science and technology. Our team possesses deep technical, manufacturing and scale-up expertise and we have key technology patents and partnerships with academia and government, including with the U.S. Dept. of Energy, the National Science Foundation, the California Energy Commission and the Lawrence Berkeley National Laboratory.Scott WhartonCEO Prior to joining Tandem, Wharton was Vice President and General Manager of Logitech B2B, a division that generates roughly $2 billion in annual revenue and includes all products, software and services for business and enterprise customers. Before leading the B2B group, Wharton drove 25x growth in Logitech's video collaboration division, building it from a small player in 2015 ($62 million) to the global market leader for video equipment generating over $1 billion annually. Under his leadership, Logitech developed award-winning products recognized by CES, iF Design, Red Dot, TIME and Fast Company for design innovation.\n\nWharton has held market-leading roles throughout his career in the communications space including as the founder of Vidtel, a pioneer in cloud-based video conferencing services. Vidtel had a successful exit in 2013.\n\nWharton was an early executive at BroadSoft (IPO; acquired by Cisco) and VocalTec (IPO) where he spearheaded numerous groundbreaking initiatives, including the development of the first commercial VoIP product, the creation of the cloud PBX market and the VoIP service provider industry. He holds an MBA from Yale University.Colin BailieFounder & CTOAs a doctoral candidate at Stanford University, Bailie performed seminal research on a then-new class of solar technology—perovskite-based tandem panels—which have the potential to substantially improve the power output of conventional solar modules. Bailie co-founded Tandem PV with Chris Eberspacher, our managing director, while an Activate fellow at Cyclotron Road, the U.S. Department of Energy startup accelerator based at Lawrence Berkeley National Laboratory. Bailie holds a Ph.D. in materials science and engineering from Stanford University and a B.S. in mechanical engineering from Texas A&M University. He was named by Forbes Magazine as one of the top 30 leaders in the world under 30.Chris EberspacherCo-founderEberspacher has worked in the solar energy industry for over 35 years with some of the world's leading solar innovators. Prior to co-founding Tandem PV, he led solar technology development at Hanwha Solar, a global leader in green energy solutions, and SoloPower Systems, an early developer of thin-film solar technology. Prior to that, he held senior solar technology posts at Nanosolar and Applied Materials and co-founded Unisun, where he led the development of innovative non-vacuum processes for fabricating thin-film PV. Early in his career, Eberspacher led research and development teams that pioneered thin-film CIGS photovoltaic materials, processes and product designs at ARCO Solar/Siemens Solar Industries. He holds a Ph.D. in applied physics from Stanford University and a B.S. in physics from the University of Texas at Austin.Saritha PeruriVice President of CommercializationPeruri, who brings over 20 years of solar and finance expertise to Tandem PV, joined the company from Elemental Excelerator, a nonprofit climate tech investor. As head of corporate partnerships, she grew and diversified Elemental’s partnerships network to create more commercial opportunities for the nonprofit’s expansive portfolio. In her final year at Elemental, Peruri shifted her primary focus to building a broad and collaborative ecosystem of capital and other providers to help enable startups to reach commercial scale. Her early achievements in the solar industry included developing over a dozen rooftop solar installations across Amazon’s fulfillment centers in the Northeast for Sol Systems. Peruri later worked for Pattern Energy, where she originated long-term wind and solar power purchase agreements with utilities and large commercial and industrial customers across the U.S. Peruri started her career as an investment banking analyst in Credit Suisse First Boston’s Global Energy Group and later worked as a management consultant with Bain & Company in Chicago. She holds an MBA from the Wharton School at the University of Pennsylvania and a bachelor of arts in economics and international relations from Brown University.NEWSTandem PV in the newsContact UsEmailinfo@tandempv.comAddress575 Dado Street\nSan Jose, CA 95131SUBSCRIBESign up to receive Tandem PV news and updatesSign UpThanks for submitting!© 2024 Tandem PV, Inc.\n\n\n\n\n\n\n\nbottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.tandempv.com/technology": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nDiscover Tandem PV's Innovative Perovskite Solar Technology\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageTandem PV Announces Latest Funding RoundHome AboutTechnologySolar NewsInvestorsCareersBlogFAQPressSubscribe\n\n\n\n\nPerovskite is the power behind our panels. This synthetic crystalline material is sensitive to wavelengths of light that conventional silicon solar panels do not efficiently convert to electricity. WHAT IS PEROVSKITE?Perovskite is a synthetic crystalline material that is sensitive to wavelengths of light that conventional silicon solar panels do not efficiently convert to electricity. Adding perovskite to traditional modules for a tandem technology can increase their power output and lower the cost of solar energy.PROPRIETARY TECHNOLOGYWe are developing a robust portfolio of patents in core perovskite-layer technology as well as key system and durability patents. Additionally, we have several academic IP partnerships including a collaboration with the University of North Carolina. We are in the process of filing several additional patents to expand and strengthen our IP portfolio in the coming months.Contact UsEmailinfo@tandempv.comAddress575 Dado Street\nSan Jose, CA 95131SUBSCRIBESign up to receive Tandem PV news and updatesSign UpThanks for submitting!© 2024 Tandem PV, Inc.\n\n\n\n\n\n\n\nbottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}, {"https://www.tandempv.com/solar-news": "\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSolar News | Tandem PV: What We've Been Reading\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\ntop of pageTandem PV Announces Latest Funding RoundHome AboutTechnologySolar NewsInvestorsCareersBlogFAQPressSubscribe\n\n\n\n\nWhat we've been readingDive into the latest in solar technology by reading articles and papers shaping the future of renewable energy curated by our team. Discover insightful perspectives, breakthrough research, and cutting-edge advancements as we stay at the forefront of the solar industry. Super-efficient solar cells: 10 Breakthrough Technologies 2024‘Godfathers of climate chaos’: UN chief urges global fossil-fuel advertising ban“Revolutionary” Breakthrough Boosts Solar Panel EfficiencyPerovskite Solar Cell Mystery Solved, Now Comes The Hard PartClosing the $150B Funding Gap With ‘Old Tools’ and ‘New Friends’ \n\nTandem PV's VP of Commercialization, Saritha Peruri, co-wrote this piece with Elemental ExceleratorHistoric Gemini Solar-Plus-Storage project, one of the nation’s largest of its kind, is now fully operationalContact UsEmailinfo@tandempv.comAddress575 Dado Street\nSan Jose, CA 95131SUBSCRIBESign up to receive Tandem PV news and updatesSign UpThanks for submitting!© 2024 Tandem PV, Inc.\n\n\n\n\n\n\n\nbottom of page\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n"}]}