{"@context": "http://schema.org", "@type": "Organization", "name": "Accacia", "url": "https://in.linkedin.com/company/accacia", "address": {"type": "PostalAddress", "streetAddress": "G9A/1 ", "addressLocality": "Gurgaon", "addressRegion": "Haryana", "postalCode": "122002", "addressCountry": "IN"}, "description": "Accacia is an AI-enabled platform to help real estate and infrastructure companies (developers, asset managers, financial institutions, operators, and governments) meet their net-zero goals.\n\nReal estate and infrastructure contribute to ~44% of global CO2 emissions and at the given speed, it’s expected to cost the world's financial sector $24.2tn, making it one of the most critical sectors to tackle the #climatechange problem. Our platform automates the measurement of scope 1, 2, and 3 carbon emissions for operating assets, and embodied carbon for under-construction assets. \n\nA platform uniquely designed for real estate and infrastructure sectors, Accacia.ai allows companies to track emissions at the asset and portfolio levels with full consideration to organizational boundaries as defined by GHG Protocol. This allows accurate allocation of emissions for different stakeholders including asset owners, operators, and tenants. Along with asset-level emissions, our platform also helps asset managers track environment-related climate risks for their portfolios.\n\nWith Accacia:\n\n📊 Track data and report carbon emission levels in compliance with the GHG framework\n\n📩 Get platform-integrated reporting; incl. TCFD, GRESB, CDP, and Investor Reporting\n\n📝 Plan mid-to-long term carbon offsetting\n- Carbon credit verification and trading (Mid to long-term horizon)\n- Choose from carbon offset projects and invest in such projects\n- Choose from IoT devices and capex projects for sustainable emission reduction\n\n🔍 Risk Management (Long-term horizon) \n- Understand #climaterisk for your portfolio and plan mitigation strategies\n\n𝐓𝐚𝐤𝐞 𝐭𝐡𝐞 𝐝𝐞𝐜𝐚𝐫𝐛𝐨𝐧𝐢𝐬𝐚𝐭𝐢𝐨𝐧 𝐢𝐧𝐢𝐭𝐢𝐚𝐭𝐢𝐯𝐞 𝐰𝐢𝐭𝐡 Accacia 𝐚𝐧𝐝 𝐳𝐞𝐫𝐨 𝐢𝐧 𝐨𝐧 𝐜𝐚𝐫𝐛𝐨𝐧 𝐞𝐦𝐢𝐬𝐬𝐢𝐨𝐧 𝐠𝐨𝐚𝐥𝐬.\n\nIf you are a real estate and infrastructure asset manager, please reach out to us at contact@accacia.ai to learn more.\n\n#RealEstate #climatechange #carbonmanagement", "numberOfEmployees": {"value": 46, "@type": "QuantitativeValue"}, "logo": {"contentUrl": "https://media.licdn.com/dms/image/C4D0BAQFW0yoZNLNgRg/company-logo_200_200/0/1677494518987/accacia_logo?e=2147483647&v=beta&t=vII2isqcnYVbA0wEcKIt9xBRINqggZK5tti9DmB3paM", "description": "Accacia", "@type": "ImageObject"}, "slogan": "AI-enabled platform to help real estate and infrastructure companies meet their net-zero goals", "sameAs": "https://accacia.ai"}