{"@context": "http://schema.org", "@type": "Organization", "name": "Amini", "url": "https://ke.linkedin.com/company/amini-technologies", "address": {"type": "PostalAddress", "addressLocality": "Nairobi", "addressCountry": "KE"}, "description": "At Amini, we are committed to making a difference for our customers, colleagues, and communities. We are a dynamic, fast-growing deep tech startup.  We are building environmental data infrastructure for Africa and the tropical belt. Amini is at the forefront of cutting-edge technology, utilizing Geospatial Data and AI / Machine Learning capabilities to solve environmental data scarcity for countries in the global south. Everyone at Amini knows how their work enables the realization of our vision. Without them and their contribution, we will not be a whole team, and we will not complete our mission. Every person at Amini knows that they matter and their work makes a difference — a difference to our company, a difference to our customers, and a difference to communities across Africa and the global south. \n\nOur team embodies inclusivity, diversity, agility, and dynamism. Comprising highly skilled experts, we recognize the transformational nature of our work while remaining humble, ego-free, and non-hierarchical. \n\nWe believe in our mission to build an environmental data infrastructure for Africa and the tropical belt to solve environmental data scarcity for countries in the global south. \n \nWe believe in our vision of Africa being a catalyst for global transformation and creating opportunities for over 1 billion lives. \n\nWe believe in our collective strength and talents - we have the brightest brains creating a leading edge platform and products, utilising AI to deliver the largest combined catalogue of satellite and ground truth data available for the tropical belt. \n\nWe believe in each other – We work together to achieve outstanding results. Amini’s people are great to work with, always inclusive, generous, quick to learn, energetic and fun, never bureaucratical or ego driven. \n\nWe believe our future is cosmic – We have huge, ambitious plans and the excitement about the impact our company can make and how we can enable the global south is off the charts.", "numberOfEmployees": {"value": 42, "@type": "QuantitativeValue"}, "logo": {"contentUrl": "https://media.licdn.com/dms/image/D4D0BAQHFhjUVPTxjSg/company-logo_200_200/0/1687458651856/amini_technologies_logo?e=2147483647&v=beta&t=s5hWl7L-QMzTwBNugP3TRVc4SlcVu1sADRN3jRpFR3o", "description": "Amini", "@type": "ImageObject"}, "slogan": "Building Africa's data infrastructure 🌍 ", "sameAs": "https://amini.ai/"}