{"@context": "http://schema.org", "@type": "Organization", "name": "Emissions Reduction Alberta (ERA)", "url": "https://ca.linkedin.com/company/emissions-reduction-alberta-era-", "address": {"type": "PostalAddress", "streetAddress": "1800, 10020 101A Ave", "addressLocality": "Edmonton", "addressRegion": "Alberta", "postalCode": "T5J 3G2", "addressCountry": "CA"}, "description": "ERA receives grants from government to fulfil our mandate. This funding comes from Alberta’s large emitters who choose to pay into the Climate Change and Emissions Management Fund as a compliance option if they are unable to meet emissions reduction targets.\n\nFor a decade and a half, our clean technology investments have helped innovators develop and demonstrate Alberta-based technologies that reduce emissions, lower costs, attract investment, and create jobs in Alberta.\n\nMandate\nTo identify and accelerate innovative solutions that secure Alberta’s success in a lower carbon economy.\n\nVision\nAlberta is recognized as an innovation and technology leader in a lower carbon world.\n\nTo achieve its vision and mandate, ERA will:\n\nReduce GHG emissions - Fund innovative solutions that result in meaningful greenhouse gas emissions reductions in Alberta and contribute to a lower carbon world.\n\nAdvance innovation system priorities - Leverage our strengths to contribute to critical climate change innovation priorities in Alberta.\n\nMeasure and communicate success - Define and report on metrics to demonstrate results.\n\nAchieve operational excellence - Strive for excellence in operations and efficiency while maintaining responsiveness to stakeholders and funders.\n\n\nOur portfolio of funded projects: http://ERAlberta.ca/projects\n\nERA is a registered tradename of the Climate Change and Emissions Management (CCEMC) Corporation.", "numberOfEmployees": {"value": 41, "@type": "QuantitativeValue"}, "logo": {"contentUrl": "https://media.licdn.com/dms/image/D560BAQH8y8vOdIrjRg/company-logo_200_200/0/1718720863402/emissions_reduction_alberta_era__logo?e=2147483647&v=beta&t=TQptQgjN9fG6uc1BdbPpWNxla8YwEDPwjXvqrUbp4lY", "description": "Emissions Reduction Alberta (ERA)", "@type": "ImageObject"}, "slogan": "We help reduce GHG emissions and strengthen the competitiveness of new and existing industries in Alberta. ", "sameAs": "http://www.eralberta.ca/"}