{"@context": "http://schema.org", "@type": "Organization", "name": "Energy Source", "url": "https://br.linkedin.com/company/energy-source-industria", "address": {"type": "PostalAddress", "streetAddress": "Rua Fernando de Souza, 1065 ", "addressLocality": "São João da Boa Vista", "addressRegion": "São Paulo", "postalCode": "13877-755", "addressCountry": "BR"}, "description": "A Energy Source foi fundada em 2016, com sede em São João da Boa Vista, no interior do estado de São Paulo, no Brasil.\n\nÉ uma empresa 100% nacional, com tecnologia européia, que visa a difusão das modernas baterias de Íons de Lítio (lithion-ion) e novas Tecnologias no armazendamento de energia, em substituição às antigas baterias de chumbo.\n\nA preocupação com o Meio Ambiente, é um dos valores fundamentais da empresa, que através da implantação da metodologia dos 3 R's consegue Reduzir, Reutilizar e Reciclar baterias de Lítio e restaurar seu ciclo de vida, eliminando os riscos de degradação e contaminação do solo causados por seu descarte inadequado.\n\nDIFERENCIAL\n\nDesde a sua fundação, o grande diferencial da Energy Source tem sido sua atenção especial ao mercado, em não apenas atender à demanda pelas novas baterias de íons de lítio, muito mais leves e eficientes, mas também em oferecer um atendimento personalizado de customização dessas baterias para projetos pontuais que demandem larga escala de produção.\n", "numberOfEmployees": {"value": 48, "@type": "QuantitativeValue"}, "logo": {"contentUrl": "https://media.licdn.com/dms/image/C4E0BAQHjbpNShQXG8w/company-logo_200_200/0/1630646272821/energy_source_industria_logo?e=2147483647&v=beta&t=I1JfBuFQB0wHLf8XXSJgb2EvK1i411w9fOPehhUBClk", "description": "Energy Source", "@type": "ImageObject"}, "slogan": "Indústria de Baterias de Litio com solução de Ciclo Fechado para Reuso e Reciclagem. ", "sameAs": "http://www.energysource.com.br"}