{"@context": "http://schema.org", "@type": "Organization", "name": "Recykal.com", "url": "https://in.linkedin.com/company/recykaldotcom", "address": {"type": "PostalAddress", "streetAddress": "134/2, Platinum street, Hi-Tech city, Whitefield, opp. SLN Terminus, Kondapur", "addressLocality": "Hyderabad", "addressRegion": "Telangana", "postalCode": "500032", "addressCountry": "IN"}, "description": "Recykal is a tech startup, headquartered in Hyderabad, formalizing the circular economy in India. We are the pioneer of the managed marketplace for the Circular Economy in India, enabling all stakeholders across waste management and recycling with a digitized waste management ecosystem. We operate in these categories offering circularity & sustainability solutions: plastic, paper, metal, e-waste, tyre and batteries.\n\nRecykal is a first-of-its-kind technology-driven solution provider for the waste management ecosystem and forms a key link between producers, waste generators, facilitators, and the different stakeholders in the waste management industry in India. \n\nSolving some of the biggest challenges faced by the industry, Recykal has successfully channelized 7,00,000 MT of waste and spread awareness on effective waste management. Today we have 400+ brands, 325+ recyclers and co-processors, 10,000+ businesses, 600+ urban local bodies, 3000+ service providers, and aggregators associated with us.\n\nAwards :\n\nRecykal is a trailblazer in sustainability and circular economy practices, receiving esteemed accolades such as being named the No. 1 Growth Champion in India by the Economic Times. Additionally, Fast Company has recognized us as one of the world's Most Innovative Companies, and the World Economic Forum has acknowledged us as a Tech Pioneer.\n", "numberOfEmployees": {"value": 359, "@type": "QuantitativeValue"}, "logo": {"contentUrl": "https://media.licdn.com/dms/image/D560BAQG0nPyqtV7R9Q/company-logo_200_200/0/1704341705149/recykaldotcom_logo?e=2147483647&v=beta&t=ev2mbOqdPdxmNNWBCnXExKUOn5nTk3HON1YMgrdJqd4", "description": "Recykal.com", "@type": "ImageObject"}, "slogan": "Sustainable Circularity", "sameAs": "https://recykal.com/"}