{"@context": "http://schema.org", "@type": "Organization", "name": "Remy", "url": "https://uk.linkedin.com/company/the-remy-app", "address": {"type": "PostalAddress", "addressLocality": "London", "addressCountry": "GB"}, "description": "Remy is your new digital kitchen assistant, helping you effortlessly understand what’s in your kitchen, when it expires, and how you can use it while offering you the option to buy what’s missing — directly from your smartphone. In doing so, we can collect novel emissions data to drastically improve our corporate partners’ Scope 3 emissions reporting, commercial strategies and waste mitigation efforts on our collective path to net zero.\n\nHow it works:\nRemy takes a holistic, automated approach to kitchen management, improving how users plan, buy, track and cook their food to help them have their kitchens at their fingertips.\n\nUsers are recommended recipes based on their kitchen inventory. Once chosen, any missing ingredients are automatically added to their smart shopping list. Through our in-app purchasing integration, users can order their shopping list at the click of a button. Everything purchased is then automatically uploaded to their digital kitchen, and each item’s expiration is predicted. If any ingredients are not allocated to a meal, users will be notified 72 hours before they expire and are recommended meals in which they can be used involving other ingredients already in the kitchen.\n\nThroughout this circular process, Remy can gather valuable real-time insights into user behaviour, purchasing habits and household food waste. This data can vastly improve our partners’ emissions reporting and waste mitigation strategies while enabling long-lasting customer relationships.", "numberOfEmployees": {"value": 8, "@type": "QuantitativeValue"}, "logo": {"contentUrl": "https://media.licdn.com/dms/image/D4E0BAQHOZ2DLF5v8sQ/company-logo_200_200/0/1715758962074/the_remy_app_logo?e=2147483647&v=beta&t=T6FmP3QiRmvs4iiQ-hn1Lx0frTC11kcPKpZu6362_P0", "description": "Remy", "@type": "ImageObject"}, "slogan": "Using AI to show you what food you have, when it expires, how it can be used and the option to buy what’s missing.", "sameAs": "https://remyapp.io"}