{"@context": "http://schema.org", "@type": "Organization", "name": "Roam", "url": "https://ke.linkedin.com/company/roamofficial", "address": {"type": "PostalAddress", "addressLocality": "Nairobi", "addressRegion": "Embakasi", "postalCode": "00500", "addressCountry": "KE"}, "description": "Do you think the way we move in cities needs to change? Us too. Roam exists to provide accessible, low-cost, and low-emission transport solutions for the vast population across Kenya and the greater African continent who primarily rely on public transport to get around. \n\nIn Africa, the devastating impact of the climate and air pollution crisis, driven mainly by fossil fuel-powered transportation, is becoming even more apparent. This calls for us to reimagine how we commute. \n\n10 of the largest cities by 2100 will be in Africa. These cities’ residents transport needs must be addressed. Picture a world where all these motorcycles and buses were electric. That is the future we are working towards here at Roam! We are designing, developing and deploying electric motorcycles and buses that are affordable, reliable and tailored to meet the unique needs of African cities. \n\nWe are opening Africa to a new frontier, a new electric revolution and in the process changing the way we move around the continent. All the while impacting our users' lives fundamentally by lowering transport fares and increasing their income.\n\nCurrently, we are operating in East Africa’s largest electric motorcycle assembly plant called Roam Park. This facility is contributing towards the electrification of Africa’s boda boda sector. \n\nWe are actively working towards a future where we can all move around in a sustainable, unfragmented public transport sector, a future free of climate disasters. Roam is going after a large opportunity and is currently hundreds of people strong, all working to actualize this electric future.", "numberOfEmployees": {"value": 189, "@type": "QuantitativeValue"}, "logo": {"contentUrl": "https://media.licdn.com/dms/image/C4E0BAQG594CgdkFDSQ/company-logo_200_200/0/1660209343356/roamofficial_logo?e=2147483647&v=beta&t=_gAVmWNb8kw5NpP77VgHNDnOSGvu__QX2YWMbAviA8A", "description": "Roam", "@type": "ImageObject"}, "slogan": "⚡️Electric Motorcycles | Electric Buses | Charging Infrastructure | Energy Systems⚡️", "sameAs": "www.roam-electric.com"}