{"@context": "http://schema.org", "@type": "Organization", "name": "SAEL ", "url": "https://in.linkedin.com/company/saelindustries", "address": {"type": "PostalAddress", "streetAddress": "IGI Airport T3 Road", "addressLocality": "New Delhi ", "addressRegion": "Delhi", "postalCode": "110037", "addressCountry": "IN"}, "description": "SAEL is a prominent Indian renewable energy company specializing in solar and waste-to-energy projects, dedicated to cultivating green assets that contribute to the global shift towards sustainable energy. SAEL is at the forefront of fighting climate change and provides decarbonising solutions through its renewable project across India. Our goal is to be a pioneer in meeting India’s energy demand by producing sustainable and affordable energy in a responsible manner.\n\n\nOver the years, SAEL has built a renewable portfolio of 4000 Mw with a committed EBITDA of INR 2400 Crores. Today, it proudly stands as the largest waste-to-energy producer in India, employing state-of-the-art European technology. The company also has more than 20 solar projects across India in States of Gujarat, Uttar Pradesh, Rajasthan, Karnataka, Andhra Pradesh, Haryana, Mizoram and Punjab. The company has more than 30 sites. The company also have module manufacturing plant of 2300 Mw in Rajasthan and Punjab which is a testament to its efforts of backward integration and contribution to make in India mission.\n\n\nSAEL's commitment to solar and waste-to-energy projects aligns seamlessly with India's dedication to harnessing clean and green energy sources. The company's enduring ethos reflects its ongoing efforts to drive positive environmental impact and sustainable development within the energy sector.", "numberOfEmployees": {"value": 595, "@type": "QuantitativeValue"}, "logo": {"contentUrl": "https://media.licdn.com/dms/image/D560BAQFLLgKakANUkQ/company-logo_200_200/0/1705489220627?e=2147483647&v=beta&t=Ap3I77aAL9JfzFXEDKTHRpBmBicLC8t9MKFlKvb_PLw", "description": "SAEL ", "@type": "ImageObject"}, "slogan": "Sustainable & Affordable Energy for Life", "sameAs": "https://www.sael.co"}