{"@context": "http://schema.org", "@type": "Organization", "name": "SkyTruth", "url": "https://www.linkedin.com/company/skytruth", "address": {"type": "PostalAddress", "addressLocality": "Shepherdstown", "addressRegion": "West Virginia", "postalCode": "25443", "addressCountry": "US"}, "description": "SkyTruth is a conservation technology nonprofit that inspires people to protect the planet by using satellite imagery, big data, and the latest technological innovations to reveal environmentally damaging actions and make their impacts visible and measurable. SkyTruth gives away all of our data and analysis for free, so that conservationists, policymakers, journalists, researchers, and activists can hold polluters accountable for harmful activities that would otherwise remain hidden from view.\n\nOver the past two decades, SkyTruth has transformed environmental protection with satellite imagery and analysis. With our partners Google and Oceana, we launched Global Fishing Watch to track vessel activity at sea, and we were the first to demonstrate that the 2010 Deepwater Horizon oil spill was vastly larger than the federal government and BP claimed. Today, with new technologies like machine learning and cloud computing, we are teaching computers to scan thousands of images available every day to automatically detect those changes around the globe. This will make it harder than ever for polluters, poachers, and extractive industries to get away with harming the planet. And it will create opportunities for governments and forward-thinking businesses to improve their environmental performance.", "numberOfEmployees": {"value": 25, "@type": "QuantitativeValue"}, "logo": {"contentUrl": "https://media.licdn.com/dms/image/C4D0BAQHP1TlJTDNkQA/company-logo_200_200/0/1630576626751/skytruth_logo?e=2147483647&v=beta&t=-ed22R0CSBmYf1CFYGmy7ATvPbzvPKvr2oWYVTbcOpc", "description": "SkyTruth", "@type": "ImageObject"}, "slogan": "Sharing the view from space to promote conservation for people and the planet", "sameAs": "https://skytruth.org"}