{"@context": "http://schema.org", "@type": "Organization", "name": "SOSV", "url": "https://www.linkedin.com/company/sosv", "address": {"type": "PostalAddress", "streetAddress": "174 Nassau Street, #3000", "addressLocality": "Princeton", "addressRegion": "New Jersey", "postalCode": "08542", "addressCountry": "US"}, "description": "SOSV is a global venture capital firm that operates early stage startup development programs.\n \nSOSV’s programs are focused on revolutionary deep technology that promises the betterment of humanity and the planet.\n\nThe firm’s strategy is to invest in a small number of highly promising startups and use its deeply resourced programs to accelerate product development, acquire customers, and scale. SOSV companies consistently raise funding rounds led by top tier investors. SOSV joins seed, Series A, and later rounds while providing founders with ongoing support and community. \n\nAs of January 2024, SOSV had more than 1,000 portfolio companies and $1.5 billion in assets under management.\n\nSOSV’s programs include hard tech-oriented HAX and life-science driven IndieBio. Both offer deep technical and scientific expertise on-site as well as well-equipped lab and fabrication facilities and supply chain access. \n\nAmong the top companies in SOSV’s portfolio are NotCo, Upside Foods, Unspun, Opentrons, Mycoworks, and Prime Roots. \n\nSOSV releases the annual Human Health 100, a list of the firm’s top human health investments in areas ranging from assistive robotics to therapeutics and diagnostics. \n\nSOSV also publishes the annual Climate Tech 100, a list of the firm’s top climate-focused investments working on solutions to climate change across five sectors: food, manufacturing, transport, energy, and building systems. ", "numberOfEmployees": {"value": 505, "@type": "QuantitativeValue"}, "logo": {"contentUrl": "https://media.licdn.com/dms/image/C4D0BAQEMDqnaB5iEkA/company-logo_200_200/0/1630495208658/sosv_logo?e=2147483647&v=beta&t=7Bjx9X0HBbjANVPRV8bWg1RBx5Gj6TJ_-gdZhebCe-c", "description": "SOSV", "@type": "ImageObject"}, "slogan": "SOSV is a multi-stage, deep tech VC focused on planetary and human health", "sameAs": "https://sosv.com"}