{"@context": "http://schema.org", "@type": "Organization", "name": "Univenture Inc.", "url": "https://www.linkedin.com/company/univenture", "address": {"type": "PostalAddress", "streetAddress": "16710 Square Dr", "addressLocality": "Marysville", "addressRegion": "Ohio", "postalCode": "43040", "addressCountry": "US"}, "description": "Univenture is a private diversified company that is ready to accelerate and take the company to the next level.\n\nSeeking to grow and positively impact humanity.  We have multiple brands or companies including an ownership stake in Biosortia Microbiomics.\n\n•Profitable, growing, customer focused companies with extensive product line, & over 75 patents have previously issued worldwide.\n\n•Over $430 Million in historic sales, & 27 profitable years with a diversified customer base, with 32 years out of 34 years we have positive EBITDA.\n\n•Multiple brands growing with substantial upside potential with various opportunities, including a disruptive Biotech.\n\n•5-time INC 500 awardee, Nations SBA Businessperson of the Year, and dozens of other awards and honors for the Company.\n\n• Customer love our products and technological solutions. Our history includes many top Fortune 500 customers.  Largest customer is about 10% of sales.\n\n•The partially owned biotech received funding from ARPA-E, DARPA, USAF-RL near $9 million and $12 million dilutive.\n\n•An inclusive, socially responsible, environmentally focused company building a high performing team.\n\n⭐️ ⭐️ ⭐️ ⭐️ ⭐️  Over 300 products online, manufacturing in Ohio, other components purchased & assembled in U.S.A\n\nThe Univenture website has links to all brands, companies, online sales channels.  Please visit these key growth companies.\n\nEnvyPak® - Lowest cost per response with highest open rate for direct mail - highly differentiated, highly engaging.\n\nUniKeep® - A better organizer or binder for home, office, & publishing - Environmentally friendly, long lasting, with functional standout differences.\n\nCardNoter® - Combining pockets with paper or plastics to create publishing & promotional products.\n\nBiosortia – Breakthrough Drug & Ag Discovery Technology \n– partially owned, currently about 5%, potentially up to 20%, possibly more.\n\nPackZen, Safety-sleeve® - packaging -various types including disc & sustainable, RRRR types ", "numberOfEmployees": {"value": 67, "@type": "QuantitativeValue"}, "logo": {"contentUrl": "https://media.licdn.com/dms/image/C560BAQE56LcF_VS7tA/company-logo_200_200/0/1630653215143/univenture_logo?e=2147483647&v=beta&t=zugCAxfvcGWGAKaKW48_dirwH9qmZYyZ0SqCcbmhFnw", "description": "Univenture Inc.", "@type": "ImageObject"}, "slogan": "A 34 Year History of Creating Innovative Technologies and Products      *\nStriving to Achieve the Next Level of Success ", "sameAs": "http://www.univenture.com"}